Repository: microsoft/vscode-mssql
Catalog: localization/xliff/data-workspace.*.xlf
Languages: es, ru

# projects.showNotAddedProjectsInWorkspacePrompt
source: Always show information message when the current workspace folders contain projects that have not been added to the workspace's projects.
es: Mostrar siempre el mensaje de información cuando las carpetas del área de trabajo actual contengan proyectos que no se hayan agregado a los proyectos del área de trabajo.
ru: Всегда показывать информационное сообщение, если текущие папки рабочей области содержат проекты, которые не были добавлены в проекты рабочей области.

# close-workspace-command
source: Close Workspace
es: Cerrar área de trabajo
ru: Закрыть рабочую область

# projects-view-no-workspace-content
source: Create new or open existing to get started. [Create new](command:projects.new) [Open existing](command:projects.openExisting) To learn more about projects [read our docs](https://aka.ms/azuredatastudio-projects).
es: Cree una nueva o abra una existente para empezar. [Crear nuevo](command:projects.new) [Abrir existente](command:projects.openExisting) Para obtener más información sobre los proyectos [lea la documentación](https://aka.ms/azuredatastudio-projects).
ru: Создайте новый или откройте существующий, чтобы начать работу. [Создать новый](command:projects.new) [Открыть существующий](command:projects.openExisting) Чтобы узнать больше о наших проектах, [см. нашу документацию](https://aka.ms/azuredatastudio-projects).

# main-view-name
source: Database Projects
es: Proyectos de base de datos
ru: Проекты баз данных

# data-workspace-view-container-name
source: Database Projects
es: Proyectos de base de datos
ru: Проекты баз данных

# projects.defaultProjectSaveLocation
source: Full path to folder where new projects are saved by default.
es: Ruta completa a la carpeta donde se guardan los nuevos proyectos de forma predeterminada.
ru: Полный путь к папке, в которой по умолчанию сохраняются новые проекты.

# projects.excludedProjectsDescription
source: List of projects in the workspace to exclude from the projects viewlet
es: Lista de proyectos del área de trabajo que se excluirán del viewlet de proyectos
ru: Список проектов в рабочей области, исключаемых из вьюлета проектов

# manage-project-command
source: Manage
es: Administrar
ru: Управление

# new-command
source: New
es: Nuevo
ru: Новое

# projects-view-no-project-content
source: No projects open in current workspace. [Create new](command:projects.new) [Open existing](command:projects.openExisting) To learn more about projects [read our docs](https://aka.ms/azuredatastudio-projects).
es: No hay proyectos abiertos en el área de trabajo actual. [Crear nuevo](command:projects.new) [Abrir existente](command:projects.openExisting) Para obtener más información sobre los proyectos [lea la documentación](https://aka.ms/azuredatastudio-projects).
ru: В текущей рабочей области нет открытых проектов. [Создать новый](command:projects.new) [Открыть существующий](command:projects.openExisting) Чтобы узнать больше о наших проектах, [см. нашу документацию](https://aka.ms/azuredatastudio-projects).

# open-existing-command
source: Open existing
es: Abrir existente
ru: Открыть существующий

# refresh-workspace-command
source: Refresh
es: Actualizar
ru: Обновить

# remove-project-command
source: Remove Project
es: Quitar proyecto
ru: Удалить проект
