Repository: microsoft/vscode-mssql
Catalog: localization/xliff/deu.xlf
Languages: de

# mssql.query.displayBitAsNumber
source: Should BIT columns be displayed as numbers (1 or 0)? If false, BIT columns will be displayed as 'true' or 'false'
de: BIT-Spalten als Zahlen (1 oder 0) anzeigen? Bei Festlegung auf FALSE werden BIT-Spalten als TRUE oder FALSE angezeigt.

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
de: Gibt an, ob IntelliSense aktiviert werden soll.

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
de: Gibt an, ob die IntelliSense-Fehlerüberprüfung aktiviert werden soll.

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
de: Gibt an, ob IntelliSense-QuickInfo aktiviert werden soll.

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
de: Gibt an, ob IntelliSense-Vorschläge aktiviert werden sollen.

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
de: Gibt an, ob IntelliSense-Vorschläge in Kleinbuchstaben angezeigt werden sollen.

# mssql.piiLogging
source: Should Personally Identifiable Information (PII) be logged in the Azure Logs output channel and the output channel log file.
de: Hiermit wird festgelegt, ob personenbezogene Informationen (PII) im Ausgangskanal und in der Protokolldatei des Ausgangskanals von Azure Logs protokolliert werden sollen.

# mssql.enableQueryHistoryFeature
source: Should Query History feature be enabled
de: Soll das Feature „Abfrageverlauf“ aktiviert werden

# mssql.format.alignColumnDefinitionsInColumns
source: Should column definitions be aligned?
de: Sollen Spaltendefinitionen ausgerichtet werden?

# mssql.format.datatypeCasing
source: Should data types be formatted as UPPERCASE, lowercase, or none (not formatted)
de: Gibt an, ob Datentypen in Großbuchstaben, Kleinbuchstaben oder gar nicht formatiert werden sollen.

# mssql.format.keywordCasing
source: Should keywords be formatted as UPPERCASE, lowercase, or none (not formatted)
de: Gibt an, ob Schlüsselwörter in Großbuchstaben, Kleinbuchstaben oder gar nicht formatiert werden sollen.

# mssql.persistQueryResultTabs
source: Should query result selections and scroll positions be saved when switching tabs (may impact performance)
de: Gibt an, ob beim Wechsel zwischen Registerkarten Ergebnisauswahlen und Scrollpositionen gespeichert werden sollen (kann die Leistung beeinträchtigen).

# mssql.format.placeSelectStatementReferencesOnNewLine
source: Should references to objects in a select statements be split into separate lines? E.g. for 'SELECT C1, C2 FROM T1' both C1 and C2 will be on separate lines
de: Sollen Verweise auf Objekte in einer SELECT-Anweisung in separaten Zeilen angezeigt werden? Beispielsweise werden bei "SELECT C1, C2 FROM T1" C1 und C2 jeweils in separaten Zeilen angezeigt.

# mssql.startQueryHistoryCapture
source: Start Query History Capture
de: Erfassung des Abfrageverlaufs starten

# mssql.maxRecentConnections
source: The maximum number of recently used connections to store in the connection list.
de: Die maximale Anzahl an zuletzt verwendeten Verbindungen, die in der Verbindungsliste gespeichert werden.

# mssql.objectExplorer.expandTimeout
source: The timeout in seconds for expanding a node in Object Explorer. The default value is 45 seconds.
de: Das Timeout in Sekunden für das Erweitern eines Knotens in Objekt-Explorer. Der Standardwert ist 45 Sekunden.

# mssql.toggleSqlCmd
source: Toggle SQLCMD Mode
de: „SQLCMD“-Modus umschalten

# mssql.messagesDefaultOpen
source: True for the messages pane to be open by default; false for closed
de: Bei Festlegung auf TRUE wird das Nachrichtenfenster standardmäßig geöffnet, bei Festlegung auf FALSE ist es geschlossen.

# mssql.chooseDatabase
source: Use Database
de: Datenbank verwenden

# mssql.objectExplorer.groupBySchema
source: When enabled, the database objects in Object Explorer will be categorized by schema.
de: Wenn diese Option aktiviert ist, werden die Datenbankobjekte im Objekt-Explorer nach Schema kategorisiert.

# mssql.saveAsCsv.textIdentifier
source: [Optional] Character used for enclosing text fields when saving results as CSV
de: [Optional] Trennzeichen für das Umschließen von Textfeldern, das beim Speichern der Ergebnisse als CSV verwendet wird.

# mssql.saveAsCsv.lineSeparator
source: [Optional] Character(s) used for separating rows when saving results as CSV
de: [Optional] Trennzeichen für die Trennung von Zeilen, das beim Speichern der Ergebnisse als CSV verwendet wird.

# mssql.copyRemoveNewLine
source: [Optional] Configuration options for copying multi-line results from the Results View
de: [Optional] Konfigurationsoptionen für das Kopieren von mehrzeiligen Ergebnissen aus der Ergebnisansicht.

# mssql.copyIncludeHeaders
source: [Optional] Configuration options for copying results from the Results View
de: [Optional] Konfigurationsoptionen für das Kopieren von Ergebnissen aus der Ergebnisansicht.

# mssql.applyLocalization
source: [Optional] Configuration options for localizing into VSCode's configured locale (must restart VSCode for settings to take effect)
de: [Optional] Konfigurationsoptionen für die Lokalisierung in das von VS Code konfigurierte Gebietsschema (VS Code muss neu gestartet werden, damit diese Einstellungen wirksam werden).

# mssql.splitPaneSelection
source: [Optional] Configuration options for which column new result panes should open in
de: [Optional] Konfigurationsoptionen zur Festlegung, in welcher Spalte neue Ergebnisansichten geöffnet werden.

# mssql.connection.applicationIntent
source: [Optional] Declares the application workload type when connecting to SQL Server such as ReadWrite or ReadOnly. Refer to SQL Server AlwaysOn for more detail.
de: [Optional] Gibt den Typ der Anwendungsarbeitsauslastung bei der Verbindungsherstellung mit SQL Server an, z. B. "ReadWrite" oder "ReadOnly". Weitere Informationen finden Sie im Abschnitt zu SQL Server Always On.

# mssql.saveAsCsv.delimiter
source: [Optional] Delimiter for separating data items when saving results as CSV
de: [Optional] Trennzeichen für die Trennung von Datenelementen, das beim Speichern der Ergebnisse als CSV verwendet wird.

# mssql.ignorePlatformWarning
source: [Optional] Do not show unsupported platform warnings
de: [Optional] Keine Anzeige von Warnungen zu nicht unterstützten Plattformen.

# mssql.saveAsCsv.encoding
source: [Optional] File encoding used when saving results as CSV
de: [Optional] Dateicodierung, die beim Speichern der Ergebnisse als CSV verwendet wird.

# mssql.connection.currentLanguage
source: [Optional] Indicates the SQL Server language settings.
de: [Optional] Gibt die SQL Server-Spracheinstellungen an.

# mssql.connection.emptyPasswordInput
source: [Optional] Indicates whether this profile has an empty password explicitly set
de: [Optional] Gibt an, ob für dieses Profil ausdrücklich ein leeres Kennwort festgelegt wurde.

# mssql.connection.typeSystemVersion
source: [Optional] Indicates which server type the provider will expose through the DataReader.
de: [Optional] Gibt an, welchen Servertyp der Anbieter über den DataReader verfügbar macht.

# mssql.logDebugInfo
source: [Optional] Log debug output to the VS Code console (Help -> Toggle Developer Tools)
de: [Optional] Protokollieren Sie die Debugausgabe in der VS Code-Konsole (Hilfe > Entwicklertools umschalten).

# mssql.tracingLevel
source: [Optional] Log level for backend services. Azure Data Studio generates a file name every time it starts and if the file already exists the logs entries are appended to that file. For cleanup of old log files see logRetentionMinutes and logFilesRemovalLimit settings. The default tracingLevel does not log much. Changing verbosity could lead to extensive logging and disk space requirements for the logs. Error includes Critical, Warning includes Error, Information includes Warning and Verbose includes Information
de: [Optional] Protokolliergrad für Backend-Dienste. Azure Data Studio generiert bei jedem Start einen Dateinamen, und falls die Datei bereits vorhanden ist, werden die Protokolleinträge an diese Datei angefügt. Zur Bereinigung alter Protokolldateien können die „logRetentionMinutes“- und „logFilesRemovalLimit“-Einstellungen verwendet werden. Bei Verwendung des Standardwerts für „tracingLevel“ werden nur wenige Informationen protokolliert. Eine Änderung der Ausführlichkeit kann zu einem umfangreichen Protokollierungsaufkommen und einem hohen Speicherplatzbedarf für die Protokolle führen. „Error: includes Critical“, „Warning: includes Error“, „Information: includes Warning“ und „Verbose: includes Information“

# mssql.showBatchTime
source: [Optional] Should execution time be shown for individual batches
de: [Optional] Gibt an, ob die Ausführungszeit für einzelne Batches angezeigt werden soll.

# mssql.connection.profileName
source: [Optional] Specify a custom name for this connection profile to easily browse and search in the command palette of Visual Studio Code.
de: [Optional] Gibt einen benutzerdefinierten Namen für dieses Verbindungsprofil an, um die Suche innerhalb der Befehlspalette von Visual Studio Code zu vereinfachen.

# mssql.connection.authenticationType
source: [Optional] Specify the SQL Server authentication type.
de: [Optional] Gibt den SQL Server-Authentifizierungstyp an.

# mssql.connection.database
source: [Optional] Specify the database name to connect to. If database is not specified, the default user database setting is used, typically 'master'.
de: [Optional] Gibt den Namen der Datenbank an, mit der Sie eine Verbindung herstellen möchten. Wenn Sie keine Datenbank angeben, wird die Standardbenutzerdatenbank verwendet. In der Regel ist dies "master".

# mssql.connection.connectRetryInterval
source: [Optional] Specify the delay between attempts to restore connection.
de: [Optional] Gibt die Verzögerung zwischen den Versuchen zur Verbindungswiederherstellung an.

# mssql.connection.commandTimeout
source: [Optional] Specify the length of time in seconds to wait for a command to execute before terminating the attempt and generating an error. The default value is 30 seconds.
de: [Optional] Geben Sie die Zeitspanne in Sekunden an, die auf die Ausführung eines Befehls gewartet werden soll, bevor der Versuch beendet und ein Fehler generiert wird. Der Standardwert ist 30 Sekunden.

# mssql.connection.connectTimeout
source: [Optional] Specify the length of time in seconds to wait for a connection to the server before terminating connection attempt and generating an error. The default value is 15 seconds for on-premise and 30 seconds for Azure SQL Database connections.
de: [Optional] Geben Sie die Zeitspanne in Sekunden an, die auf eine Verbindung mit dem Server gewartet werden soll, bevor der Verbindungsversuch beendet und ein Fehler generiert wird. Der Standardwert beträgt 15 Sekunden für lokale Verbindungen und 30 Sekunden für Azure SQL-Datenbankverbindungen.

# mssql.connection.maxPoolSize
source: [Optional] Specify the maximum number of connections allowed in the pool.
de: [Optional] Gibt die maximal zulässige Anzahl von Verbindungen im Pool an.

# mssql.connection.loadBalanceTimeout
source: [Optional] Specify the minimum amount of time in seconds for this connection to live in the pool before being removed/deleted.
de: [Optional] Gibt die Mindestzeitspanne in Sekunden an, für die diese Verbindung im Pool verbleiben soll, bevor sie entfernt/gelöscht wird.

# mssql.connection.minPoolSize
source: [Optional] Specify the minimum number of connections allowed in the pool.
de: [Optional] Gibt die mindestens erforderliche Anzahl von Verbindungen im Pool an.

# mssql.connection.applicationName
source: [Optional] Specify the name of the application used for SQL Server to log (default: 'vscode-mssql').
de: [Optional] Gibt den Namen der Anwendung an, die SQL Server für die Protokollierung verwendet. (Standardwert: "vscode-mssql").

# mssql.connection.attachDbFilename
source: [Optional] Specify the name of the primary file, including the full path name, of an attachable database.
de: [Optional] Gibt den Namen der primären Datei (einschließlich des vollständigen Pfadnamens) einer Datenbank an, die angefügt werden soll.

# mssql.connection.workstationId
source: [Optional] Specify the name of the workstation connecting to SQL Server.
de: [Optional] Gibt den Namen der Arbeitsstation an, die eine Verbindung mit SQL Server herstellt.

# mssql.connection.failoverPartner
source: [Optional] Specify the name or network address of the instance of SQL Server that acts as a failover partner.
de: [Optional] Gibt den Namen oder die Netzwerkadresse der SQL Server-Instanz an, die als Failoverpartner fungiert.

# mssql.connection.connectRetryCount
source: [Optional] Specify the number of attempts to restore connection.
de: [Optional] Gibt die Anzahl von Versuchen für die Verbindungswiederherstellung an.

# mssql.connection.password
source: [Optional] Specify the password for SQL Server authentication. If password is not specified or already saved, when you connect, you will be asked again.
de: [Optional] Gibt das Kennwort für die SQL Server-Authentifizierung an. Wenn Sie kein Kennwort angeben oder bereits eine Speicherung durchgeführt haben, werden Sie bei der Verbindungsherstellung erneut danach gefragt.

# mssql.connection.port
source: [Optional] Specify the port number to connect to.
de: [Optional] Gibt den Port an, mit dem Sie eine Verbindung herstellen möchten.

# mssql.connection.packetSize
source: [Optional] Specify the size in bytes of the network packets to communicate with SQL Server.
de: [Optional] Gibt die Größe der Netzwerkpakete in Byte an, die bei der Kommunikation mit dem SQL Server verwendet werden soll.

# mssql.connection.user
source: [Optional] Specify the user name for SQL Server authentication. If user name is not specified, when you connect, you will be asked again.
de: [Optional] Gibt den Benutzernamen für die SQL Server-Authentifizierung an. Wenn Sie keinen Namen angeben, werden Sie bei der Verbindungsherstellung erneut danach gefragt.

# mssql.connection.connectionString
source: [Optional] The ADO.NET connection string to use for the connection. Overrides any other options given in this connection.
de: [Optional] Die ADO.NET-Verbindungszeichenfolge, die für die Verbindung verwendet werden soll. Setzt alle weiteren Optionen für diese Verbindung außer Kraft.

# mssql.connection.replication
source: [Optional] Used by SQL Server in replication.
de: [Optional] Wird von SQL Server bei der Replikation verwendet.

# mssql.connection.encrypt
source: [Optional] When 'Mandatory' or 'Strict', SQL Server uses SSL encryption for all data sent between the client and server if the server has a certificate installed. When set to 'Strict', SQL Server uses TDS 8.0 for all data transfer between the client and server. 'Strict' is supported on SQL Server 2022 onwards.
de: [Optional] Bei "Obligatorisch" oder "Strict" verwendet SQL Server SSL-Verschlüsselung für alle Daten, die zwischen Client und Server gesendet werden, wenn auf dem Server ein Zertifikat installiert ist. Bei Festlegung auf "Strict" verwendet SQL Server TDS 8.0 für die gesamte Datenübertragung zwischen Client und Server. "Strict" wird ab SQL Server 2022 unterstützt.

# mssql.connection.multipleActiveResultSets
source: [Optional] When set to 'true', multiple result sets can be returned and read from on connection.
de: [Optional] Bei Festlegung auf TRUE können mehrere Resultsets über eine Verbindung zurückgegeben und gelesen werden.

# mssql.connection.trustServerCertificate
source: [Optional] When set to 'true', the SQL Server SSL certificate is automatically trusted when the communication layer is encrypted using SSL. Set 'false' for Azure SQL Database connection.
de: [Optional] Bei Festlegung auf TRUE wird das SQL Server-SSL-Zertifikat automatisch als vertrauenswürdig eingestuft, sofern die Kommunikation mit SSL verschlüsselt ist. Legen Sie für eine Azure SQL-Datenbank-Verbindung den Wert FALSE fest.

# mssql.connection.pooling
source: [Optional] When set to 'true', the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool.
de: [Optional] Bei Festlegung auf TRUE wird das Verbindungsobjekt aus dem geeigneten Pool abgerufen oder bei Bedarf erstellt und dem geeigneten Pool hinzugefügt.

# mssql.connection.multiSubnetFailover
source: [Optional] When set to 'true', the detection and connection to the active server is faster if AlwaysOn Availability Group is configured on different subnets.
de: [Optional] Bei Festlegung auf TRUE erfolgt die Erkennung und die Verbindung mit dem aktiven Server schneller, wenn eine Always On-Verfügbarkeitsgruppe für verschiedene Subnetze konfiguriert ist.

# mssql.connection.savePassword
source: [Optional] When set to 'true', the password for SQL Server authentication is saved in the secure store of your operating system such as KeyChain in MacOS or Secure Store in Windows.
de: [Optional] Bei Festlegung auf TRUE wird das Kennwort für die SQL Server-Authentifizierung im sicheren Speicher Ihres Betriebssystems gespeichert, wie z. B. der Schlüsselbund unter MacOS oder Secure Store in Windows.

# mssql.connection.persistSecurityInfo
source: [Optional] When set to false, security-sensitive information, such as the password, is not returned as part of the connection if the connection is open or has ever been in an open state.
de: [Optional] Bei Festlegung auf FALSE werden sicherheitsrelevante Informationen wie z. B. das Kennwort nicht als Teil der Verbindung zurückgegeben, wenn die Verbindung geöffnet ist oder sich bereits in einem geöffneten Zustand befunden hat.

# mssql.connection.hostNameInCertificate
source: [Optional] When specified (and encrypt=Mandatory and trustServerCertificate=false), SQL Server uses provided hostname for validating trust with the server certificate.
de: [Optional] Bei Angabe von (and encrypt=Mandatory and trustServerCertificate=false) verwendet SQL Server den angegebenen Hostnamen zum Überprüfen der Vertrauensstellung mit dem Serverzertifikat.

# mssql.saveAsCsv.includeHeaders
source: [Optional] When true, column headers are included when saving results as CSV
de: [Optional] Bei Festlegung auf TRUE werden die Spaltenüberschriften beim Speichern der Ergebnisse als CSV mit ausgegeben.

# mssql.connection.server
source: [Required] Specify the server name to connect to. Use 'hostname instance' or '<server>.database.windows.net' for Azure SQL Database.
de: [Erforderlich] Gibt den Namen des Servers an, mit dem Sie eine Verbindung herstellen möchten. Verwenden Sie „hostname instance“ oder „<server>.database.windows.net“ für die Azure SQL-Datenbank.

# mssql.format.placeCommasBeforeNextStatement
source: should commas be placed at the beginning of each statement in a list e.g. ', mycolumn2' instead of at the end e.g. 'mycolumn1,'
de: Gibt an, dass Kommas in einer Liste am Anfang der einzelnen Anweisungen (z. B. ", mycolumn2") und nicht am Ende platziert werden sollen: "mycolumn1,"
