Repository: microsoft/vscode-mssql
Catalog: localization/xliff/deu.xlf
Languages: de

# ++CODE++a423b47777783386516c79baa19b0dfcd12cb40e4fba79348ad14ab0169402cd
source: Profile Name
de: Profilname

# ++CODE++f7821e5b83af275fa9638d6840dc6edd1e7c8179f566d99cb2fd713ca13e9e3c
source: Profile created and connected
de: Das Profil wurde erstellt und verbunden.

# ++CODE++8a0d6f1276ee19a91fb06f73344d1d60f2d1f1c8d7e0454c8bb31ea00c2b9a30
source: Profile created successfully
de: Das Profil wurde erfolgreich erstellt.

# ++CODE++c7b24e72fefeade2fc1706604bb5c2ee848b055ed154428128c10d5020549a7a
source: Profile removed successfully
de: Das Profil wurde erfolgreich entfernt.

# ++CODE++7c68cc7494a11be986cf0d4ac8e2acb67d5aa67b35151c2435cb1c51ccd060d8
source: Provider '{0}' does not have a Microsoft resource endpoint defined.
de: Für den Anbieter "{0}" ist kein Microsoft-Ressourcenendpunkt definiert.

# ++CODE++9e83dc6d2db272ac27cc875b994f834b62b7202a49b69e885f8f4e8f9c29a452
source: Query executed
de: Abfrage ausgeführt

# ++CODE++83b794145c0cc3f560cb6dfb6b5bcf7afac4dba15e5c6dbc54d103dae029fec6
source: Read more
de: Weitere Informationen

# ++CODE++703f1ae8b7cdb3525cdab9ea694ab27b1b9e4337f0b2ca32f152f7f9a6e2f9d5
source: Recent connections list cleared
de: Die Liste der zuletzt verwendeten Verbindungen wurde gelöscht.

# ++CODE++627fc5f9740b31ca7868476caa3694a842a494bf358329d1aaf28f3fd7a5a4f0
source: Refresh Credentials
de: Anmeldeinformationen aktualisieren

# ++CODE++0cd1ba1d31d508fcf599096e647eb0c1a60819928248e404a3f71ea9f7aafad8
source: Reload Visual Studio Code
de: Visual Studio Code erneut laden

# ++CODE++c3812fc4acb861d5182fc2b8155f327f736fbe5e5eb86a7bd7afcb6dc5497282
source: Remove
de: Entfernen

# ++CODE++a76e13b9839270eb73ed11417f7d8acca55df0ad52065799361631d0fff74f27
source: Restore
de: Wiederherstellen

# ++CODE++219c4a6c86a716e99d5dc9611b61e584deb11b57e972d87d4b773387ebc3cadd
source: Results
de: Ergebnisse

# ++CODE++942087cc2d41e01304b7195558d093d10c72af8e838c7556d6a02d471ee71852
source: Retry
de: Wiederholen

# ++CODE++fa12adeb7bf1db8bea535fb7afc4cdb5121fe19f586fd0996a719007d8c7012c
source: Run Query History
de: Abfrageverlauf ausführen

# ++CODE++4e16c2dab3b093c189f6f41be6961a3e5a42e6c8c2d3609ce6398e1bd9c8f60c
source: Running query is not supported when the editor is in multiple selection mode.
de: Das Ausführen einer Abfrage wird nicht unterstützt, wenn sich der Editor im Mehrfachauswahlmodus befindet.

# ++CODE++bcb563c464628dce28a629cdda03742239a5b0f9e25da0a87aea6e68ad25933a
source: SQL Login
de: SQL-Anmeldung

# ++CODE++77252dc87eec71818cc0b5c0bc0e82792f92540faad923e81c6d5dcd3119e31a
source: Save Password? If 'No', password will be required each time you connect
de: Kennwort speichern? Wenn Sie "Nein" angeben, muss das Kennwort bei jeder Verbindungsherstellung angegeben werden.

# ++CODE++e50761ebedbdddb4dd4afb99a7c0964cf8bfed33ec03cb39f5a08e65812c795a
source: Save as CSV
de: Als CSV speichern

# ++CODE++40838c73e26d7ae3162bb4250c2c1e261a33fec5478432e6e47ba9ab6649c1ef
source: Save as Excel
de: Als Excel-Datei speichern

# ++CODE++910ed5e0c43df2bc1a2c71f1d5ecd2168b919fd4dc9f6d4b1f13f660cba9c524
source: Save as JSON
de: Als JSON speichern

# ++CODE++bae1da28225af71a125385224716f5ff7870573e6c01494c597e8ed4168b12e3
source: Save results command cannot be used with multiple selections.
de: Der Befehl "Ergebnisse speichern" kann nicht mit einer Mehrfachauswahl verwendet werden.

# ++CODE++1fc9a387654d410febd202b81bddbe62d38368260b69b9f73ee6630164536bdf
source: Select all
de: Alles auswählen

# ++CODE++e286357ecd532997834edbf13478a2b3ca334a9dda1c8e895c0bd8b26f6097b5
source: Select profile to remove
de: Wählen Sie das Profil aus, das entfernt werden soll.

# ++CODE++5354479c5248dd63b7110fca45437164866ebbdc35bd5d19a5b814535534024e
source: Selected Microsoft Entra account removed successfully.
de: Das ausgewählte Microsoft Entra-Konto wurde erfolgreich entfernt.

# ++CODE++1c53883708ab16a3743793905feb38c8e77c295d846ff276491831e1de69b6e1
source: Server connection in progress. Do you want to cancel?
de: Die Serververbindung wird hergestellt. Möchten Sie den Vorgang abbrechen?

# ++CODE++e4e1940a01194f83f42724f0cc4b353c0219980452af7e69e597ca63229531d9
source: Server could not start. This could be a permissions error or an incompatibility on your system. You can try enabling device code authentication from settings.
de: Der Server konnte nicht gestartet werden. Möglicherweise handelt es sich um einen Berechtigungsfehler oder eine Inkompatibilität auf Ihrem System. Sie können versuchen, die Gerätecodeauthentifizierung über die Einstellungen zu aktivieren.

# ++CODE++10b48e930a5a1d6459b0bd050ae37f39e969abb8db827d083d31f62f0ed6b014
source: Server name not received.
de: Der Servername wurde nicht empfangen.

# ++CODE++3e27420fb58defcc5b721d6bfdbb9c092230a888d571821f747f7bffec92f17c
source: Server name or ADO.NET connection string
de: Servername oder ADO.NET-Verbindungszeichenfolge

# ++CODE++8c6f0777a59f6d55efb68be5323e48061f19e0b2c036c9f34f3ea7655eeaead2
source: Show MSSQL output
de: MSSQL-Ausgabe anzeigen

# ++CODE++09a0ee357e3b34ac30c4ae61fcfbcfde87c6941a213e8e60d146e7942c0d76bc
source: Sign in to your Azure subscription
de: Melden Sie sich bei Ihrem Azure-Abonnement an.

# ++CODE++53b8195b6ec261723d1abe7f4b25c502724154c01b39ddf9998426be6d346c66
source: Sign in to your Azure subscription in one of the sovereign clouds.
de: Melden Sie sich in einer der Sovereign Clouds bei Ihrem Azure-Abonnement an.

# ++CODE++2a2c6072cca49b7f2056d66f738d53593bce3004d1291d736ea9a69e58babae8
source: Sign in to your Azure subscription with a device code. Use this in setups where the Sign In command does not work
de: Melden Sie sich mit einem Gerätecode bei Ihrem Azure-Abonnement an. Verwenden Sie diese Option für Einrichtungen, bei denen der Anmeldebefehl nicht funktioniert.

# ++CODE++a49eb416daf711062abb036ea09b46cbe49f513082db1ef699e94ddcf35adc42
source: Start IP Address
de: Start-IP-Adresse

# ++CODE++26254424b6f10bfd397e77bc2c93c10fc436795145ee5f2a09b27d54518ec9d6
source: Started executing query at
de: Abfrageausführung gestartet um

# ++CODE++4a5901a3ef8ce653c646a8ff72117555ad46803721be5b957ca9e799be6e7d20
source: Started query execution for document "{0}"
de: Die Abfrageausführung für Dokument "{0}" wurde gestartet.

# ++CODE++47d62b3ce92021fa331252ba82176c2a4ccb592c2264bd58ec74e5d1b722c98e
source: Started saving results to
de: Ergebnisse werden gespeichert in

# ++CODE++6d9a6f97a5fdaf3b90a0cf02e0b43d8b7ec1d05c0e4718e02ddd1c5b450e5b39
source: Succeeded
de: Erfolgreich

# ++CODE++5443b1422a140475d5703c916c7686007233ea92292881588670e73409a7f1cd
source: Succeeded with warning
de: Erfolgreich mit Warnung

# ++CODE++f0266af4455c8f348df74a77502b563a575637604e905429b302d78ec39c00e4
source: Successfully refreshed token for connection {0} with uri {1}, {2}
de: Token für Verbindung {0} mit URI {1}, {2} wurde erfolgreich aktualisiert

# ++CODE++9c85106af25fd7656e977d5453607973955ae5d79fce0a78264cd714a628e981
source: Successfully saved results to
de: Ergebnisse erfolgreich gespeichert in:

# ++CODE++5b483648ad7b3afcd20f3ccef6fdc7471e39d5a8c9bb30697cba5f82c4ff8dc1
source: Switch to MSAL
de: Zu MSAL wechseln

# ++CODE++e23969d284c3424c8014c6e5b1b85ebc275bc5c74321e7677a21d023e6ea154c
source: Tenant
de: Mandant

# ++CODE++90c8505baad739c0925471e0d594ba9d83f84d3a96dbdfa16a47ae7a3ad95d91
source: Testing connection profile...
de: Verbindungsprofil wird getestet...

# ++CODE++13549c97f0b3baa43655bd41e05e3bb60918ded05df9e7e94186ecc6ba53c3d1
source: The recent connections list has been cleared but there were errors while deleting some associated credentials. View the errors in the MSSQL output channel.
de: Die Liste der zuletzt verwendeten Verbindungen wurde gelöscht, aber beim Löschen einiger zugeordneter Anmeldeinformationen sind Fehler aufgetreten. Zeigen Sie die Fehler im MSSQL-Ausgabekanal an.

# ++CODE++2b8198974f44b4a37d366cb6535153e3646f2c9de308f0ca05bf90513b0a4630
source: This setting requires Visual Studio Code to be relaunched, please reload Visual Studio Code.
de: Für diese Einstellung muss Visual Studio Code neu gestartet werden. Laden Sie Visual Studio Code neu.

# ++CODE++115a2cc92c1097ac4ebeb49698f5e22635a24ee1ef89722616f862ea43c5baba
source: Timestamp
de: Zeitstempel

# ++CODE++4c4d50191531a82f528c2802cf6b245d0c776a5d4b51d3b5da127aaf21728547
source: To use this command, Open a .sql file -or- Change editor language to "SQL" -or- Select T-SQL text in the active SQL editor.
de: Öffnen Sie zum Verwenden dieses Befehls eine SQL-Datei – oder – Ändern Sie die Editorsprache in "SQL" – oder – Wählen Sie im aktiven SQL-Editor "T-SQL-Text" aus.

# ++CODE++e53c65fb2c5014c76bacb8ae7e110d59e8f5a57507db2682d0bd4fdbd156c8f4
source: To use this command, you must set the language to "SQL". Confirm to change language mode.
de: Um diesen Befehl zu verwenden, müssen Sie die Sprache auf "SQL" festlegen. Bestätigen Sie die Änderung des Sprachmodus.

# ++CODE++048652e110f74b298095b5a7123e8878dfbd665a9fa34991b269dd31ab9442d0
source: Total execution time: {0}
de: Ausführungszeit gesamt: {0}

# ++CODE++e395097d9cde221cdb9af8b04e1073d0d3394439fce660d1c954d012cdeae6c1
source: Unable to execute the command while the extension is initializing. Please try again later.
de: Der Befehl kann während der Initialisierung der Erweiterung nicht ausgeführt werden. Versuchen Sie es später noch mal.

# ++CODE++30f9be31de0326b58d28b9578bd91145abf4047074018ac47bc845f960328167
source: Unable to expand. Please check logs for more information.
de: Erweiterung nicht möglich. Weitere Informationen finden Sie in den Protokollen.

# ++CODE++92294188e79b2a13584eb3e6120f971c94ada2a387f3199a4cd3cb17039f9d37
source: Updating IntelliSense...
de: IntelliSense wird aktualisiert...

# ++CODE++eeefe579e45c25e1a551b536d8eecc680562bce4d0aa58ffee1ad7df8cc84e63
source: Use T-SQL intellisense and syntax error checking on current document
de: T-SQL-IntelliSense und Syntaxfehlerprüfung im aktuellen Dokument verwenden

# ++CODE++b82e11da3bc16786000d6e008e038f4d0272163a6476e0ca3c4b29d958051f9c
source: User name
de: Benutzername

# ++CODE++d67e96ac435b6d4a9b9aedc12377ba5da6778e010fa1bd7e2942ed221ab16a4f
source: User name (SQL Login)
de: Benutzername (SQL-Anmeldung)

# ++CODE++ff01d2362e483ddaca44f0e7f02d280bef382c1a3209776e5a11ca21acf2cea4
source: View mssql for Visual Studio Code release notes?
de: MSSQL für Visual Studio Code-Versionshinweise anzeigen?

# ++CODE++4aa3356437232c6d45b29802f09eee6e201660a67cf78e145f39ad1fada6feab
source: Width cannot be 0 or negative
de: Die Breite darf nicht 0 oder negativ sein.

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
de: Ja

# ++CODE++4d665ff14f7810a8d97b139336a650d9bf37854683886f2df4679232ec55bae4
source: Your account needs re-authentication to access {0} resources. Press Open to start the authentication process.
de: Ihr Konto muss erneut authentifiziert werden, um auf {0} Ressourcen zugreifen zu können. Drücken Sie "Öffnen", um den Authentifizierungsprozess zu starten.

# ++CODE++cae61ae576cc3d82cec2579b9ac71b72196f7ff3f543408342b416c4877cce4e
source: Your client IP Address '{0}' does not have access to the server '{1}' you're attempting to connect to. Would you like to create new firewall rule?
de: Ihre Client-IP-Adresse "{0}" hat keinen Zugriff auf den Server "{1}", mit dem Sie eine Verbindung herstellen möchten. Möchten Sie eine neue Firewallregel erstellen?

# ++CODE++a687a5a3cf1800c09d10d73ae6c128de7b617482ef262db645470c6f4ae9d54d
source: Your client IP address does not have access to the server. Add a Microsoft Entra account and create a new firewall rule to enable access.
de: Ihre Client-IP-Adresse hat keinen Zugriff auf den Server. Fügen Sie ein Microsoft Entra-Konto hinzu, und erstellen Sie eine neue Firewallregel, um den Zugriff zu ermöglichen.

# ++CODE++5dc504d43e14657bd7f0298bc51688ba1bb0b809a8060f3b9106ca9411db9cd4
source: Your tenant '{0} ({1})' requires you to re-authenticate again to access {2} resources. Press Open to start the authentication process.
de: Für Ihren Mandanten "{0} ({1})" müssen Sie sich erneut authentifizieren, um auf {2}-Ressourcen zuzugreifen. Klicken Sie auf "Öffnen", um den Authentifizierungsvorgang zu starten.

# ++CODE++aab103babf210fd60bfbe41ecd5ab24d36cb423ec956f0d0215c6161359e01ee
source: [Optional] Database to connect (press Enter to connect to <default> database)
de: [Optional] Datenbank für die Verbindungsherstellung (drücken Sie die EINGABETASTE, um eine Verbindung mit der <default>-Datenbank herzustellen).

# ++CODE++48a9c1333b8297748a7cf4f38e479f6d1722302a0ce72f8516d8a749fe49d752
source: [Optional] Enter a display name for this connection profile
de: [Optional] Gibt einen Anzeigenamen für dieses Verbindungsprofil an.

# ++CODE++c1399614154a55dfb1fcb95e208ed1f0b1115b846d6150ded7c7b43fdf6cbc09
source: authenticationType
de: Authentifizierungstyp

# ++CODE++c6072170d758e5358d717360829bd1f9b1603b355b5f7fe375d1aabdca7a20de
source: encrypt
de: Verschlüsseln

# ++CODE++eb69f53f51eaef9887d5c3f3cbd0993b208e962fed51bdd572b0816eb75c1d10
source: macOS Sierra or newer is required to use this feature.
de: Um dieses Feature zu nutzen, wird macOS Sierra oder neuer benötigt.

# ++CODE++630c74b2de45669259227b267211f2cbc1b0d85d38728a506258a9e8bdf42acc
source: untitled
de: Unbenannt

# mssql.addObjectExplorer
source: Add Connection
de: Verbindung hinzufügen

# mssql.addAadAccount
source: Add Microsoft Entra Account
de: Microsoft Entra-Konto hinzufügen

# mssql.deviceCode.description
source: Allows users to sign in to input-constrained devices.
de: Ermöglicht Benutzern die Anmeldung bei Geräten mit Eingabeeinschränkung.

# mssql.query.executionTimeout
source: An execution time-out of 0 indicates an unlimited wait (no time-out)
de: Ein Timeoutwert von 0 für die Ausführung kennzeichnet einen unbegrenzten Wartevorgang (kein Timeout).

# mssql.cancelQuery
source: Cancel Query
de: Abfrage abbrechen

# mssql.chooseLanguageFlavor
source: Choose SQL handler for this file
de: SQL-Handler für diese Datei auswählen

# mssql.chooseAuthMethod
source: Chooses which Authentication method to use
de: Wählt die zu verwendende Authentifizierungsmethode aus.

# mssql.clearAllQueryHistory
source: Clear All Query History
de: Gesamten Abfrageverlauf löschen

# mssql.clearAzureAccountTokenCache
source: Clear Microsoft Entra account token cache
de: Microsoft Entra-Kontotokencach löschen

# mssql.clearPooledConnections
source: Clear Pooled Connections
de: Gepoolte Verbindungen löschen

# mssql.connect
source: Connect
de: Verbinden

# mssql.connections
source: Connection profiles defined in 'User Settings' are shown under 'MS SQL: Connect' command in the command palette.
de: Verbindungsprofile, die in "Benutzereinstellungen" definiert wurden, werden unter dem Befehl "MS SQL: Verbinden" in der Befehlspalette angezeigt.

# extension.connections
source: Connections
de: Verbindungen

# mssql.copyObjectName
source: Copy Object Name
de: Objektname kopieren

# mssql.createAzureFunction
source: Create Azure Function with SQL binding
de: Erstellen einer Azure-Funktion mit SQL-Bindung

# mssql.deleteQueryHistory
source: Delete
de: Löschen

# mssql.objectExplorer.disableGroupBySchema
source: Disable Group By Schema
de: Gruppen nach Schema deaktivieren

# mssql.disconnect
source: Disconnect
de: Trennen

# mssql.objectExplorer.enableGroupBySchema
source: Enable Group By Schema
de: Gruppen nach Schema aktivieren

# mssql.query.alwaysEncryptedParameterization
source: Enable Parameterization for Always Encrypted
de: Parametrisierung für Always Encrypted aktivieren

# mssql.enableQueryHistoryCapture
source: Enable Query History Capture
de: Erfassung des Abfrageverlaufs aktivieren

# mssql.query.ansiDefaults
source: Enable SET ANSI_DEFAULTS
de: „SET ANSI_DEFAULTS“ aktivieren

# mssql.query.ansiNulls
source: Enable SET ANSI_NULLS
de: „SET ANSI_NULLS“ aktivieren

# mssql.query.ansiNullDefaultOn
source: Enable SET ANSI_NULL_DFLT_ON
de: „SET ANSI_NULL_DFLT_ON“ aktivieren

# mssql.query.ansiPadding
source: Enable SET ANSI_PADDING
de: „SET ANSI_PADDING“ aktivieren

# mssql.query.ansiWarnings
source: Enable SET ANSI_WARNINGS
de: „SET ANSI_WARNINGS“ aktivieren

# mssql.query.arithAbort
source: Enable SET ARITHABORT option
de: Set ARITHABORT-Option aktivieren

# mssql.query.cursorCloseOnCommit
source: Enable SET CURSOR_CLOSE_ON_COMMIT
de: „SET CURSOR_CLOSE_ON_COMMIT“ aktivieren

# mssql.query.deadlockPriority
source: Enable SET DEADLOCK_PRIORITY option
de: SET DEADLOCK_PRIORITY-Option aktivieren

# mssql.query.implicitTransactions
source: Enable SET IMPLICIT_TRANSACTIONS
de: „SET IMPLICIT_TRANSACTIONS“ aktivieren

# mssql.query.lockTimeout
source: Enable SET LOCK TIMEOUT option (in milliseconds)
de: SET LOCK TIMEOUT-Option aktivieren (in Millisekunden)

# mssql.query.noCount
source: Enable SET NOCOUNT option
de: SET NOCOUNT-Option aktivieren

# mssql.query.noExec
source: Enable SET NOEXEC option
de: SET NOEXEC-Option aktivieren

# mssql.query.parseOnly
source: Enable SET PARSEONLY option
de: SET PARSEONLY-Option aktivieren

# mssql.query.queryGovernorCostLimit
source: Enable SET QUERY_GOVERNOR_COST_LIMIT
de: „SET QUERY_GOVERNOR_COST_LIMIT“ aktivieren

# mssql.query.quotedIdentifier
source: Enable SET QUOTED_IDENTIFIER
de: „SET QUOTED_IDENTIFIER“ aktivieren

# mssql.query.statisticsIO
source: Enable SET STATISTICS IO option
de: Set STATISTICS IO-Option aktivieren

# mssql.query.statisticsTime
source: Enable SET STATISTICS TIME option
de: SET STATISTICS TIME-Option aktivieren

# mssql.query.transactionIsolationLevel
source: Enable SET TRANSACTION ISOLATION LEVEL option
de: SET TRANSACTION ISOLATION LEVEL-Option aktivieren

# mssql.query.xactAbortOn
source: Enable SET XACT_ABORT ON option
de: SET XACT_ABORT ON-Option aktivieren

# mssql.enableConnectionPooling
source: Enables connection pooling to improve overall connectivity performance. This setting is enabled by default. Visual Studio Code is required to be relaunched when the value is changed. To clear pooled connections, run the command: 'MS SQL: Clear Pooled Connections'
de: Ermöglicht Verbindungspooling, um die Gesamtkonnektivitätsleistung zu verbessern. Diese Einstellung ist standardmäßig aktiviert. Visual Studio Code muss neu gestartet werden, wenn der Wert geändert wird. Führen Sie den folgenden Befehl aus, um gepoolte Verbindungen zu löschen: 'MS SQL: Gepoolte Verbindungen löschen'

# mssql.enableSqlAuthenticationProvider
source: Enables use of the Sql Authentication Provider for 'Microsoft Entra Id Interactive' authentication mode when user selects 'AzureMFA' authentication. This enables Server-side resource endpoint integration when fetching access tokens. This option is only supported for 'MSAL' Authentication Library. Please restart Visual Studio Code after changing this option.
de: Aktiviert die Verwendung des SQL-Authentifizierungsanbieters für den Authentifizierungsmodus "Microsoft Entra ID interaktiv", wenn der Benutzer die Authentifizierung "AzureMFA" auswählt. Dies ermöglicht die serverseitige Ressourcenendpunktintegration beim Abrufen von Zugriffstoken. Diese Option wird nur für die MSAL-Authentifizierungsbibliothek unterstützt. Bitte starten Sie Visual Studio Code neu, nachdem Sie diese Option geändert haben.

# mssql.runCurrentStatement
source: Execute Current Statement
de: Aktuelle Anweisung ausführen

# mssql.runQuery
source: Execute Query
de: Abfrage ausführen

# mssql.showGettingStarted
source: Getting Started Guide
de: Leitfaden für erste Schritte

source: MSSQL configuration
de: MSSQL-Konfiguration

# mssql.manageProfiles
source: Manage Connection Profiles
de: Verbindungsprofile verwalten

# mssql.query.maxXmlCharsToStore
source: Maximum number of characters to store for each value in XML columns after running a query. Default value: 2,097,152. Valid value range: 1 to 2,147,483,647.
de: Die maximale Anzahl von Zeichen, die nach dem Ausführen einer Abfrage für jeden Wert in XML-Spalten gespeichert werden sollen. Standardwert: 2.097.152. Gültiger Wertebereich: 1 bis 2.147.483.647.

# mssql.query.maxCharsToStore
source: Maximum number of characters/bytes to store for each value in character/binary columns after running a query. Default value: 65,535. Valid value range: 1 to 2,147,483,647.
de: Die maximale Anzahl von Zeichen/Bytes, die nach dem Ausführen einer Abfrage für jeden Wert in Zeichenspalten/binären Spalten gespeichert werden sollen. Standardwert: 65.535. Gültiger Wertebereich: 1 bis 2.147.483.647.

# mssql.logFilesRemovalLimit
source: Maximum number of old files to remove upon startup that have expired mssql.logRetentionMinutes. Files that do not get cleaned up due to this limitation get cleaned up next time Azure Data Studio starts up.
de: Die maximale Anzahl alter Dateien, die beim Start entfernt werden sollen, bei denen der mssql.logRetentionMinutes-Wert abgelaufen ist. Dateien, die aufgrund dieser Einschränkung nicht bereinigt werden, werden beim nächsten Start von Azure Data Studio bereinigt.

# mssql.query.setRowCount
source: Maximum number of rows to return before the server stops processing your query.
de: Maximale Anzahl von Zeilen, die zurückgegeben werden sollen, bevor der Server die Verarbeitung Ihrer Abfrage beendet.

# mssql.query.textSize
source: Maximum size of text and ntext data returned from a SELECT statement
de: Maximale Größe von text- und ntext-Daten, die von einer SELECT-Anweisung zurückgegeben werden

# mssql.objectExplorerNewQuery
source: New Query
de: Neue Abfrage

# mssql.newQuery
source: New Query
de: Neue Abfrage

# mssql.logRetentionMinutes
source: Number of minutes to retain log files for backend services. Default is 1 week.
de: Anzahl von Minuten, für die Protokolldateien für Back-End-Dienste aufbewahrt werden sollen. Der Standardwert ist 1 Woche.

# mssql.queryHistoryLimit
source: Number of query history entries to show in the Query History view
de: Anzahl der Einträge des Abfrageverlaufs, die in der Ansicht „Abfrageverlauf“ angezeigt werden sollen

# mssql.openQueryHistory
source: Open Query
de: Abfrage öffnen

# mssql.commandPaletteQueryHistory
source: Open Query History in Command Palette
de: Abfrageverlauf in Befehlspalette öffnen

# mssql.pauseQueryHistoryCapture
source: Pause Query History Capture
de: Erfassung des Abfrageverlaufs anhalten

# mssql.authCodeGrant.description
source: Prompts users to sign in using their browser.
de: Fordert Benutzer auf, sich mit ihrem Browser anzumelden.

# extension.queryHistory
source: Query History
de: Abfrageverlauf

# mssql.refreshObjectExplorerNode
source: Refresh
de: Aktualisieren

# mssql.rebuildIntelliSenseCache
source: Refresh IntelliSense Cache
de: IntelliSense-Cache aktualisieren

# mssql.removeObjectExplorerNode
source: Remove
de: Entfernen

# mssql.removeAadAccount
source: Remove Microsoft Entra Account
de: Microsoft Entra-Konto entfernen

# mssql.runQueryHistory
source: Run Query
de: Abfrage ausführen

# mssql.scriptAlter
source: Script as Alter
de: ALTER-Skript

# mssql.scriptCreate
source: Script as Create
de: CREATE-Skript

# mssql.scriptDelete
source: Script as Drop
de: DROP-Skript

# mssql.scriptExecute
source: Script as Execute
de: EXECUTE-Skript

# mssql.scriptSelect
source: Select Top 1000
de: Oberste 1000 auswählen

# mssql.resultsFontFamily
source: Set the font family for the results grid; set to blank to use the editor font
de: Legen Sie die Schriftfamilie für das Ergebnisraster fest. Lassen Sie die Einstellung leer, um die Editor-Schriftart zu verwenden.

# mssql.resultsFontSize
source: Set the font size for the results grid; set to blank to use the editor size
de: Legen Sie die Schriftgröße für das Ergebnisraster fest. Lassen Sie die Einstellung leer, um die Editor-Größe zu verwenden.

# mssql.shortcuts
source: Shortcuts related to the results window
de: Tastenkombinationen für das Ergebnisfenster
