Repository: microsoft/vscode-mssql
Catalog: localization/xliff/deu.xlf
Languages: de

# ++CODE++fd10453f63e5c663d4e640ea9cbe1adcc832b6fed0454e62686773ac486ce64d
source: is required.
de: ist erforderlich.

# ++CODE++08fef8ce26bbc554c749504c8d169642c3039345674331079add345b808e96a7
source: A SQL editor must have focus before executing this command
de: Ein SQL-Editor muss den Fokus haben, damit dieser Befehl ausgeführt werden kann.

# ++CODE++0ead4aa08784fedbf2a89d6c0958d7704ede494d920130913de6de5e42fdca50
source: A query is already running for this editor session. Please cancel this query or wait for its completion.
de: Für diese Editorsitzung wird bereits eine Abfrage ausgeführt. Brechen Sie diese Abfrage ab, oder warten Sie auf den Abschluss der aktuellen Abfrageausführung.

# ++CODE++ea9df7a87af305f04a7ca43d0ce60433e16504061c265ab11d0029cdf8cae372
source: Access token expired for connection {0} with uri {1}
de: Zugriffstoken für die Verbindung {0} mit URI {1} ist abgelaufen

# ++CODE++08a2ef94ef94039eed728a4a3ab703508a7bfe442d702183ecbd763d5852a232
source: Account not found
de: Konto nicht gefunden.

# ++CODE++d72d67f0f765e5584e6db8bd1e591a84914d23ff29e9f5b20d8b39125091fca0
source: Add Connection
de: Verbindung hinzufügen

# ++CODE++09857ad18f3cf066330f9fc08318e41f71ecb7b7d71f12bd1dd3b9d050db4ca0
source: Add a Microsoft Entra account...
de: Microsoft Entra-Konto hinzufügen...

# ++CODE++d4fd4b3da177dfc06dbcde0a7f62d637dbf3d90298fdc9b6aeba4f9230441e1f
source: An error occurred refreshing nodes. See the MSSQL output channel for more details.
de: Fehler beim Aktualisieren der Knoten. Weitere Informationen finden Sie im MSSQL-Ausgabekanal.

# ++CODE++8cf147a84fa5b378df2fb1c8d2001b12404768f0de0871a152ed488136a3b350
source: An error occurred while removing Microsoft Entra account: {0}
de: Fehler beim Entfernen des Microsoft Entra-Kontos: {0}

# ++CODE++3d283f80f43f1833dcab882ad9efc24a86c0b17b0febb10fc37336590a7016e1
source: Are you sure you want to disconnect?
de: Möchten Sie die Verbindung trennen?

# ++CODE++eccf8ea40318babf1bd28fa823e0fa905383eed481da5fccb9f54ea4a6152943
source: Authentication Library has changed, please reload Visual Studio Code.
de: Die Authentifizierungsbibliothek wurde geändert. Bitte laden Sie Visual Studio Code erneut.

# ++CODE++53c90adec54ba3992244fa9a6edbef327f573af7d2c99f2a110ba57949283b38
source: Authentication Type
de: Authentifizierungstyp

# ++CODE++439a99b0935fb17d372edb14b699ddd05330257d8c40b464365c1129bdf94d6a
source: Authentication failed due to a nonce mismatch, please close Azure Data Studio and try again.
de: Fehler bei der Authentifizierung aufgrund eines Nonce-Konflikts. Schließen Sie Azure Data Studio, und versuchen Sie es noch mal.

# ++CODE++13bab964ffdfa4aca05306fd4c1f3e7aed36fb36a62c85dc6ef588e841299878
source: Authentication failed due to a state mismatch, please close ADS and try again.
de: Fehler bei der Authentifizierung aufgrund eines Statuskonflikts. Schließen Sie ADS, und versuchen Sie es noch mal.

# ++CODE++34ec466979918ed648dd5ae40b41e849fa6398b0d0a5f076ac3b0061d149d168
source: Azure Code Grant
de: Azure-Code

# ++CODE++c5023bdd36d362e05c245ab15ab6839ad7562bcd42f1e1b0c759dca9d5fec4f7
source: Azure Device Code
de: Azure-Gerätecode

# ++CODE++dd0c9a87e191fd735e4b79b2006a4804b2190b078a05aff1ea23945f37b309c2
source: Azure Logs
de: Azure-Protokolle

# ++CODE++3d1ae152f7c95ef16327aafe54bc82e4565547c236299ef06d54a8db5980c24f
source: Azure token cache cleared successfully.
de: Der Azure-Tokencache wurde erfolgreich gelöscht.

# ++CODE++f71dfcecebed757febe54c711e436e17521c71da90d4c5cc61ef6717918173a4
source: Azure: Sign In
de: Azure: Anmelden

# ++CODE++e23a962d1e7c0f13d0ebf6da9eb0d8bf43afcb391bcbb9227c3939d932219dad
source: Azure: Sign In to Azure Cloud
de: Azure: Bei Azure-Cloud anmelden

# ++CODE++29852e83a6613ccf439cb69654f96550fd0ce1de27609b5167992cef02a9ea55
source: Azure: Sign In with Device Code
de: Azure: Mit Gerätecode anmelden

# ++CODE++785f39d515b5f700c4f9cfec99b46d49fdc412522e0e24a9316fc25e7bfd06a3
source: Batch execution time: {0}
de: Batchausführungszeit: {0}

# ++CODE++19766ed6ccb2f4a32778eed80d1928d2c87a18d7c275ccb163ec6709d3eb2e27
source: Cancel
de: Abbrechen

# ++CODE++13ca2ee2499310d97a5515fb5fd80b75da66f4cf2775273658eb2b3fdcd3bd3d
source: Canceled
de: Abgebrochen

# ++CODE++f0f958e0da473b18b76ef9febe543579a601b532c9acd58ddab45f2d6549a3b3
source: Canceling
de: Vorgang wird abgebrochen

# ++CODE++e98afd3714a8d3c15f84793e425b681975e26f06503850e4122965ee9825e907
source: Canceling query
de: Die Abfrage wird abgebrochen.

# ++CODE++a3b871209f5c0ce02e28669f9d6aeb1bd614ecdbd7e18a413fcc9a40e666fa59
source: Canceling the query failed: {0}
de: Fehler beim Abbrechen der Abfrage: {0}

# ++CODE++6a091418a02336bbb67e1aefe9453dc51828139a059a7f3cae6044273c277a54
source: Cannot cancel query as no query is running.
de: Die Abfrage kann nicht abgebrochen werden, weil keine Abfrage ausgeführt wird.

# ++CODE++78caadaa3d12c39131d70d9b85b2aa5b4fdc874138c7fa884349a843312e02c7
source: Cannot connect due to expired tokens. Please re-authenticate and try again.
de: Aufgrund abgelaufener Token kann keine Verbindung hergestellt werden. Authentifizieren Sie sich erneut, und versuchen Sie es noch mal.

# ++CODE++6ba2dfc2755e1d829986d3bf36cdea9fc88fa8c16d079b7d0f6a6309e8e67a6a
source: Changed database context to "{0}" for document "{1}"
de: Der Datenbankkontext für das Dokument "{1}" wurde in "{0}" geändert.

# ++CODE++88dcff06d01faeaf2253a502d07b9358b907ef3497a0f69c2f6546ffdc06b7b7
source: Changed database context to "{0}" on server "{1}" on document "{2}".
de: Der Datenbankkontext auf Server "{1}" für Dokument "{2}" wurde geändert in "{0}".

# ++CODE++37b6d72a119e5ec53d1dc71ba94cbed9566519488230f6a4e40ae82bfc8bc79f
source: Changing database context to "{0}" on server "{1}" on document "{2}".
de: Der Datenbankkontext auf Server "{1}" für Dokument "{2}" wird geändert in "{0}".

# ++CODE++de88f00e461bb1cd413f9c556b06e1b903006bb3c0123f2e75fdff92532034af
source: Choose An Action
de: Aktion auswählen

# ++CODE++61f2371ac2547488417f83422706e0e6c12b3c12f5f3595e90da91cbb167c174
source: Choose Query History
de: Abfrageverlauf auswählen

# ++CODE++a1578b6089ec41921bc4a70b05ca1b1171199d5d5fea6ac6c345cba9b29a83ef
source: Choose SQL Language
de: SQL-Sprache auswählen

# ++CODE++dcee789e6048807617a646e20bfba75832b8e459fdd8a9e41c08665ee4d8d36a
source: Choose a Microsoft Entra account
de: Microsoft Entra-Konto auswählen

# ++CODE++a89bad7e873f85fc6867185da8c42b2743f3264bf2df68800c16c23a20e1a9cf
source: Choose a Microsoft Entra tenant
de: Microsoft Entra-Mandant auswählen

# ++CODE++b05ab4483a5949bf2effb49592a7bb9dceafedb9a3c6aae12a32341025fc1511
source: Choose a connection profile from the list below
de: Wählen Sie in der Liste unten ein Verbindungsprofil aus.

# ++CODE++3b961516b68d49db85d3ded5bc5c1129e02be1a647845d77b1eb2ab5260284cb
source: Choose a database from the list below
de: Wählen Sie in der Liste unten eine Datenbank aus.

# ++CODE++08e2c4e53c4b3b6008b7bc4d82eb29ab933d3b6c08b34eda0637fbf148fb1529
source: Clear Recent Connections List
de: Liste der zuletzt verwendeten Verbindungen löschen

# ++CODE++6bca6724e27bd109d1b946c1684e16c2c4a5d71731a9ffe5f666bdd9d9846b1e
source: Click to connect to a database
de: Klicken Sie hier, um eine Verbindung mit einer Datenbank herzustellen.

# ++CODE++548e8cc0e8c2423c61f30c6e8b75a1a40c995e3be119df6272b280ab6c15a011
source: Close the current connection
de: Aktuelle Verbindung schließen

# ++CODE++eb83f1820ce359dc5c9aa6ca4d08fad60256a9808c58ad93f89db3c182908364
source: Confirm to clear recent connections list
de: Bestätigen Sie das Löschen der Liste mit den zuletzt verwendeten Verbindungen.

# ++CODE++99fb39ba4e498877a20049303aa3318b2004884dab008c65a3b5dd48f47cdd04
source: Confirm to remove this profile.
de: Bestätigen Sie die Löschung des Profis.

# ++CODE++1a2303ede07493acc7caaa7c737f3c52bcc9cf04372be19ed1b0af6b9f2c791e
source: Connect
de: Verbinden

# ++CODE++b6c3dc8ba33b3a93b9060f81da8fa7d496f07487cec7a12353257242b2ea9e24
source: Connected to server "{0}" on document "{1}". Server information: {2}
de: Die Verbindung mit Server "{0}" für Dokument "{1}" wurde hergestellt. Serverinformationen: {2}

# ++CODE++d403c686f6a1048014bdd230f59963271b0123ea48245754fc9f264b962a2182
source: Connecting
de: Die Verbindung wird hergestellt.

# ++CODE++4f7403da68117c9595b82a6c264837910b1421a60537bcfa77a004a58b0a4c7a
source: Connecting to server "{0}" on document "{1}".
de: Die Verbindung mit Server "{0}" für Dokument "{1}" wird hergestellt.

# ++CODE++031d95e24e24622c128716284eb67a80331c825272813bf720f2c35a0b18f96c
source: Connecting to:
de: Verbindung wird hergestellt mit:

# ++CODE++52d8d284995954ca5f68adbc705bb4ff2a930cc1ff2a3885a1002ff477394eee
source: Connection Errors
de: Verbindungsfehler

# ++CODE++d913a8ab7732ff7d26c8afceb2e2706c5c991762df193b236fd839bd3a616cb6
source: Connection Profile could not be updated. Please modify the connection details manually in settings.json and try again.
de: Das Verbindungsprofil konnte nicht aktualisiert werden. Bitte ändern Sie die Verbindungsdetails manuell in „settings.json“, und versuchen Sie es noch mal.

# ++CODE++8d137af9c64fba09bbb003aba93f0b029898fe19e7927cd696f4c3e2b69f538d
source: Connection error
de: Verbindungsfehler

# ++CODE++28512f31201abdd26ae93d0caaba3b8a3c77113b9665059a9e1d2ba4e47de64d
source: Connection not found for uri "{0}".
de: Die Verbindung für URI „{0}“ wurde nicht gefunden.

# ++CODE++e21f935f11d7e966dbbae78da9daa378fe8142a14e7c0cd7434183005faa6c5c
source: Copy
de: Kopieren

# ++CODE++d2b6ebb67aeb8ede651aa24682be64c81d2e0a970c297908b470e55fd14c0bcc
source: Copy code and open webpage
de: Code kopieren und Webseite öffnen

# ++CODE++3ae569f53ee1e765e3551a7f7881999f868289afbf0b1c6077d906c68cd10525
source: Copy with Headers
de: Mit Headern kopieren

# ++CODE++4759498ac2a719c619e2c8cf8ee60af2d2407425e95d308eb208425b2a6d427a
source: Create
de: Erstellen

# ++CODE++71c1ec27a8c136ecdc781c1fd2364676155fbab7abf8837b9075eb3b9f9af7c0
source: Create Connection Profile
de: Verbindungsprofil erstellen

# ++CODE++0d5e7861b9a1710c8e1d2347dbb8d4dde272143bbeca537d216474ef7bd9193f
source: Create Firewall Rule
de: Firewallregel erstellen

# ++CODE++60c0c05c936ef432e55dd4ea862b5dd1d454413310190ddaef63ef2dbbf75c03
source: Credential Error: An error occurred while attempting to refresh account credentials. Please re-authenticate.
de: Anmeldeinformationsfehler: Beim Aktualisieren der Kontoanmeldeinformationen ist ein Fehler aufgetreten. Bitte authentifizieren Sie sich erneut.

# ++CODE++e97a0773fb7b656c174155270bd9ded70bc82caa0fc5d65b3ba24871577a5b08
source: Database name
de: Datenbankname

# ++CODE++6fbed214e0ea21c683db0ba2d648ef09b11edf4b4bb23835d4fdda84b5d097f3
source: Disable intellisense and syntax error checking on current document
de: IntelliSense und Syntaxfehlerprüfung im aktuellen Dokument deaktivieren

# ++CODE++acfc5be785a9bb3da11c9f05adb69bd5633096f09002aa44813a1b3207e912ad
source: Disconnect
de: Trennen

# ++CODE++04dfac3671b494ad53fcd152f7a14511bfb35747278aad8ce254a0d6e4ba4718
source: Disconnected
de: Getrennt

# ++CODE++2458834a3d92abf750b8161a959ff2bb0405a29bd8b3b77015d065249bd02b7f
source: Disconnected on document "{0}"
de: Die Verbindung für Dokument "{0}" wurde getrennt.

# ++CODE++48845bff334a50a59aaecf499f28a7a24c3b4b891b8b18a9f1169ad8e8a6b261
source: Dismiss
de: Schließen

# ++CODE++464c4ffd019e1e9691dcf0537c797353ef2b1c1d4833d3d463e5b74ae4547344
source: Edit
de: Bearbeiten

# ++CODE++45e33ceba31737f1cb793c231fafc9dd99074ca1f26476a70b0c830ef155c9d3
source: Enable Trust Server Certificate
de: „Serverzertifikat vertrauen“ aktivieren

# ++CODE++4f03bf1cdf8e7d1882e5198384139c078fa527857e7371ac6cb2d030dede15a3
source: Encrypt
de: Verschlüsseln

# ++CODE++476c508b94c7f515d2276689b1eb5c8d1eb0d109b274cced59a3e1a1e3a247c9
source: Encryption was enabled on this connection, review your SSL and certificate configuration for the target SQL Server, or set 'Trust server certificate' to 'true' in the settings file. Note: A self-signed certificate offers only limited protection and is not a recommended practice for production environments. Do you want to enable 'Trust server certificate' on this connection and retry?
de: Die Verschlüsselung wurde für diese Verbindung aktiviert, überprüfen Sie Ihre SSL- und Zertifikatskonfiguration für den Ziel-SQL Server, oder legen Sie „Serverzertifikat vertrauen“ in der Einstellungsdatei auf „WAHR“ fest. Hinweis: Ein selbstsigniertes Zertifikat bietet nur eingeschränkten Schutz und ist keine empfohlene Praxis für Produktionsumgebungen. Möchten Sie „Serverzertifikat vertrauen“ für diese Verbindung aktivieren und es erneut versuchen?

# ++CODE++6051d2070e8e51a99adfa6b3f5171cfa92107943f46417bcd51a8f5e995c881f
source: End IP Address
de: End-IP-Adresse

# ++CODE++b35ebaaf32f469f2fa86b0b2fb67e6f51fae3fb8e6ceaeaea97c2696321a8ee4
source: Enter new column width
de: Neue Spaltenbreite eingeben

# ++CODE++f251a7b2d632de7a4122dafe6fd4a9e984d632ffe0c1e71591e5e253ea9fda11
source: Error Message:
de: Fehlermeldung:

# ++CODE++d0778b9c6b80f4a1e5c99227f273ca819714dbc51f673a92c354874eaa4a3f7c
source: Error code:
de: Fehlercode:

# ++CODE++609a5b573e17dee5039d1039c26a1601bb44dd596695c7767c81877925759cd7
source: Error connecting to server "{0}". Details: {1}
de: Fehler bei der Verbindungsherstellung mit dem Server "{0}". Details: {1}

# ++CODE++480311d3f925f85184b69381dc5f05bb2607e6beb8d354ffe58276a0cd1dd5d9
source: Error connecting to:
de: Fehler bei der Verbindungsherstellung mit:

# ++CODE++619d1a6dc49f043552f7b8d14e6483de4a2caf1c8270d6168a642c8eccc3a752
source: Error occurred opening content in editor.
de: Fehler beim Öffnen des Inhalts im Editor.

# ++CODE++e3bd07d6d5ddff1c7aefd27f1d3af9d23b97fc19d29d732816ea80fddb08f4dc
source: Error when refreshing token
de: Fehler beim Aktualisieren des Tokens

# ++CODE++126ac0f6a36d10138034e44aae3e764f15c8eabba9192445716609b37d21bda9
source: Error {0}: {1}
de: Fehler "{0}": {1}

# ++CODE++ff26e86bb0cdcae6cd4f1dcfbf7c61047f96a2ae5cdbd9fe0111ed6bd95b2193
source: Error {0}: {1} Please login as a different user and change the password using ALTER LOGIN.
de: Fehler "{0}": {1}. Melden Sie sich als ein anderer Benutzer an, und ändern Sie das Kennwort mit ALTER LOGIN.

# ++CODE++8eecdde079a9092758e271d5a21f28eadbeedb35716353e07cfeb33f52e8005c
source: Error:
de: Fehler:

# ++CODE++6c1ebcf47761be137441b5293902752b802776fa5edd4ebf0193950f1adff0e8
source: Error: Login failed. Retry using different credentials?
de: Fehler: Fehler bei der Anmeldung. Mit anderen Anmeldeinformationen wiederholen?

# ++CODE++9d8c40f184be0169233d713fa64128ca200db300743a2adbb700912c74b5620d
source: Error: Unable to connect using the connection information provided. Retry profile creation?
de: Fehler: Es konnte mit den angegebenen Verbindungsinformationen keine Verbindung hergestellt werden. Profilerstellung wiederholen?

# ++CODE++0a716f1cfed3e0da68a8eee920bd5ca51a470c790800d878429da7ab9ecf0d56
source: Executing query...
de: Abfrage wird ausgeführt...

# ++CODE++031a8f0f659df890dfd53c92e45295b0f14c997185bae46e168831e403b273f7
source: Failed
de: Fehler

# ++CODE++1bad386b21fcdca2a014d1f185f32ca31c641b4b0218b478988b8e7b373447b5
source: Failed to connect: {0}
de: Fehler bei der Verbindungsherstellung: {0}

# ++CODE++62498a2ba93779ef3c23a936f530e6a9286a241a90243dcf1eb13bf44c3f0aa0
source: Failed to delete credential with id: {0}. {1}
de: Fehler beim Löschen von Anmeldeinformationen mit der ID: {0}. {1}

# ++CODE++fa3e091290b3ba78f8eaf354e98df990932f0b9bed9c453f61ac1a887867da16
source: Failed to fetch user tokens.
de: Fehler beim Abrufen von Benutzertoken.

# ++CODE++8eec604197ddc90723c687678e1e97206d9146c079b5e0ead48d533c67970d23
source: Failed to get authentication method, please remove and re-add the account.
de: Fehler beim Abrufen der Authentifizierungsmethode. Entfernen Sie das Konto, und fügen Sie es erneut hinzu.

# ++CODE++7f8ed04b6c80f9c80c6b9644594472ad2fd1da77707d2fa30f63418c0024f68c
source: Failed to refresh connection ${0} with uri {1}, invalid connection result.
de: Fehler beim Aktualisieren der Verbindung ${0} mit URI {1}, ungültiges Verbindungsergebnis.

# ++CODE++283dc9bd4f27ff0efed1b3ac27910746f64f860e2e0c2240f9723ff02c1dc29c
source: Failed to save results.
de: Fehler beim Speichern der Ergebnisse.

# ++CODE++b9ab95c28bb1c6c21592e63cc03daacec4bb7be9774e47ec9a1c6f8721e26b08
source: Finished query execution for document "{0}"
de: Die Abfrageausführung für Dokument "{0}" wurde abgeschlossen.

# ++CODE++8a9ba2938bc6bfe8f093b2168aeb656e1be8e1792c61db93cb074a6e32300b1b
source: Firewall rule name
de: Name der Firewallregel

# ++CODE++69564d37d68e80fe6d9e0507695069d1393632c9f82f5587b79f980436d9cb00
source: Firewall rule successfully added. Retry profile creation?
de: Die Firewallregel wurde erfolgreich hinzugefügt. Profilerstellung wiederholen?

# ++CODE++3a5a47667104807574cb0875e1ad13546429f3ed63efe6b4bddee62fe1f4cf5b
source: Firewall rule successfully created.
de: Die Firewallregel wurde erfolgreich erstellt.

# ++CODE++936af734b4badd8602cb27237f8dea0fd3950e12b5bab278565babc15e854136
source: Found pending reconnect promise for uri {0}, failed.
de: Ausstehende Zusage für Verbindungswiederherstellung für URI {0} gefunden, fehlgeschlagen.

# ++CODE++463124bedefc986e5dc0c3e34607c881ba0337297037552decc1df70945e57e8
source: Found pending reconnect promise for uri {0}, waiting.
de: Ausstehende Zusage für Verbindungswiederherstellung für URI {0} gefunden, wartend.

# ++CODE++bccb449867268397632519e5695a6bb611a30529b735cac4f7d5ecbaee80e785
source: Getting definition ...
de: Definition wird abgerufen...

# ++CODE++b79cac926e0b2e347e72cc91d5174037c9e17ae7733fd7bdb570f71b10cd7bfc
source: Help
de: Hilfe

# ++CODE++1d59e3e131d04ce9ba04c0f297dbd4eddb83c0bfe977b2a6bf19bdeb73f2d5c3
source: Ignore Tenant
de: Mandanten ignorieren

# ++CODE++c1f88e9d6c4145cf0530ae020155384d5688d70ed82a07a35d783bbc4b32238c
source: In progress
de: In Bearbeitung

# ++CODE++afe3d8a0f4733dcd43ec5b17d8c6d8d3ec7e53c511f1ad49d1168ea289bdd055
source: Integrated
de: Integriert

# ++CODE++eced7daa046aa47caa62c3306d8114cb2f558fd2f53ebd2cc4d3b802857d200b
source: Invalid Firewall rule name
de: Ungültiger Name für Firewallregel

# ++CODE++4480c895a6e66acfc4e43550d8a60598168463e52699be5ed28eae3ecf7200c7
source: Invalid IP Address
de: Ungültige IP-Adresse.

# ++CODE++b6b50087a99bf4427265eff9dd813914f1ceb8c55260fa6e7075f9c89fcd45d7
source: Invalid column width
de: Ungültige Spaltenbreite

# ++CODE++a3c13b491573b0d54bf743caf0f5d59d5a791c42ae1072f16bb941be925fae18
source: Keys for token cache could not be saved in credential store, this may cause Microsoft Entra Id access token persistence issues and connection instabilities. It's likely that SqlTools has reached credential storage limit on Windows, please clear at least 2 credentials that start with "Microsoft.SqlTools|" in Windows Credential Manager and reload.
de: Schlüssel für den Tokencache konnten nicht im Anmeldeinformationsspeicher gespeichert werden. Dies kann zu Problemen mit der Microsoft Entra-ID-Zugriffstokenpersistenz und Verbindungsinstabilitäten führen. Es ist wahrscheinlich, dass SqlTools das Speicherlimit für Anmeldeinformationen unter Windows erreicht hat. Löschen Sie mindestens 2 Anmeldeinformationen, die mit "Microsoft.SqlTools|" in Windows Anmeldeinformationsverwaltung beginnen, und laden Sie sie erneut.

# ++CODE++d05f53bafc473abafc1af3b592a9186f7c8b2579999c953b6f3d9f9450c43f50
source: Line {0}
de: Zeile {0}

# ++CODE++614e5389e87ce465fe548a0665aeaa67a52a06ff792f2f791615cd37fb610178
source: Manage Connection Profiles
de: Verbindungsprofile verwalten

# ++CODE++f7fbe0b74789184e887d43fff291578ae0fe4d2b6b9fa4550271dc4a51ff980e
source: Mandatory (Recommended)
de: Obligatorisch (Empfohlen)

# ++CODE++d54543fb6beb1b6dc5aaa5961c0d92fe25a4ae3bc6fe81b241bd9064e43f46d7
source: Mandatory (True)
de: Obligatorisch (WAHR)

# ++CODE++fba6c2c5d9468e741725c7dfa1ac14fb59523c74fa86744027ec0a175e6cae3f
source: Maximize
de: Maximieren

# ++CODE++2f77668a9dfbf8d5848b9eeb4a7145ca94c6ed9236e4a773f6dcafa5132b2f91
source: Message
de: Nachricht

# ++CODE++04d7b48339271ea67d3c8493e07e90bc68dc565485eebe5e0b67c21c1586e3c0
source: Messages
de: Meldungen

# ++CODE++73c5b19bd87f6238ea91f7a12afda7927ec9708f0d2a5ca86154b2e0bbe06109
source: Microsoft Entra Account
de: Microsoft Entra-Konto

# ++CODE++d24b24ff2640e9b5731d40ac97ea534034176c1478b681eca122262c4d98a8a2
source: Microsoft Entra Id - Universal w/ MFA Support
de: Microsoft Entra ID – Universell mit MFA-Unterstützung

# ++CODE++d7f406a55a763bcaf21ae757e59b0ba9b5e2954c074d760a6afa484f977dcf3d
source: Microsoft Entra account {0} successfully added.
de: Das Microsoft Entra-Konto {0} wurde erfolgreich hinzugefügt.

# ++CODE++6334507f512e52b67d0a5a0fb392e35e5d3acc29acdce7218f66b6199150f589
source: New Microsoft Entra account could not be added.
de: Das neue Microsoft Entra-Konto konnte nicht hinzugefügt werden.

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
de: Nein

# ++CODE++dd1e244b4e319bb25477890a9327b3a2419908e042cd4063f9235a0afed6e908
source: No Microsoft Entra account can be found for removal.
de: Es wurde kein Microsoft Entra-Konto zum Entfernen gefunden.

# ++CODE++b5353eb771f89b7df467f5082500e61791da1296427482e4eb5bb0cc5b6bec04
source: No Queries Available
de: Keine Abfragen vorhanden.

# ++CODE++e7877ea821bcdd1b117351c975bccabc10caea61e2e13fae7fe37e0179bd8470
source: No connection profile to remove.
de: Es ist kein Profil vorhanden, das entfernt werden kann.

# ++CODE++87a122216f22b55fd29964cf75c886ef5da5cd8369e2a6e24c73ec0ad22227ba
source: No connection was found. Please connect to a server first.
de: Es wurde keine Verbindung gefunden. Stellen Sie zunächst eine Verbindung mit einem Server her.

# ++CODE++c933cd0d45861a20699df513967542bc9b448f409d362d9bec4e7443dd96f403
source: No need to refresh Microsoft Entra acccount token for connection {0} with uri {1}
de: Es ist nicht erforderlich, das Microsoft Entra-Zugriffstoken für die Verbindung {0} mit dem URI zu aktualisieren. {1}

# ++CODE++dc937b59892604f5a86ac96936cd7ff09e25f18ae6b758e8014a24c7fa039e91
source: None
de: Keine

# ++CODE++ba35f0c47d862763dafa955d6716942f79b8bfe1d01d5968520db6f9ba665f6f
source: Not started
de: Nicht gestartet

# ++CODE++ed077f3d8125d60dca1979c7133601bd187d47c73ed9975028f677e49e709942
source: Open
de: Öffnen

# ++CODE++404eb1204c0e313b45f63c32657b2cabf3f3930b7a731969c82b5bc3061311ff
source: Open Query History
de: Abfrageverlauf öffnen

# ++CODE++ea56aa4cb881e4c3d61d84b95881280b4c10519222fcfe40febcbd4b2d548333
source: OpenSSL version >=1.0.1 is required to connect.
de: Für die Verbindungsherstellung wird OpenSSL-Version 1.0.1 oder höher benötigt.

# ++CODE++da53ba1a285ffae9c6528e235b57336fa85b4f05e9fc00a51ee922069c3d9865
source: Optional (False)
de: Optional (FALSCH)

# ++CODE++5cafcd08f15a2a6ce49d703f1da5861c94ec134cc92984cc6b2f67965c31b5ee
source: Parent node was not TreeNodeInfo.
de: Der übergeordnete Knoten war nicht TreeNodeInfo.

# ++CODE++e7cf3ef4f17c3999a94f2c6f612e8a888e5b1026878e4e19398b23bd38ec221a
source: Password
de: Kennwort

# ++CODE++b0f439de4ac489dfe75bf62e7fb55c9c993851f6f462fbbacae37851a6cad588
source: Password (SQL Login)
de: Kennwort (SQL-Anmeldung)

# ++CODE++a89f61eb88c67866f6b2666a2e7f19b6fa1c97ca8330b81f848895bcc3594a3f
source: Previous pending reconnect promise for uri {0} is rejected with error {1}, will attempt to reconnect if necessary.
de: Die vorherige ausstehende Zusage für die Verbindungswiederherstellung für URI {0} wird mit dem Fehler {1} abgelehnt, bei Bedarf wird versucht, die Verbindung wiederherzustellen.

# ++CODE++74ddf875033fe6ed895f48a8abc4373883fb876b36dfa7614f3f130ceee1ab20
source: Previous pending reconnection for uri {0}, succeeded.
de: Vorherige ausstehende Verbindungswiederherstellung für URI {0}, erfolgreich.
