Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++565339bc4d33d72817b583024112eb7f5cdf3e5eef0252d6ec1b9c9a94e12bb3
source: OK
es: Aceptar
ru: ОК

# ++CODE++ca7981b46ecf2c1787b6d76d81d9fd7fa0ca95842e2fcc2a452869891a9334d1
source: Off
es: Desactivado
fr: Désactivé
ja: オフ
pt_br: Desativado
ru: Откл

# ++CODE++e7cf3ef4f17c3999a94f2c6f612e8a888e5b1026878e4e19398b23bd38ec221a
source: Password
es: Contraseña
fr: Mot de passe
ja: パスワード
pt_br: Senha
ru: Пароль

# ++CODE++c2b1b8e2e03928e24b07be3e3cbc597577096c8303d9aa621a147ca2456bdad7
source: Provisioning
es: Aprovisionando
ru: Подготовка

# ++CODE++07b091a3fdc4e4c03cd047b5264e61241f20fe8dbc36a4c796d46cd8dc3e7d03
source: Schema
es: Esquema
fr: Schéma
ja: スキーマ
pt_br: Esquema
ru: Схема

# ++CODE++102acc10e67a297d79f7a0440d9fb96e2bfe8b1830676ae1d524cde6203212e0
source: Script
ru: Сценарий

# ++CODE++aef7de28d52977f1b5cd0fecfdc151717610adf41e0aa33b4d9f7522a43337ef
source: Server
es: Servidor
fr: Serveur
pt_br: Servidor
ru: Сервер

# ++CODE++f6cd8550a42862c96bedf199eb6415f9f6859b49211e35694080e73978042cf8
source: Server - {0}
es: Servidor: {0}
fr: Serveur – {0}
ru: Сервер — {0}

# ++CODE++e2c8a41969888f518a4656791ee4737b49874f2213d86c949983a67a9ac55212
source: Showplan XML
fr: Plan d’exécution XML
pt_br: XML do plano de execução
ru: XML Showplan

# ++CODE++e23969d284c3424c8014c6e5b1b85ebc275bc5c74321e7677a21d023e6ea154c
source: Tenant
es: Inquilino
fr: Locataire
ja: テナント
pt_br: Locatário
ru: Клиент

# ++CODE++115a2cc92c1097ac4ebeb49698f5e22635a24ee1ef89722616f862ea43c5baba
source: Timestamp
es: Marca de tiempo
fr: Horodateur
ja: タイムスタンプ
pt_br: Carimbo de data/hora
ru: Метка времени

# ++CODE++07d5733e461951eef89bb78ab9c94b24c319ea29f79a98d58b07c4dfc3ab7011
source: View Config
ru: Просмотреть конфигурацию

# ++CODE++3549b0028b75d981cdda2e573e9cb49dedc200185876df299f912b79f69dabd8
source: database
es: base de datos
fr: base de données
pt_br: banco de dados
ru: база данных

# ++CODE++37a8eec1ce19687d132fe29051dca629d164e2c4958ba141d5f4133a33f0688f
source: default
es: Predeterminado
fr: défaut
pt_br: padrão
ru: по умолчанию

# ++CODE++b3eacd33433b31b5252351032c9b3e7a2e7aa7738d5decdf0dd6c62680853c06
source: server
es: servidor
fr: serveur
pt_br: servidor
ru: сервер

# ++CODE++9f86d081884c7d659a2feaa0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08
source: test
es: prueba
ja: テスト
pt_br: teste
ru: тест

# mssql.objectExplorer.Tooltip.databaseLabel
source: database
es: base de datos
ru: база данных

# mssql.objectExplorer.Tooltip.serverLabel
source: server
es: servidor
ru: сервер

# ++CODE++88de0d15d2a8736d9ac542037e6bfa6b4f210be39df50c5b1dd790273c49f678
source: Read the documentation
es: Leer la documentación

# ++CODE++5fa7aac5375c5815787fba3f49559f9b45b14023147ce0652803387974144e5f
source: Ready
es: Listo

# ++CODE++92eb0b1fb89f1725b3c1fe652164720d7b2d17222e81bd5057f02f645fb24e67
source: Average: {0} Count: {1} Distinct Count: {2} Max: {3} Min: {4} Null Count: {5} Sum: {6}
fr: Moyenne : {0} Nombre : {1} Nombre distinct : {2} Max : {3} Min : {4} Nombre de Null : {5} Somme : {6}
pt_br: Média: {0} Contagem: {1} Contagem Distinta: {2} Máx: {3} Mín: {4} Contagem Nula: {5} Soma: {6}

# ++CODE++3d1ae152f7c95ef16327aafe54bc82e4565547c236299ef06d54a8db5980c24f
source: Azure token cache cleared successfully.
fr: Le cache de jetons Azure a été effacé.
ja: Azure トークン キャッシュが正常にクリアされました。
pt_br: Cache de token do Azure limpo com sucesso.

# ++CODE++00aecebb859a5ba020dd5aa5ffb71e7f9a4279e35f9c94e6d34ebf7c889a3f7e
source: Change database to '{1}' for connection '{0}'?
fr: Voulez-vous remplacer la base de données par « {1} » pour la connexion « {0} » ?

# ++CODE++5cca02706714579b1ebf65a02aa3db359c9533120430137485af41e5ec1ab285
source: Changing database to '{1}' for connection '{0}'
fr: Remplacement de la base de données par « {1} » pour la connexion « {0} »

# ++CODE++7aa0a3ede22306a6fe14f159fb12acfbb63bad17edf71486aa552c2cd757e5cd
source: Create As Script
fr: Créer en tant que script
pt_br: Criar Como Script

# ++CODE++85b5093bef4e68ee847dba78ba2e33392c8998bb4d39598442f8713cdeec5c89
source: Disconnect from connection '{0}'?
fr: Voulez-vous vous déconnecter de la connexion « {0} » ?

# ++CODE++810e6bf829af848a6ab728e3b8f94dde597f95f47f11b160ca7eaa9f0d21395b
source: Disconnecting from connection '{0}'
fr: Déconnexion de la connexion « {0} »

# ++CODE++f6d7eb5fe821427ad07a3bf9a3cc35423ddc3ccd3a745b1f09584fbf26f377fe
source: Error loading designer
fr: Erreur lors du chargement du concepteur
ja: デザイナーの読み込みエラー
pt_br: Erro ao carregar o designer

# ++CODE++833b64c15a94f939c4123ec646882d4b8943eb80c95ce91fffb06a7e95a82b61
source: Get connection details for connection '{0}'?
fr: Voulez-vous obtenir les informations sur la connexion pour la connexion « {0} » ?

# ++CODE++2a8c8cd4e7c7142bffa09b893aaf7ab5886407a22a7ef9b2ee4f60f46fad7bf0
source: Getting connection details for connection '{0}'
fr: Obtenir les informations sur la connexion pour la connexion « {0} »

# ++CODE++abfc45dd4a240e3758d4d22759dd9fc99cc5e1d16aec7594708638c368bddb3d
source: List databases for connection '{0}'?
fr: Voulez-vous la liste des bases de données pour la connexion « {0} » ?

# ++CODE++b1eb24f69841df721c66f542d63319e22c5d55ea1bee75d7e60c451023e6c3d2
source: List functions for connection '{0}'?
fr: Lister les fonctions pour la connexion « {0} » ?

# ++CODE++f9fdea6ffd1d5c93340eff3cb4b0f75abcada7d160a99fd8f3092b3632661d84
source: List schemas for connection '{0}'?
fr: Répertorier les schémas pour la connexion « {0} » ?

# ++CODE++f6f60c2f7be85c72c70f3e1803f001d9b89cf11c25d82a6a16ddb4835b2bdc3f
source: List tables for connection '{0}'?
fr: Lister les tables pour la connexion « {0} » ?

# ++CODE++a951e5e9bc9076528c081d96624e0a6b73e1ae9034bc9aa4c1e8bd77e9dffcc4
source: List views for connection '{0}'?
fr: Lister les vues pour la connexion « {0} » ?

# ++CODE++b96793f36b682b832b59fce2ab2fbfbe394de6c913abd6f389f8c19273f040a5
source: Listing databases for connection '{0}'
fr: Listes des bases de données pour la connexion « {0} »

# ++CODE++6c5a3eebc541922b6846fac5140eecc1c8cca7d49fd516d6d492b823bd080339
source: Listing functions for connection '{0}'
fr: Affichage des fonctions pour la connexion « {0} »

# ++CODE++33ed9f224eba0860b9cfb0063fdbd1680208c1e358cecb479c7bd8c46236000e
source: Listing schemas for connection '{0}'
fr: Listing des schémas pour la connexion « {0} »

# ++CODE++22f9095eec94b234a5b2eee74a4c22e23b42d785b67c2027c13fd5b309a93ffa
source: Listing tables for connection '{0}'
fr: Listing des tables pour la connexion « {0} »

# ++CODE++d77ec2c188180112be2e819880b4ea2a8f5f86ec8917db4e18c39bcd02cacc10
source: Listing views for connection '{0}'
fr: Affichage des vues pour la connexion « {0} »

# ++CODE++02bb7cb27116645ab68671a04d8f35d473c32d981ec5ec784e8aa20e9067c2a2
source: Loading deployment page...
fr: Chargement de la page de déploiement...

# ++CODE++4cca27a3569729f8e3fa178db33f438eaa136c7491a5c3d26c807c876a02c292
source: Microsoft Entra Id
fr: Identifiant Microsoft Entra

# ++CODE++ea56aa4cb881e4c3d61d84b95881280b4c10519222fcfe40febcbd4b2d548333
source: OpenSSL version >=1.0.1 is required to connect.
fr: Version OpenSSL >=1.0.1 est obligatoire pour la connexion.
ja: 接続するには、OpenSSL バージョン 1.0.1 以上が必要です。
pt_br: É necessária a versão 1.0.1 ou mais recente do OpenSSL para se conectar.

# ++CODE++5d7e64a2598658aaaf1674a1b6222a0f6ab5bb588831a51d0936879cbf88670c
source: Result Set {0}
fr: Jeu de résultats {0}

# ++CODE++8c69f23e4bff75d84e54afc088af9057c1b2285242fe96f175cbc395b3a16620
source: Run query on connection '{0}'? Query: {1}
fr: Exécuter la requête sur la connexion « {0} » ? Requête : {1}

# ++CODE++b1f11c275b04ef9f8ee2c203bbc9e14168767c3bf289f9915aa1e43adb776cf9
source: Running query on connection '{0}'
fr: Exécution en cours de la requête sur la connexion « {0} »

# ++CODE++cce7c24ebb0a14bc98b7d6a3f18ddfe9c893e65adb1a599321b3e0eca3515490
source: Script As Create
fr: Script comme création
ja: 作成としてのスクリプト
pt_br: Script Como CREATE

# ++CODE++a89fead964a8515cf74f4e5fcfbc0aaa029cee9744df340c6853e59a944de7ad
source: Show Filter
fr: Afficher le filtre
pt_br: Mostrar Filtro

# ++CODE++523fa7449e8252600e65c811dcd62983315d0f9f528741627033a45754f591cf
source: Show schema for connection '{0}'?
fr: Voulez-vous afficher le schéma pour la connexion « {0} » ?

# ++CODE++9c4229606309838f5e0322bca6f6a2fbfe1c05466547670ccfc1aa1f7f29cde9
source: Showing schema for connection '{0}'
fr: Affichage du schéma pour la connexion « {0} »

# mssql.addObjectExplorerLegacy
source: Add Connection (Legacy)
fr: Ajouter une connexion (Héritée)

# mssql.copilot.analyzeQueryPerformance
source: Analyze Query Performance (Preview)
fr: Analyser les performances des requêtes (Préversion)

# mssql.resultsGrid.autoSizeColumns
source: Automatically adjust the column widths based on the visible rows in the result set. Could have performance problems with a large number of columns or large cells
fr: Ajustez automatiquement la largeur des colonnes en fonction des lignes visibles dans le jeu de résultats. Peut avoir des problèmes de performances avec un grand nombre de colonnes ou de cellules volumineuses
pt_br: Ajustar automaticamente as larguras das colunas com base nas linhas visíveis no conjunto de resultados. Pode ter problemas de desempenho com um grande número de colunas ou células grandes

# mssql.deployLocalDockerContainer
source: Create local SQL Container
fr: Créer un conteneur SQL local

# mssql.editTable
source: Edit Table
fr: Modifier la table
ja: テーブルの編集
pt_br: Editar Tabela

# mssql.copilot.explainQuery
source: Explain Query (Preview)
fr: Expliquer la requête (Préversion)

# mssql.userFeedback
source: Give Feedback
fr: Envoyer des commentaires
pt_br: Enviar Comentários

# mssql.copilot.editorSubmenu
source: MSSQL Copilot (Preview)
fr: MSSQL Copilot (Préversion)

# mssql.objectExplorerChatWithDatabaseInAgentMode
source: Open in Copilot Agent mode (Preview)
fr: Ouvrir en mode Assistant Copilot (version préliminaire)

# mssql.objectExplorerChatWithDatabase
source: Open in Copilot Ask mode (Preview)
fr: Ouvrir en mode Copilot Ask (version préliminaire)

# mssql.copilot.rewriteQuery
source: Rewrite Query (Preview)
fr: Réécrire la requête (Préversion)

# mssql.intelliSense.lowerCaseSuggestions
source: Should IntelliSense suggestions be lowercase
fr: Spécifie si les suggestions IntelliSense doivent être en minuscules
ja: IntelliSense の候補を小文字にする場合
pt_br: As sugestões do IntelliSense devem ser em minúsculas?

# mssql.useLegacyConnectionExperience.description
source: Use the legacy connection experience instead of the modern experience.
fr: Utilisez l’expérience de connexion héritée au lieu de l’expérience moderne.

# ++CODE++9caca4621a4e79e9eba8871a8b0772c87fe7af38b1e5ce6518083abfd676c241
source: Azure Account is required
ja: Azure アカウントが必須です
pt_br: Uma Conta do Azure é obrigatória

# ++CODE++bcfba23612af01d6083c1cbc352807182aa4a2a08665615d5e75206766e035c0
source: Azure sign-in failed or was cancelled.
pt_br: A entrada no Azure falhou ou foi cancelada.

# ++CODE++fb329000228cc5a24c264c57139de8bf854fc86fc18bf1c04ab61a2b5cb4b921
source: NULL
pt_br: NULO

# ++CODE++758ece29b31b4a752af1a78afe1fe8397bde2b565327c538b1f2fb5912d51418
source: No result found for the active editor; please run a query or switch to another editor.
pt_br: Nenhum resultado encontrado para o editor ativo; execute uma consulta ou alterne para outro editor.

# ++CODE++becc525b09db5d2c09fe7aa2203290938cd5cb1438f065f216e73957338265e2
source: Schema Compare (Preview)
pt_br: Comparação de Esquemas (Versão prévia)

# mssql.designSchema
source: Design Schema (Preview)
pt_br: Esquema de Design (Versão prévia)

# mssql.enableConnectionPooling
source: Enables connection pooling to improve overall connectivity performance. This setting is enabled by default. Visual Studio Code is required to be relaunched when the value is changed. To clear pooled connections, run the command: 'MS SQL: Clear Pooled Connections'
ja: 接続プールを有効にして、全体的な接続パフォーマンスを向上させます。この設定は既定で有効になっています。値が変更された場合は Visual Studio Code を再起動する必要があります。プールされた接続をクリアするには、次のコマンドを実行します: 'MS SQL: プールされた接続のクリア'
pt_br: Permite que o pool de conexões melhore o desempenho geral da conectividade. Essa configuração está habilitada por padrão. O Visual Studio Code deve ser reinicializado quando o valor é alterado. Para limpar as conexões em pool, execute o comando: "MS SQL: Limpar Conexões em Pool"

# mssql.revealQueryResultPanel
source: Reveal Query Result Panel
pt_br: Revelar Painel de Resultados da Consulta

# mssql.schemaCompare
source: Schema Compare (Preview)
pt_br: Comparação de Esquemas (Versão Prévia)

# mssql.applyLocalization
source: [Optional] Configuration options for localizing into VSCode's configured locale (must restart VSCode for settings to take effect)
ja: [省略可能] VSCode の構成済みロケールにローカライズするための構成オプション (設定を有効にするには VSCode を再起動する必要があります)
pt_br: [Opcional] Opções de configuração para localização na localidade configurada do VS Code (o VS Code deve ser reiniciado para que as configurações entrem em vigor)

# mssql.saveAsCsv.delimiter
source: [Optional] Delimiter for separating data items when saving results as CSV
ja: [省略可能] 結果を CSV として保存するときのデータ項目を区切るための区切り文字
pt_br: [Opcional] Delimitador para separar itens de dados ao salvar os resultados como CSV

# mssql.saveAsCsv.encoding
source: [Optional] File encoding used when saving results as CSV
ja: [省略可能] 結果を CSV として保存するときに使用するファイル エンコード
pt_br: [Opcional] Codificação de arquivo usada ao salvar os resultados como CSV

# mssql.connection.pooling
source: [Optional] When set to 'true', the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool.
ja: [省略可能] 'true' に設定した場合、接続オブジェクトは適切なプールから取得されるか、または必要に応じて作成され、適切なプールに追加されます。
pt_br: [Opcional] Quando definido como "true", o objeto de conexão é extraído do pool adequado ou, se necessário, é criado e adicionado ao pool adequado.

# ++CODE++232bbbc747fa6709e2940f4d0eec4b819b3b007acfdacaec8f3e2e1536799bd7
source: Advanced Type
ja: 高度なタイプ

# ++CODE++dd0c9a87e191fd735e4b79b2006a4804b2190b078a05aff1ea23945f37b309c2
source: Azure Logs
ja: Azure ログ

# ++CODE++8a8bef20f041d1f1fc0ea7966a3fa58563c599617464a303258ed302ddca5a79
source: Connect to SQL Server
ja: SQL Server への接続

# ++CODE++52d8d284995954ca5f68adbc705bb4ff2a930cc1ff2a3885a1002ff477394eee
source: Connection Errors
ja: 接続エラー

# ++CODE++04dfac3671b494ad53fcd152f7a14511bfb35747278aad8ce254a0d6e4ba4718
source: Disconnected
ja: 切断

# ++CODE++476c508b94c7f515d2276689b1eb5c8d1eb0d109b274cced59a3e1a1e3a247c9
source: Encryption was enabled on this connection, review your SSL and certificate configuration for the target SQL Server, or set 'Trust server certificate' to 'true' in the settings file. Note: A self-signed certificate offers only limited protection and is not a recommended practice for production environments. Do you want to enable 'Trust server certificate' on this connection and retry?
ja: この接続で暗号化が有効になっているか、ターゲット SQL Serverの SSL と証明書の構成を確認するか、設定ファイルで 'Trust server certificate' を 'true' に設定します。注: 自己署名証明書では保護が制限されるだけで、運用環境では推奨されません。この接続で 'サーバー証明書の信頼' を有効にして再試行しますか?

# ++CODE++8885e80bb197b22bc702906ef86b149ad49d258c5cb14b09227c19ee4f01061e
source: Greater Than Or Equals
ja: 指定値以上

# ++CODE++a408b91cd1b01aac0b9fa7eec7fafac233eb172b0aafcdf013d88575fac35c1f
source: Less Than Or Equals
ja: 指定値以下

# ++CODE++3b41ba9c7cb8c5d6530c12eec5000c4e2ad0c48b2d4b9149a3ef6d2a23802819
source: No data
ja: データなし

# ++CODE++506fed169e8f53044e70f0b6fc27a11ac7f978d8af2b02e7b284de0fcf2f467e
source: Open snapshot in new tab
ja: 新しいタブでスナップショットを開く

# ++CODE++289db14dbc3d213c4ac28f356bcfc37eb02f473e07ee63bcea2fa7075c888822
source: The name of the table object.
ja: テーブル オブジェクトの名前です。

# ++CODE++c9d2c41f4eeba094c6db66ab88d3c5190e34865d80fe230483b6fdcaddf79e8a
source: The schema that contains the table.
ja: テーブルを含むスキーマです。

# ++CODE++2b8198974f44b4a37d366cb6535153e3646f2c9de308f0ca05bf90513b0a4630
source: This setting requires Visual Studio Code to be relaunched, please reload Visual Studio Code.
ja: この設定をすると、Visual Studio Code を再起動する必要があります。Visual Studio Code を再度読み込んでください。

# extension.queryResult
source: Query Result
ja: クエリ結果

# mssql.connection.connectTimeout
source: [Optional] Specify the length of time in seconds to wait for a connection to the server before terminating connection attempt and generating an error. The default value is 15 seconds for on-premise and 30 seconds for Azure SQL Database connections.
ja: [省略可能] 接続試行を終了してエラーを生成するまでのサーバーへの接続を待機する時間を秒単位で指定します。既定値は、オンプレミスでは 15 秒、Azure SQL Database 接続の場合は 30 秒です。
