Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++9659b767df189a5839c87672cb77cb5c7e5dbe63f59c88712ad34358dda02676
source: No active connection
es: No hay ninguna conexión activa
it: Nessuna connessione attiva
ru: Нет активного подключения

# ++CODE++fd8753767d0ca74647a1d3b877db12f2a65a06f4c81db6eadd086759df0a5ad1
source: No active connection for database change
es: No hay ninguna conexión activa para el cambio de base de datos
it: Nessuna connessione attiva per la modifica del database
ru: Нет активного подключения для изменения базы данных

# ++CODE++796911143ea8bb8e1ff88271e2618eb63b05d9e04cdf6e9363533b0715ab3574
source: No active connection for schema view
es: No hay ninguna conexión activa para la vista de esquema
it: Nessuna connessione attiva per la visualizzazione schema
ru: Нет активного подключения для представления схемы

# ++CODE++d932a05eba0200bedb4b5449ce9e6487525ba3ecfd164e137388fd0833b4121b
source: No active database connection in the current editor. Please establish a connection to continue.
es: No hay ninguna conexión de base de datos activa en el editor actual. Establezca una conexión para continuar.
it: Nessuna connessione di database attiva nell'editor corrente. Stabilire una connessione per continuare.
ru: Нет активного подключения к базе данных в текущем редакторе. Установите подключение, чтобы продолжить.

# ++CODE++971d7b9ca9340d6e8e22146855f8ef9cd9576279575ad1f7bd2fb5f40eaaddf9
source: No active database connection. Please connect to a database first.
es: No hay ninguna conexión de base de datos activa. Conéctese primero a una base de datos.
it: Nessuna connessione di database attiva. Connettersi prima a un database.
ru: Нет активного подключения к базе данных. Сначала подключитесь к базе данных.

# ++CODE++9901d22224c70ca49d9a42f1429021c1f6720eec301efafad38a8a73e0734a87
source: No active text editor found. Please open a file with an active database connection.
es: No se encontró ningún editor de texto activo. Abra un archivo con una conexión de base de datos activa.
it: Nessun editor di testo attivo trovato. Aprire un file con una connessione di database attiva.
ru: Активный текстовый редактор не найден. Откройте файл с активным подключением к базе данных.

# ++CODE++0e5e6762f01f3c5690e6d1628a2105cca05b94b94ccfc5d51534f4231aa4a533
source: No authentication required
it: Nessuna autenticazione richiesta
ru: Проверка подлинности не требуется

# ++CODE++37d715d202ea8a671a72107c5949755a1cfc925eb3b51f4b2ea823d7a54f2aa7
source: No changes detected
es: No se detectó ningún cambio
fr: Aucune modification détectée
it: Nessuna modifica rilevata
pt_br: Nenhuma alteração detectada
ru: Никаких изменений не обнаружено

# ++CODE++3b2b9748d5fb147e1033227d9b53a65f26f62ff8fff7f66f037a1b020166a30a
source: No changes match your search.
it: Nessuna modifica corrisponde ai criteri di ricerca.

# ++CODE++9b1d0a5f102cd0f86d612e1c6b0860d5e918d9bb28966b29acbf500dd9df5b70
source: No changes yet.
it: Non sono ancora presenti modifiche.

# ++CODE++d359844ae129bd7d51eda9e3c61dcf5c4036be148cdf783fc11d6454e8ca372b
source: No connection credentials found
es: No se encontraron credenciales de conexión
it: Non sono stati trovati credenziali di connessione
ru: Учетные данные подключения не найдены

# ++CODE++bb6f0c310647145d31546d24967be9eb8ebae90f640642e9fbb5d7713e6e8550
source: No connection found for connectionId: {0}
es: No se encontró ninguna conexión para connectionId: {0}
fr: Aucune connexion trouvée pour \connectionId : {0}
it: Nessuna connessione trovata per connectionId: {0}
ru: Не найдено подключение для connectionId: {0}

# ++CODE++062ed1eb39f94280e66412038f4fe1971935cfefdde249136051b69c28ed683b
source: No connection groups were found in the file.
it: Nessun gruppo di connessione trovato nel file.
ru: В файле не найдено групп подключений.

# ++CODE++3820494b45e56abad074e97c277e6328476da0ec09dacdf18bc5d5d7a6984cb2
source: No connection information found
es: No se ha encontrado información de conexión
it: Nessuna informazione di connessione disponibile
ru: Сведения о подключении не найдены

# ++CODE++e7877ea821bcdd1b117351c975bccabc10caea61e2e13fae7fe37e0179bd8470
source: No connection profile to remove.
es: No hay ningún perfil de conexión para quitar.
fr: Aucun profil de connexion à supprimer.
it: Non ci sono profili di connessione da rimuovere.
ja: 削除する接続プロファイルがありません。
pt_br: Nenhum perfil de conexão para remover.
ru: Не найдено ни одного профиля подключения, который можно было бы удалить.

# ++CODE++87a122216f22b55fd29964cf75c886ef5da5cd8369e2a6e24c73ec0ad22227ba
source: No connection was found. Please connect to a server first.
es: No se encontró ninguna conexión. Conéctese a un servidor primero.
fr: Aucune connexion. Connectez-vous d’abord à un serveur.
it: Non sono state trovate connessioni. Connettersi prima a un server.
ja: 接続が見つかりませんでした。最初にサーバーに接続してください。
pt_br: Nenhuma conexão foi encontrada. Conecte-se a um servidor primeiro.
ru: Соединение не найдено. Сначала подключитесь к серверу.

# ++CODE++17f0b82ed4308509b67351b92fb3e2892fa54bae44e90f88811c90938aef0c20
source: No connections available. Please create a connection first.
es: No hay conexiones disponibles. Cree una conexión primero.
it: Nessuna connessione disponibile. Creare prima una connessione.
ru: Нет доступных подключений. Сначала создайте подключение.

# ++CODE++9fc475057175144b8fcda9ed4418c5a9aaba01234c96fc1798278f52a9235eff
source: No connections were found in the file.
it: Nessuna connessione trovata nel file.
ru: В файле не найдено подключений.

# ++CODE++d2d2d48c815b0539270873e2ebf75840a4afd724b5fd066bd9dcfb2f30a8c1dd
source: No data available
es: No hay datos disponibles
it: Nessun dato disponibile
ru: Нет доступных данных

# ++CODE++3280128c0901d1323dde9a406ee7d2d6e8e1b98fd30971fa6134b302fec41eca
source: No database objects found matching '{0}'
es: No se encontraron objetos de base de datos que coincidan con '{0}'
it: Nessun oggetto di database corrispondente a '{0}' trovato
ru: Не найдены объекты базы данных, соответствующие "{0}"

# ++CODE++ba88f7938c978ebe84712352f4ef26470066d230ff6332b1e5610b9bd3a81b26
source: No databases found in the selected workspace.
es: No se han encontrado bases de datos en el área de trabajo seleccionada.
it: Non sono stati trovati database nell'area di lavoro selezionata.
ru: Не найдены базы данных в выбранной рабочей области.

# ++CODE++44abb1efd9e1246e7a38688a54d76fd070a07de55884b732dff70f7eff9a0491
source: No databases found in workspace '{0}'.
es: No se encontraron bases de datos en el área de trabajo '{0}'.
it: Nessun database trovato nell'area di lavoro '{0}'.
ru: Базы данных не найдены в рабочей области "{0}".

# ++CODE++9a5ffa9a03deee764163c794a73832d859a2df314715bb7c281f4eaac7919f3f
source: No elements found
es: No se encontraron elementos
it: Non sono stati trovati elementi
ru: Элементы не найдены

# ++CODE++8074b19c0365b61c3a88fe5cbd2d5c6193b9a601b425c22c0acea8273b880251
source: No entities found
it: Nessuna entità trovata

# ++CODE++6c351c116cc7feeaf5724426f891c890b4f7d9cb8baab5f2ec1d6c512cc016b6
source: No items
es: No hay elementos
fr: Aucun élément
it: Nessun elemento
pt_br: Nenhum item
ru: Нет элементов

# ++CODE++4b4d7ac22cee34f92cd16fbe4193b0eb106e185100ea38f72b0190e1affaf933
source: No matches found
es: No se encontraron coincidencias
it: Nessuna corrispondenza trovata
ru: Совпадения не найдены

# ++CODE++1879af23a37978ff5873d50e56a20f354d53be9278d4075d63e9291b22924af8
source: No model found.
es: No se encontró ningún modelo.
fr: Le modèle est introuvable.
it: Nessun modello trovato.
ru: Ни одна модель не найдена.

# ++CODE++c933cd0d45861a20699df513967542bc9b448f409d362d9bec4e7443dd96f403
source: No need to refresh Microsoft Entra acccount token for connection {0} with uri {1}
es: No es necesario actualizar el token de cuenta de Microsoft Entra para la conexión {0} con el URI {1}
fr: Pas besoin d’actualiser le jeton de compte Microsoft Entra pour la connexion {0} avec l’URI {1}
it: Non è necessario aggiornare il token dell'account Microsoft Entra per la connessione {0} con URI {1}
ja: URI {1} との接続 {0} のために Microsoft Entra アカウント トークンを更新する必要はありません
pt_br: Não é necessário atualizar o token da conta do Microsoft Entra para a conexão {0} com o URI {1}
ru: Нет необходимости обновлять маркер учетной записи Microsoft Entra для подключения {0} с URI {1}

# ++CODE++b4722b7d6b5e5dd7c69480a9bd436e71d151acf1a05b81fcace235ba42c83375
source: No pending changes. Make edits to generate a script.
es: No hay cambios pendientes. Realice modificaciones para generar un script.
it: Nessuna modifica in sospeso. Apportare modifiche per generare uno script.
ru: Нет ожидающих изменений. Внесите правки, чтобы создать скрипт.

# ++CODE++a43619f321175f57a27f2a38da381fd367f6806093031b1f82960bcbf542729d
source: No results
es: No hay resultados
fr: Aucun résultat
it: Nessun risultato
pt_br: Sem resultados
ru: Нет результатов

# ++CODE++4dfded12d62e6f18c858be45db4d0f8b07d57a31417037444685fecadb4351d5
source: No results for the active editor
es: No hay resultados para el editor activo
fr: Aucun résultat pour l’éditeur actif
it: Nessun risultato per l'editor attivo
ru: Нет результатов для активного редактора

# ++CODE++ac4f3a6af42834b4d2a24a75250eee26cde1f70bb4bf0359acd6523cafd78d67
source: No results to display
es: No hay resultados para mostrar
fr: Aucun résultat à afficher
it: Nessun risultato da visualizzare
ru: Нет результатов для отображения

# ++CODE++e32e1aa390f5243f880caab46155befbe51dd11233564502e4699d1cd79e56ab
source: No saved connection profiles found.
es: No se encontraron perfiles de conexión guardados.
it: Nessun profilo di connessione salvato trovato.
ru: Сохраненные профили подключений не найдены.

# ++CODE++0affa67640b3025de7e70ca5091dd93bcd11bedecbd01aad309a6013841386af
source: No schema differences were found.
es: No se encontraron diferencias de esquema.
fr: Aucune différence de schéma.
it: Non sono state trovate differenze di schema.
pt_br: Não foi encontrada nenhuma diferença de esquema.
ru: Различия в схемах не найдены.

# ++CODE++9d7ed36dee03c4fbfff36e19d91ab5b6a57f9a5b401819b5bbc23c8afca66936
source: No script available. Make changes to the table data and generate a script first.
es: No hay script disponible. Realice cambios en los datos de la tabla y genere un script primero.
it: Nessuno script disponibile. Apportare modifiche ai dati della tabella e generare prima uno script.
ru: Скрипт недоступен. Сначала измените данные таблицы и создайте скрипт.

# ++CODE++4208eed39129c84332acd1dcb2c74e8e6073039e80862fc02cb09aa3fae5ed8e
source: No script generated.
it: Nessuno script generato.

# ++CODE++548271493601de8634bf0793fb0e09522c1bcce8e1e61c9e51186c9661137729
source: No subscriptions available. Adjust your subscription filters to try again.
es: No hay ninguna suscripción disponible. Ajuste los filtros de suscripción para volver a intentarlo.
fr: Aucun abonnement disponible. Ajustez vos filtres d’abonnement pour réessayer.
it: Non sono disponibili sottoscrizioni. Modificare i filtri della sottoscrizione per riprovare.
pt_br: Nenhuma assinatura disponível. Ajuste os filtros de assinatura para tentar novamente.
ru: Нет доступных подписок. Настройте фильтры подписки, чтобы повторить попытку.

# ++CODE++b77c82c64fb4c0907bfdbdcd893ae285b16a8ef67c42e1ecc6ee3d28fe71e708
source: No tenant selected
es: No se ha seleccionado ningún inquilino
fr: Aucun locataire sélectionné
it: Nessun tenant selezionato
ru: Клиент не выбран

# ++CODE++85a7034216fdb297ac1ce5237fcc0ed0fc92d559a9ecc40cfb7a2963c13256b4
source: No tenants are currently signed in.
es: Actualmente no hay inquilinos con sesión iniciada.
it: Nessun tenant attualmente connesso.
ru: В настоящее время ни один клиент не вошел в систему.

# ++CODE++1714986c355ccdf8acce319f8df2b13f9ccae0f5ee87915f3fa4bbc917b155a7
source: No tools to process.
es: No hay herramientas para procesar.
fr: Aucun outil n’est à traiter.
it: Nessuno strumento da elaborare.
ru: Нет инструментов для обработки.

# ++CODE++1507d637b267b1f20c1238414d7e51458fe7d6b98b292a8497d9982634fbe83c
source: No workspaces found
es: No se han encontrado áreas de trabajo
it: Non sono state trovate aree di lavoro
ru: Рабочие области не найдены

# ++CODE++f567a09466c3451f2b171ee4b409a52f3aea306cea3bd4ca9ad4cef8669f1856
source: No workspaces found. Please change Fabric account or tenant to view available workspaces.
es: No se ha encontrado ninguna área de trabajo. Cambie la cuenta o el inquilino de Fabric para ver las áreas de trabajo disponibles.
it: Nessuna area di lavoro trovata. Cambiare l'account o il tenant di Fabric per visualizzare le aree di lavoro disponibili.
ru: Рабочие области не найдены. Измените учетную запись Fabric или клиент, чтобы просмотреть доступные рабочие области.

# ++CODE++522f7c01e016bd0f95cd3b404ebb0751a2b6db89a57ff1c7e5110b39e1f136e0
source: Non-SQL Server SQL file detected. Disable IntelliSense for such files?
es: Se detectó un archivo SQL no SQL Server. ¿Quiere deshabilitar IntelliSense para estos archivos?
fr: Fichier SQL non SQL Server détecté. Désactiver IntelliSense pour de tels fichiers ?
it: Rilevato file SQL non SQL Server. Disabilitare IntelliSense per tali file?
pt_br: Foi detectado SQL Server arquivo SQL não válido. Desabilitar o IntelliSense para esses arquivos?
ru: Обнаружен SQL Server SQL. Отключить IntelliSense для таких файлов?

# ++CODE++dc937b59892604f5a86ac96936cd7ff09e25f18ae6b758e8014a24c7fa039e91
source: None
es: Ninguno
fr: Aucun
it: Nessuno
ja: なし
pt_br: Nenhum
ru: Отсутствует

# ++CODE++58601e3ffba5990d1be4db9f2bcc6107f9a72949aabd8f68f79bcb2c92195b5f
source: Not Between
es: No entre
fr: Pas entre
it: Non compreso tra
ja: 指定範囲外
pt_br: Não está Entre
ru: Не находится между

# ++CODE++bfccbdda37b86c50ee3c10c461afc9fcc2854ca2d53d33b9bb079798a4f0cf21
source: Not Contains
es: No contiene
fr: Ne contient pas
it: Non contiene
ja: 含まない
pt_br: Não Contém
ru: Не содержит

# ++CODE++1035e37a14f3bc0faf8a937fddf3a6ca0ef9b7ad40aa1de814f0865e044eeda2
source: Not Ends With
es: No termina por
fr: Ne se termine pas par
it: Non termina con
ja: 次で終わらない
pt_br: Não Termina Com
ru: Не заканчивается на

# ++CODE++2abe6ce3689dddb31a75faaafb1a7293649d60f93bff0e48a87e7d5ddd7f2530
source: Not Equals
es: No es igual a
fr: Différent de
it: Non uguale a
ja: 指定値に等しくない
pt_br: Não Iguais
ru: Не равно

# ++CODE++544330f40460cbf3595ddb51445d81c643d5cd9dc72d601db887c01169b5f388
source: Not Starts With
es: No comienza por
fr: Ne commence pas par
it: Non inizia con
ja: 次で始まらない
pt_br: Não Começa Com
ru: Не начинается с

# ++CODE++c823d53ecfb4b96ba917d2a3edff1316f73db7ddcead1f0cc26aed3c36053741
source: Not contains
es: No contiene
it: Non contiene
ru: Не содержит

# ++CODE++c9a7c5601ef0cf94864a294ea116e414d2e0cf571ab03baabf79b726e1dcb294
source: Not equal to
es: Distinto de
it: Diverso da
ru: Не равно

# ++CODE++972711d90594be0ec9340bc56950dc455b2764187dcad7093ae641df2cbc10c5
source: Not likely at all
es: Nada probable
fr: Pas du tout probable
it: Per niente
pt_br: Totalmente improvável
ru: Маловероятно

# ++CODE++491fc91cd76e51571a745d780f0fc91f8ae62622e790cb113828988bba2e3c2c
source: Not signed in
es: Sesión no iniciada
fr: Non connecté
it: Accesso non eseguito
ru: Вход не выполнен

# ++CODE++ba35f0c47d862763dafa955d6716942f79b8bfe1d01d5968520db6f9ba665f6f
source: Not started
es: No iniciado
fr: Non démarré
it: Non avviato
ja: 未開始
pt_br: Não iniciado
ru: Не запущено

# ++CODE++07b555a4dd9446c56aae7bbe326905f8aabc205d5eee96191a71e15510fbb53f
source: Note: A self-signed certificate offers only limited protection and is not a recommended practice for production environments. Do you want to enable 'Trust server certificate' on this connection and retry?
es: Nota: Un certificado autofirmado solo ofrece protección limitada y no es una práctica recomendada para entornos de producción. ¿Desea habilitar el "Certificado de servidor de confianza" en esta conexión y volver a intentarlo?
fr: Remarque : un certificat auto-signé n’offre qu’une protection limitée et n’est pas une pratique recommandée pour les environnements de production. Voulez-vous activer « Approuver le certificat de serveur » sur cette connexion et réessayer ?
it: Nota: un certificato autofirmato offre solo una protezione limitata e non è consigliato per gli ambienti di produzione. Abilitare 'Certificato del server attendibile' in questa connessione e riprovare?
pt_br: Observação: um certificado autoassinado oferece apenas proteção limitada e não é uma prática recomendada para ambientes de produção. Deseja habilitar "Confiar no certificado do servidor" nesta conexão e tentar novamente?
ru: Примечание. Самозаверяющий сертификат обеспечивает ограниченную защиту, и его не рекомендуется применять в производственных средах. Включить параметр "Доверять сертификату сервера" для этого подключения и повторить попытку?

# ++CODE++00faa1559589415a5c6ecf98b61606f4ab0b254a38471dd99f9182e638997a52
source: Null Count: {0}
es: Recuento nulo: {0}
it: Numero valori null: {0}
ru: Число значений NULL: {0}

# ++CODE++6091a3057f7b1b8140c1ad2fc9232cc4d483a484667f76fe8bb305d77ca3deb1
source: Number of Rows Read
es: Número de filas leídas
fr: Nombre de lignes lues
it: Numero di righe lette
ja: 読み取った行数
pt_br: Número de Linhas Lidas
ru: Количество прочитанных строк

# ++CODE++17353b3f8f54bed0a811ad1ed6fb9f3505a0e039df3b934afb3e8bc11976a2ca
source: OLTP, built on Azure SQL
es: OLTP, integrado en Azure SQL
it: OLTP, basato su Azure SQL
ru: OLTP, создано на основе Azure SQL

# ++CODE++501ec8c3629bcdcd52b9d7895c90d04b0c0b969f1134ba024efe021f0a25d867
source: Object Explorer Filter
es: Filtro de Explorador de objetos
fr: Filtre Explorateur d’objets
it: Filtro Esplora oggetti
ja: オブジェクト エクスプローラー フィルター
ru: Фильтр обозревателя объектов

# ++CODE++149f598e7edb5433f886c75bb1bf9e22c7129d29754a8bdc6223eee95384047c
source: Object Type
es: Tipo de objeto
fr: Type d’objet
it: Tipo di oggetto
pt_br: Tipo de Objeto
ru: Тип объекта

# ++CODE++3d371d39d42ed88021e2eb01088039bc934a712a3d74c7813debf543f8dba608
source: On Delete
es: Al eliminar
fr: Lors de la suppression
it: All'eliminazione
pt_br: Ao Excluir
ru: При удалении

# ++CODE++08cc7dbe92d634292815733fbf6b34fba13792fc61a838f93bcaf5fc639b12ee
source: On Delete Action
es: Al eliminar la acción
fr: Action de suppression
it: Azione di eliminazione
ja: 削除アクション時
pt_br: Ao Excluir Ação
ru: При удалении

# ++CODE++3260f8640105db3fc919165eac8ff32b659386c38af4e3fd1d2aa3875a7e3b19
source: On Update
es: Al actualizar
fr: Lors de la mise à jour
it: All'aggiornamento
pt_br: Ao Atualizar
ru: При обновлении

# ++CODE++53dbddd7bcdf5a51afae1447f034e76d78722d20c1d6d62002c00e19f68ea9b2
source: On Update Action
es: Al actualizar la acción
fr: Action de mise à jour
it: Azione di aggiornamento
ja: 更新アクション時に
pt_br: Na Ação de Atualização
ru: При действии обновления

# ++CODE++2d763983a073bc87ca923bb655d5bf3537e7afaaf07ef5f21a8a814550e24413
source: One or more connection groups reference parent groups that do not exist and have been ignored: {0}. Update your settings file to fix these entries.
es: Uno o varios grupos de conexiones hacen referencia a grupos primarios que no existen y se han omitido: {0}. Actualice el archivo de configuración para corregir estas entradas.
it: Uno o più gruppi di connessione fanno riferimento a gruppi padre che non esistono e sono stati ignorati: {0}. Aggiornare il file di impostazioni per correggere queste voci.
ru: Одна или несколько групп подключений ссылаются на несуществующие родительские группы и были проигнорированы: {0}. Обновите файл параметров, чтобы исправить эти записи.

# ++CODE++8c7a5472339eb3d2530ccd1114618d20e8905a539ef06edabfbe928ca30f287a
source: One or more connections reference groups that do not exist and have been ignored: {0}. Update your connection settings to fix these entries.
es: Una o varias conexiones hacen referencia a grupos que no existen y se han omitido: {0}. Actualice la configuración de conexión para corregir estas entradas.
it: Una o più connessioni fanno riferimento a gruppi che non esistono e sono stati ignorati: {0}. Aggiornare le impostazioni di connessione per correggere queste voci.
ru: Одно или несколько подключений ссылаются на несуществующие группы и были проигнорированы: {0}. Обновите параметры подключения, чтобы исправить эти записи.

# ++CODE++ed077f3d8125d60dca1979c7133601bd187d47c73ed9975028f677e49e709942
source: Open
es: Abrir
fr: Ouvrir
it: Apri
ja: 開く
pt_br: Abrir
ru: Открыть

# ++CODE++afe20ac8b79880f255ada45b4113ce2356e2e96da5a833a6262b495ef67c7c33
source: Open .scmp file
es: Abrir el archivo .scmp
fr: Ouvrir le fichier .scmp
it: Apri file .scmp
pt_br: Abrir o arquivo .scmp
ru: Открыть файл .scmp

# ++CODE++2f51d650687c9201f9367014fa093415a3b9612e4ae2738e50210ef39ed0253e
source: Open Containing Folder
es: Abrir carpeta contenedora
it: Apri cartella superiore
ru: Открыть содержащую папку

# ++CODE++82b7be031f380379c3136f863b234cc6ddbddb19fbbae4654585d10506a2e1e6
source: Open Publish Script
es: Abrir el script de publicación
fr: Ouvrir le script de publication
it: Apri script di pubblicazione
pt_br: Abrir Script de Publicação
ru: Открыть сценарий публикации

# ++CODE++27d46ec89f6c8889936e3d885b71d612efdbf08d8514f16157875104d01fd5f5
source: Open Query
es: Abrir consulta
fr: Ouvrir la requête
it: Apri query
ja: クエリを開く
pt_br: Abrir Consulta
ru: Открыть запрос

# ++CODE++404eb1204c0e313b45f63c32657b2cabf3f3930b7a731969c82b5bc3061311ff
source: Open Query History
es: Abrir historial de consultas
fr: Ouvrir l’historique des requêtes
it: Aprire la cronologia delle query
ja: Query History を開く
pt_br: Abrir o Histórico de Consultas
ru: Открыть журнал запросов

# ++CODE++2c1ff609e9acedfcd56ba1c75b3cc704ce0c59afafb9f280e75d37376028e9cd
source: Open SQL editor and connect
es: Abrir el editor SQL y conectar
it: Apri l'editor SQL e connetti
ru: Открыть редактор SQL и подключиться

# ++CODE++458f7bdeed472d6583d8b0e14f2535e896f301136ee1ea3c63fdbf0845407225
source: Open XML
es: Abrir XML
fr: Ouvrir XML
it: Apri XML
ja: XML を開く
pt_br: Abrir XML

# ++CODE++36eaf70bf802c56bb84c14fb713ba56b41a28ba07a5a6cdab3fedd21146ff274
source: Open a new bug
it: Apri un nuovo bug
ru: Открыть новую ошибку

# ++CODE++f395ae5e32b4cc24f8030096918e6a2318d4be5fb9274dbeedc0002ce9840bb7
source: Open in Editor
es: Abrir en el Editor
fr: Ouvrir dans l’Éditeur
it: Apri nell'editor
pt_br: Abrir no Editor
ru: Открыть в редакторе

# ++CODE++35e74c3a943dcaf90a91c99a242ea7dbfb3ead16a012ba5a7d6a747a96e01d64
source: Open in New Tab
es: Abrir en nueva pestaña
fr: Ouvrir dans un nouvel onglet
it: Apri in una nuova scheda
pt_br: Abrir em Nova Guia
ru: Открыть в новой вкладке

# ++CODE++f0ee00f28c5dbe68c0c0dd2a5ebab46d19dda4d81627953d3f8e32be33904842
source: Open in SQL Editor
es: Abrir en el editor SQL
it: Apri in SQL Editor
ru: Открыть в редакторе SQL

# ++CODE++ea1d0f038bbdb9e9aa6649671dcbff49e1f63b700b27d60890da5c60fb4e89af
source: Open in editor
es: Abrir en el editor
fr: Ouvrir dans l’éditeur
it: Apri nell'editor
pt_br: Abrir no editor
ru: Открыть в редакторе

# ++CODE++3a8e07b84d53ba502ae8ee669003537bdbbe321d6c8c6fb6cbd63019cb3d400e
source: Opening Publish Script. This may take a while...
es: Abriendo script de publicación. Esto puede tardar un rato...
fr: Ouverture du script de publication. Cela peut prendre du temps...
it: Apertura dello script di pubblicazione. L'operazione potrebbe richiedere del tempo...
ru: Открытие сценария публикации. Это может занять некоторое время...

# ++CODE++fe0d6bd1aef549a43c5fca4a838882918bd3a85e9641cb5150f31df976e18e38
source: Opening schema designer...
es: Abriendo diseñador de esquemas...
it: Apertura della finestra di progettazione dello schema...
ru: Открытие конструктора схем...

# ++CODE++0f044feb6ca7d6764650e6b800425a84b5ea518d6f531ee92c3995d6c3eca11e
source: Operation
es: Operación
it: Operazione
ru: Операция
