Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# mssql.queryHistoryLimit
source: Number of query history entries to show in the Query History view
es: Número de entradas del historial de consultas que se mostrarán en la vista Historial de consultas
fr: Nombre d’entrées d’historique des requêtes à afficher dans la vue Historique des requêtes
it: Numero di voci della cronologia delle query da visualizzare nella vista cronologia delle query
ja: Query History ビューに表示するクエリ履歴エントリ数
pt_br: Número de entradas do histórico de consultas a serem mostradas na exibição Histórico de Consultas
ru: Число записей журнала запросов, показываемых в представлении "Журнал запросов"

# mssql.walkthroughs.nextSteps.objectExplorerFilters.altText
source: Object Explorer filters
es: Filtros del Explorador de objetos
fr: Filtres d’Explorateur d’objets
it: Filtro Esplora oggetti
pt_br: Filtros do Pesquisador de Objetos
ru: Фильтр обозревателя объектов

# mssql.walkthroughs.nextSteps.objectExplorerFilters.description
source: Only see the database objects that matter most to you by applying filters to the Object Explorer tree. Start by clicking the filter button next to most folders in the Connections view.
es: Vea solo los objetos de la base de datos que más le interesan aplicando filtros al árbol del Explorador de objetos. Empiece haciendo clic en el botón de filtro situado junto a la mayoría de las carpetas en la vista Conexiones.
fr: Affichez uniquement les objets de base de données les plus importants en appliquant des filtres à l’arborescence de l’Explorateur d’objets. Commencez par cliquer sur le bouton de filtre à côté de la plupart des dossiers dans la vue Connexions.
it: Visualizza solo gli oggetti di database che contano di più per te applicando filtri all'albero Esplora oggetti. Inizia facendo clic sul pulsante Filtro accanto alla maggior parte delle cartelle nella visualizzazione Connessioni.
pt_br: Veja apenas os objetos de banco de dados que são mais importantes para você aplicando filtros na árvore do Pesquisador de Objetos. Comece clicando no botão de filtro ao lado da maioria das pastas na exibição Conexões.
ru: Чтобы видеть только самые важные объекты базы данных, примените фильтры к дереву обозревателя объектов. Для начала нажмите кнопку фильтра, которая располагается рядом с большинством папок в представлении "Подключения".

# mssql.openChangelog
source: Open Changelog
es: Abrir registro de cambios
it: Apri log delle modifiche
ru: Открыть журнал изменений

# mssql.openExecutionPlanFile
source: Open Execution Plan File
es: Abrir archivo de plan de ejecución
fr: Ouvrir le fichier de plan d’exécution
it: Apri file piano di esecuzione
ja: 実行プラン ファイルを開く
pt_br: Abrir Arquivo de Plano de Execução
ru: Открыть файл плана выполнения

# mssql.copilot.newQueryWithConnection
source: Open New Query and Connect
es: Abrir nueva consulta y conectar
it: Apri nuova query e connetti
ru: Открыть новый запрос и подключиться

# mssql.openQueryHistory
source: Open Query
es: Abrir consulta
fr: Ouvrir la requête
it: Apri query
ja: クエリを開く
pt_br: Abrir Consulta
ru: Открыть запрос

# mssql.commandPaletteQueryHistory
source: Open Query History in Command Palette
es: Abrir Historial de consultas en la paleta de comandos
fr: Ouvrir Historique des requêtes dans la palette de commandes
it: Apri cronologia delle query nel riquadro comandi
ja: コマンド パレットで Query History を開く
pt_br: Abrir Histórico de Consultas na Paleta de Comandos
ru: Открыть журнал запросов в палитре команд

# mssql.objectExplorerChatWithDatabaseInAgentMode
source: Open in Copilot Agent mode
es: Abrir en modo de agente de Copilot
it: Apri in modalità Agente Copilot
ru: Открыть в режиме агента Copilot

# mssql.objectExplorerChatWithDatabase
source: Open in Copilot Ask mode
es: Abrir en modo de consulta de Copilot
it: Apri in modalità Chiedi a Copilot
ru: Открыть в режиме запроса Copilot

# mssql.pauseQueryHistoryCapture
source: Pause Query History Capture
es: Pausar la captura del historial de consultas
fr: Suspendre la capture de l’historique des requêtes
it: Sospendi acquisizione cronologia delle query
ja: Query History キャプチャの一時停止
pt_br: Pausar a Captura de Histórico de Consultas
ru: Приостановить ведение журнала запросов

# mssql.preventAutoExecuteScript
source: Prevent automatic execution of scripts (e.g., 'Select Top 1000'). When enabled, scripts will not be automatically executed upon generation.
es: Evite la ejecución automática de scripts (por ejemplo, "Seleccionar los 1000 primeros"). Al activarlo, los scripts no se ejecutan automáticamente al generarse.
it: Impedire l'esecuzione automatica degli script (ad esempio, 'Seleziona primi 1000'). Se questa opzione è abilitata, gli script non verranno eseguiti automaticamente al momento della generazione.
ru: Запретить автоматическое выполнение скриптов (например, «Выбрать 1000 лучших»). Если этот параметр включен, скрипты не будут автоматически выполняться при генерации.

# mssql.authCodeGrant.description
source: Prompts users to sign in using their browser.
es: Pide a los usuarios que inicien sesión con su navegador.
fr: Invite les utilisateurs à se connecter à l’aide de leur navigateur.
it: Richiede agli utenti di accedere con il browser.
ja: ブラウザーを使用してサインインするようユーザーに求めます。
pt_br: Solicita que os usuários entrem usando o navegador.
ru: Предлагает пользователям войти с помощью браузера.

# extension.queryHistory
source: Query History
es: Historial de consultas
fr: Historique des requêtes
it: Cronologia delle query
pt_br: Histórico de Consultas
ru: Журнал запросов

# extension.queryResult
source: Query Results
es: Resultados de la consulta
fr: Résultats de la requête
it: Risultati query
ru: Результаты запроса

# mssql.walkthroughs.getStarted.runQueries.altText
source: Query editor and query results pane
es: Editor de consultas y panel de resultados de consultas
fr: Éditeur de requête et volet des résultats de requête
it: Editor di query e riquadro dei risultati query
pt_br: Editor de consultas e painel de resultados da consulta
ru: Редактор запросов и панель результатов запроса

# mssql.walkthroughs.nextSteps.viewQueryPlan.altText
source: Query plan visualization
es: Visualización del plan de consulta
fr: Visualisation d’un plan de requête
it: Visualizzazione del piano di query
pt_br: Visualização do plano de consulta
ru: Визуализация плана запроса

# mssql.refreshObjectExplorerNode
source: Refresh
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
pt_br: Atualizar
ru: Обновить

# mssql.rebuildIntelliSenseCache
source: Refresh IntelliSense Cache
es: Actualizar caché de IntelliSense
fr: Actualiser le cache IntelliSense
it: Aggiorna la cache IntelliSense
ja: IntelliSense キャッシュの更新
pt_br: Atualizar o Cache do IntelliSense
ru: Обновить кэш IntelliSense

# mssql.removeObjectExplorerNode
source: Remove
es: Quitar
fr: Supprimer
it: Rimuovi
ja: 削除
pt_br: Remover
ru: Удалить

# mssql.removeAadAccount
source: Remove Microsoft Entra Account
es: Quitar cuenta de Microsoft Entra
fr: Supprimer le compte Microsoft Entra
it: Rimuovi l'account Microsoft Entra
ja: Microsoft Entra アカウントの削除
pt_br: Remover Conta do Microsoft Entra
ru: Удалить учетную запись Microsoft Entra

# mssql.renameDatabase
source: Rename Database
it: Rinomina database

# mssql.objectExplorer.Tooltip.replicationLabel
source: Replication
es: Replicación
it: Replica
ru: Репликация

# mssql.revealQueryResult
source: Reveal Query Result
es: Mostrar resultado de consulta
fr: Afficher les résultats de la requête
it: Mostra risultati query
ru: Показать результат запроса

# mssql.copilot.rewriteQuery
source: Rewrite Query
es: Reescribir consulta
it: Riscrivi query
ru: Переписать запрос

# mssql.runQueryHistory
source: Run Query
es: Ejecutar consulta
fr: Exécuter la requête
it: Eseguire query
ja: クエリの実行
pt_br: Executar Consulta
ru: Запустить запрос

# mssql.walkthroughs.getStarted.runQueries.title
source: Run a SQL Query
es: Ejecución de una consulta SQL
fr: Exécuter une requête SQL
it: Esegui una query SQL
pt_br: Executar uma Consulta SQL
ru: Выполнить SQL-запрос

# mssql.objectExplorer.Tooltip.containerNameLabel
source: SQL Container Name
es: Nombre del contenedor de SQL
it: Nome contenitore SQL
ru: Имя контейнера SQL

# mssql.objectExplorer.Tooltip.containerVersionLabel
source: SQL Container Version
es: Versión del contenedor de SQL
it: Versione del contenitore SQL
ru: Версия контейнера SQL

# mssql.sqlScriptsSubmenu
source: SQL Scripts
es: Scripts SQL
it: Script SQL
ru: Скрипты SQL

# mssql.schemaCompare
source: Schema Compare
es: Comparación de esquemas
fr: Comparer les schémas
it: Confronto schemi
ru: Сравнение схем

# mssql.schemaDesigner
source: Schema Designer
es: Diseñador de esquemas
fr: Concepteur de schémas
it: Finestra di progettazione schema
ru: Конструктор схем

# mssql.scriptAlter
source: Script as Alter
es: Script como Alter
fr: Script de modification
it: Genera script come ALTER
ja: 変更としてのスクリプト
pt_br: Script como Alterar
ru: Создать скрипт как ALTER

# mssql.scriptCreate
source: Script as Create
es: Script como crear
fr: Script de création
it: Genera script come CREATE
ja: 作成としてのスクリプト
pt_br: Script como Criar
ru: Создать скрипт как CREATE

# mssql.scriptDelete
source: Script as Drop
es: Script como anular
fr: Script de suppression
it: Genera script come DROP
ja: ドロップとしてのスクリプト
pt_br: Script como Remover
ru: Создать скрипт как DROP

# mssql.scriptExecute
source: Script as Execute
es: Script como ejecutar
fr: Script d’exécution
it: Genera script come EXECUTE
ja: 実行としてのスクリプト
pt_br: Script como Executar
ru: Создать скрипт как EXECUTE

# mssql.scriptSelect
source: Select Top 1000
es: Seleccionar los primeros 1000
fr: Sélectionnez les 1 000 premiers
it: Genera script come SELECT TOP 1000
ja: 上位 1000 を選択する
pt_br: Selecione Top 1000
ru: Выбрать первые 1000

# mssql.selectedAzureSubscriptions
source: Selected Azure subscriptions for browsing and managing servers and databases
es: Suscripciones de Azure seleccionadas para examinar y administrar servidores y bases de datos
fr: Abonnements Azure sélectionnés pour la navigation et la gestion des serveurs et des bases de données
it: Sottoscrizioni di Azure selezionate per esplorare e gestire server e database
ru: Выбранные подписки Azure для просмотра серверов и баз данных, а также управления ими

# mssql.userFeedback
source: Send Feedback
es: Enviar comentarios
it: Invia feedback
ru: Отправить отзыв

# mssql.resultsFontFamily
source: Set the font family for the results grid; set to blank to use the editor font
es: Establecer la familia de fuentes para la cuadrícula de resultados; dejar en blanco para usar la fuente del editor
fr: Définissez la famille de polices de la grille de résultats, laissez vide pour utiliser la police de l’éditeur
it: Imposta la famiglia di caratteri per la griglia dei risultati; lasciare vuoto per usare il font dell'editor
ja: 結果グリッドのフォント ファミリを設定します。エディターのフォントを使用するには、空白に設定します
pt_br: Defina a família de fontes para a grade de resultados. Defina como em branco para usar a fonte do editor
ru: Задайте семейство шрифтов для сетки результатов; укажите пустое значение, чтобы использовать размер шрифта редактора

# mssql.resultsFontSize
source: Set the font size for the results grid; set to blank to use the editor size
es: Establecer el tamaño de la fuente para la cuadrícula de resultados; dejar en blanco para usar el tamaño del editor
fr: Définir la taille de police de la grille de résultats, laisser vide pour utiliser la taille de l’éditeur
it: Imposta le dimensioni del carattere per la griglia dei risultati; lasciare vuoto per usare le dimensioni dell'editor
ja: 結果グリッドのフォント サイズを設定します。エディターのサイズを使用するには、空白に設定します
pt_br: Defina o tamanho da fonte para a grade de resultados. Defina como em branco para usar o tamanho do editor
ru: Задайте размер шрифта для таблицы результатов; задайте пустое значение, чтобы использовать размер шрифта редактора

# mssql.shortcuts
source: Shortcuts related to the results window
es: Accesos directos relacionados con la ventana de resultados
fr: Raccourcis associés à la fenêtre de résultats
it: Collegamenti correlati alla finestra dei risultati
ja: 結果ウィンドウに関連するショートカット
pt_br: Atalhos relacionados à janela de resultados
ru: Сочетания клавиш, связанные с окном результатов

# mssql.query.displayBitAsNumber
source: Should BIT columns be displayed as numbers (1 or 0)? If false, BIT columns will be displayed as 'true' or 'false'
es: ¿Deben mostrarse las columnas BIT como números (1 o 0)? Si es false, las columnas BIT se mostrarán como "true" o "false".
fr: Spécifie si les colonnes BIT doivent être affichées comme des nombres (1 ou 0). Si la valeur est « false », les colonnes BIT sont affichées sous la forme « true » ou « false »
it: Consente di indicare se le colonne di tipo BIT devono essere visualizzate come numeri (1 o 0). Se è 'false', verranno visualizzate come 'true' o 'false'
ja: ビット列を数値 (1 または 0) として表示しますか?false の場合、ビット列は 'true' または 'false' として表示されます
pt_br: As colunas BIT devem ser exibidas como números (1 ou 0)? Se false, as colunas BIT serão exibidas como "true" ou "false"
ru: Следует ли показывать столбцы BIT в виде чисел (1 или 0)? Если задать значение FALSE, значения в столбцах типа BIT будут видны как значения "TRUE" или "FALSE"

# mssql.intelliSense.enableIntelliSense
source: Should IntelliSense be enabled
es: Indica si debe habilitarse IntelliSense.
fr: Spécifie si IntelliSense doit être activé
it: Consente di indicare se IntelliSense deve essere abilitato
ja: IntelliSense を有効にする場合
pt_br: O IntelliSense deve estar habilitado?
ru: Должен ли быть включен IntelliSense

# mssql.intelliSense.enableErrorChecking
source: Should IntelliSense error checking be enabled
es: Indica si debe habilitarse la comprobación de errores de IntelliSense.
fr: Spécifie si la vérification des erreurs IntelliSense doit être activée
it: Consente di indicare se il controllo degli errori di IntelliSense deve essere abilitato
ja: IntelliSense エラー チェックを有効にする場合
pt_br: A verificação de erros do IntelliSense deve estar habilitada?
ru: Должна ли быть включена проверка ошибок IntelliSense

# mssql.intelliSense.enableQuickInfo
source: Should IntelliSense quick info be enabled
es: Indica si debe habilitarse la información rápida de IntelliSense.
fr: Spécifie s’il faut activer Info express dans IntelliSense
it: Consente di indicare se le informazioni rapide di IntelliSense devono essere abilitate
ja: IntelliSense クイック 情報を有効にする場合
pt_br: As informações rápidas do IntelliSense devem estar habilitadas?
ru: Должны ли быть включены краткие сведения IntelliSense

# mssql.intelliSense.enableSuggestions
source: Should IntelliSense suggestions be enabled
es: Indica si deben habilitarse las sugerencias de IntelliSense.
fr: Spécifie si les suggestions IntelliSense doivent être activées
it: Consente di indicare se i suggerimenti IntelliSense devono essere abilitati
ja: IntelliSense の候補を有効にする場合
pt_br: As sugestões do IntelliSense devem estar habilitadas?
ru: Должны ли быть включены подсказки IntelliSense

# mssql.piiLogging
source: Should Personally Identifiable Information (PII) be logged in the Azure Logs output channel and the output channel log file.
es: La información de identificación personal debe registrarse en el canal de salida de los registros de Azure y en el archivo de registro del canal de salida.
fr: Les informations d’identification personnelle (PII) doivent-elles être enregistrées dans le canal de sortie Azure Logs et le fichier journal du canal de sortie.
it: Le informazioni personali (PII) devono essere registrate nel canale di output dei Log di Azure e nel file di log del canale di output.
ja: 個人を特定できる情報 (PII) を Azure ログ出力チャネルと出力チャネル ログ ファイルに記録する必要があります。
pt_br: As Informações de Identificação Pessoal (PII) devem ser registradas no canal de saída dos Logs do Azure e no arquivo de log do canal de saída?
ru: Следует ли регистрировать идентифицирующие данные конечного пользователя (PII) в выходном канале журналов Azure и файле журнала выходного канала.

# mssql.enableQueryHistoryFeature
source: Should Query History feature be enabled
es: ¿Debería habilitarse la característica Historial de consultas?
fr: La fonctionnalité Historique des requêtes doit-elle être activée ?
it: La funzionalità cronologia delle query deve essere abilitata
ja: Query History 機能の有効化が必要
pt_br: O recurso Histórico de Consultas deve ser habilitado?
ru: Следует ли включить функцию "Журнал запросов"

# mssql.format.alignColumnDefinitionsInColumns
source: Should column definitions be aligned?
es: Indica si las definiciones de columna deben alinearse.
fr: Spécifie si les définitions de colonne doivent être alignées
it: Consente di indicare se le definizioni di colonna devono essere allineate
ja: 列定義を揃える必要がありますか?
pt_br: As definições de coluna devem estar alinhadas?
ru: Должны ли определения столбцы быть выровнены?

# mssql.format.datatypeCasing
source: Should data types be formatted as UPPERCASE, lowercase, or none (not formatted)
es: Indica si los tipos de datos deben formatearse como MAYÚSCULAS, minúsculas o nada (sin formato).
fr: Spécifie si la mise en forme des types de données est MAJUSCULES, minuscules, ou aucune (sans mise en forme)
it: Consente di indicare se ai tipi di dati deve essere applicata la formattazione in lettere MAIUSCOLE o minuscole oppure se non deve essere applicata alcuna formattazione
ja: データ型を大文字、小文字、またはなし (書式設定なし) として書式設定する場合
pt_br: Os tipos de dados devem estar formatados como MAIÚSCULAS, minúsculas ou nenhum (não formatados)?
ru: Должен ли формат типов данных быть "ВЕРХНИЙ РЕГИСТР", "нижний регистр" или "нет" (формат отсутствует)

# mssql.format.keywordCasing
source: Should keywords be formatted as UPPERCASE, lowercase, or none (not formatted)
es: Indica si las palabras clave deben formatearse como MAYÚSCULAS, minúsculas o nada (sin formato).
fr: Spécifie si la mise en forme des mots clés est MAJUSCULES, minuscules, ou aucune (sans mise en forme)
it: Consente di indicare se alle parole chiave deve essere applicata la formattazione in lettere MAIUSCOLE o minuscole oppure se non deve essere applicata alcuna formattazione
ja: キーワードを大文字、小文字、またはなし (書式設定なし) として書式設定する場合
pt_br: As palavras-chave devem estar formatadas como MAIÚSCULAS, minúsculas ou nenhum (não formatadas)?
ru: Должен ли формат ключевых слов быть "ВЕРХНИЙ РЕГИСТР", "нижний регистр" или "нет" (формат отсутствует)

# mssql.autoDisableNonTSqlLanguageService
source: Should language service be auto-disabled when extension detects Non-MSSQL files
es: ¿Debe deshabilitarse automáticamente el servicio de lenguaje cuando la extensión detecte archivos que no son de MSSQL?
fr: Spécifier si le service de langage doit être désactivé automatiquement lorsque l’extension détecte les fichiers non-MSSQL
it: Indica se il servizio di linguaggio deve essere disabilitato automaticamente quando l'estensione rileva file non MSSQL
pt_br: O serviço de linguagem deve ser desabilitado automaticamente quando a extensão detectar arquivos Não MSSQL
ru: Следует ли автоматически отключить языковую службу, если расширение обнаруживает файлы, отличные от MSSQL

# mssql.persistQueryResultTabs
source: Should query result selections and scroll positions be saved when switching tabs (may impact performance)
es: Indica si deben guardarse las posiciones de desplazamiento y las selecciones de resultados de consulta al cambiar las pestañas (puede afectar al rendimiento).
fr: Spécifie si les sélections de résultat de requête et les positions de défilement doivent être enregistrées lors du passage d’un onglet à l’autre (peut impacter les performances)
it: Consente di indicare se salvare le selezioni dei risultati della query e le posizioni di scorrimento quando si cambiano scheda (può influire sulle prestazioni)
ja: タブを切り替えるときにクエリ結果セクションとスクロール位置を保存する場合 (パフォーマンスに影響する可能性があります)
pt_br: As seleções de resultados da consulta e as posições de rolagem devem ser salvas ao alternar as guias (isso pode afetar o desempenho)?
ru: Должны ли сохраняться выбранные элементы результатов запросов и позиции прокрутки при переключении между вкладками (может повлиять на производительность)

# mssql.format.placeSelectStatementReferencesOnNewLine
source: Should references to objects in a select statements be split into separate lines? E.g. for 'SELECT C1, C2 FROM T1' both C1 and C2 will be on separate lines
es: ¿Deben separarse en líneas distintas las referencias a objetos de las instrucciones select? Por ejemplo, en "SELECT C1, C2 FROM T1", C1 y C2 estarán en líneas separadas
fr: Spécifie si les références à des objets dans des instructions select doivent être réparties sur plusieurs lignes. Par exemple, pour « SELECT C1, C2 FROM T1 », C1 et C2 sont sur des lignes distinctes
it: Consente di indicare se i riferimenti agli oggetti in istruzioni select devono essere suddivisi su righe diverse. Ad esempio per 'SELECT C1, C2 FROM T1' sia C1 che C2 saranno su righe diverse
ja: select ステートメント内のオブジェクトへの参照は別々の行に分割する必要がありますか?例: 'SELECT C1, C2 FROM T1' の場合、C1 と C2 の両方が別々の行に配置されます
pt_br: As referências a objetos em uma instrução select devem ser divididas em linhas separadas? Por exemplo, para "SELECT C1, C2 FROM T1", C1 e C2 devem estar em linhas separadas
ru: Следует ли разбивать на отдельные строки ссылки на объекты в инструкции SELECT? Например, для "SELECT C1, C2 FROM T1" C1 и C2 будут расположены в отдельных строках.

# mssql.showChangelogOnUpdate
source: Show changelog after extension updates
es: Mostrar el registro de cambios tras las actualizaciones de la extensión
it: Mostrare il log delle modifiche dopo gli aggiornamenti dell'estensione
ru: Показывать журнал изменений после обновления расширения

# mssql.query.showActiveConnectionAsCodeLensSuggestion
source: Show the active SQL connection details as a CodeLens suggestion at the top of the editor for quick visibility.
es: Muestra los detalles de la conexión SQL activa como una sugerencia de CodeLens en la parte superior del editor para una rápida visibilidad.
fr: Affichez les détails de la connexion SQL active sous forme de suggestion CodeLens en haut de l’éditeur pour une visibilité rapide.
it: Per una rapida visibilità, mostra i dettagli della connessione SQL attiva come suggerimento CodeLens nella parte superiore dell'editor.
ru: Отображать сведения об активном подключении SQL в виде предложения CodeLens в верхней части редактора для быстрого просмотра.

# mssql.walkthroughs.nextSteps.sortAndFilterQueryResults.title
source: Sort and Filter Query Results
es: Ordenar y filtrar los resultados de la consulta
fr: Trier et filtrer les résultats de requête
it: Ordina e filtra i risultati della query
pt_br: Classificar e filtrar os resultados da consulta
ru: Сортировка и фильтрация результатов запроса

# mssql.walkthroughs.nextSteps.sortAndFilterQueryResults.altText
source: Sort and filter options for query results
es: Opciones de ordenación y filtrado para los resultados de la consulta
fr: Options de tri et de filtrage des résultats de requête
it: Opzioni di ordinamento e filtro per i risultati della query
pt_br: Opções de classificação e filtragem para os resultados da consulta
ru: Варианты сортировки и фильтрации результатов запроса

# mssql.walkthroughs.nextSteps.sortAndFilterQueryResults.description
source: Sort and filter your query results to find the data you need quickly.
es: Ordene y filtre los resultados de la consulta para encontrar rápidamente los datos que necesita.
fr: Triez et filtrez les résultats de votre requête pour rechercher rapidement les données dont vous avez besoin.
it: Ordina e filtra i risultati della query per trovare rapidamente i dati necessari.
pt_br: Classifique e filtre os resultados da sua consulta para encontrar rapidamente os dados de que você precisa.
ru: Сортируйте и фильтруйте результаты запроса, чтобы быстро находить нужные данные.
