Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++c7869b25e42d5683ca7cf9fc6cc3bbe5c8c39dab0ee1f2938b5570714350d0bb
source: Fabric Account is required
es: Se requiere una cuenta de Fabric
it: È richiesto un account Fabric
ru: Требуется учетная запись Fabric

# ++CODE++3070527056fcbd2ba823f6ed6ec72a556b5d82695b4490bc28c86d210c696bad
source: Fabric Workspaces
es: Áreas de trabajo de Fabric
it: Aree di lavoro di Fabric
ru: Рабочие области Fabric

# ++CODE++56dd693767481cc69348e746edb945f23807899ed5736241c47000f787be902a
source: Fabric is not supported in the current cloud ({0}). Ensure setting '{1}' is configured correctly.
es: Fabric no se admite en la nube actual ({0}). Asegúrese de que el valor "{1}" esté configurado correctamente.
it: Fabric non è supportato nel cloud corrente ({0}). Assicurarsi che l'impostazione '{1}' sia configurata correttamente.
ru: Fabric не поддерживается в текущем облаке ({0}). Убедитесь, что параметр "{1}" настроен правильно.

# ++CODE++3db198c251ac68aeafbdfbb134d03b8be7bca7a5b2f612addb78f72b2da67a90
source: Fabric long-running API error with error code '{0}': {1}
es: Error de API de larga ejecución de Fabric con código de error '{0}': {1}
it: Errore API di Fabric a esecuzione prolungata con codice errore '{0}': {1}
ru: Долгосрочная ошибка API Fabric с кодом ошибки "{0}": {1}

# ++CODE++c85fb96bbfbe33bde4a67a8e9223c63dc3a3f817428e22ff8357a1ae30f6f4eb
source: Fabric targets are currently not supported in this preview, and we are working to improve the experience.
es: Los destinos de Fabric no se admiten actualmente en esta versión preliminar y estamos trabajando para mejorar la experiencia.
it: I target Fabric non sono attualmente supportati in questa anteprima, ma stiamo lavorando per migliorare l'esperienza.
ru: Целевые объекты Fabric в этой предварительной версии пока не поддерживаются. Мы работаем над улучшением взаимодействия.

# ++CODE++031a8f0f659df890dfd53c92e45295b0f14c997185bae46e168831e403b273f7
source: Failed
es: Erróneo
fr: Échec
it: Operazione non riuscita
ja: 失敗
pt_br: Com falha
ru: Сбой

# ++CODE++2332577de7a1ae1c1fdad89cd3a54570fcafcfcf1e149fda9dc0c42d4f88fbdb
source: Failed disposing query: {0}
es: Error al eliminar la consulta: {0}
fr: Échec de la suppression de la requête : {0}
it: Eliminazione della query non riuscita: {0}
ru: Не удалось очистить запрос: {0}

# ++CODE++65b387854eab2ea5751dfeaf4b61e988e28642ef25dc8c09b8bd4e4ee99f6372
source: Failed to apply changes: '{0}'
es: Error al aplicar los cambios: "{0}"
fr: Échec de l'application des modifications : '{0}'
it: Non è stato possibile applicare le modifiche: '{0}'
pt_br: Falha ao aplicar as alterações: '{0}'
ru: Не удалось применить изменения: "{0}"

# ++CODE++0f20f13b4e0c02dbfd1419272fdc0223aea4745a0704daf5f91876a21476bda2
source: Failed to change database
es: No se pudo cambiar la base de datos
it: Non è stato possibile modificare il database
ru: Не удалось изменить базу данных

# ++CODE++46c9f3b7520fde539ec4452ba821c1b8ad43f18971284f033ab93d32f04c65df
source: Failed to connect
es: No se pudo establecer la conexión
it: Non è possibile connettersi
ru: Не удалось подключиться

# ++CODE++6e543be4255a8c4362baca16d0850278f1d95a7df9cd38f4b94ecbda4abe57e5
source: Failed to connect to database: {0}
es: No se pudo establecer la conexión con la base de datos: {0}
fr: Nous n’avons pas pu effectuer la connexion à la base de données : {0}
it: Non è possibile eseguire la connessione al database: {0}
ru: Не удалось подключиться к базе данных: {0}

# ++CODE++fa67448b4462617636ae14506c499652d8c34cd90403d12db04c67c4710ef93b
source: Failed to connect to server
es: No se pudo conectarse con el servidor
it: Non è stato possibile connettersi al server
ru: Не удалось подключиться к серверу

# ++CODE++d6ca257a745c3035dfd24b1cf8bddd511b93f0c4ae8036dc0d88ece8501d4d13
source: Failed to connect to server.
es: No se pudo conectar con el servidor.
fr: Échec de la connexion au serveur.
it: Impossibile connettersi al server.
ru: Не удалось подключиться к серверу.

# ++CODE++1bad386b21fcdca2a014d1f185f32ca31c641b4b0218b478988b8e7b373447b5
source: Failed to connect: {0}
es: No se pudo conectar: {0}
fr: La connexion a échoué : {0}
it: Non è stato possibile connettersi: {0}
ja: 接続に失敗しました: {0}
pt_br: Falha na conexão: {0}
ru: Не удалось установить соединение: {0}

# ++CODE++c813934a8ac886dc843cc3dd41282656501a8c9f7da085c104e96d4d50d6fc93
source: Failed to copy script: {0}
es: No se pudo copiar el script: {0}
it: Non è stato possibile copiare lo script: {0}
ru: Не удалось скопировать скрипт: {0}

# ++CODE++707f0ef201b7dca62aa44100faafcd54168f7614d4966e200f9188b638abdd52
source: Failed to create a new row: {0}
es: No se pudo crear una nueva fila: {0}
it: Non è stato possibile creare una nuova riga: {0}
ru: Не удалось создать новую строку: {0}

# ++CODE++1d1ece53e805a9b638cb289253e56faa6197e148738b75e24f6670b681717ff0
source: Failed to create database '{0}'. {1}
it: Non è possibile creare il database "{0}". {1}

# ++CODE++62498a2ba93779ef3c23a936f530e6a9286a241a90243dcf1eb13bf44c3f0aa0
source: Failed to delete credential with id: {0}. {1}
es: No se pudo eliminar la credencial con el id.: {0}. {1}
fr: Échec de la suppression de l’identifiant avec l’id : {0}. {1}
it: Non è stato possibile eliminare le credenziali con ID: {0}. {1}
ja: ID: {0} の資格情報を削除できませんでした。 {1}
pt_br: Falha ao excluir credencial com ID: {0}. {1}
ru: Не удалось удалить учетные данные с идентификатором: {0}. {1}

# ++CODE++21be0d0cbfd3dc3a4c9bbb0fc261d09ba6b93641dcbaba9f6202b815e5ccb3f2
source: Failed to delete {0}.
es: No se pudo eliminar {0}.
fr: La suppression de {0} a échoué.
it: Non è stato possibile eliminare {0}.
ru: Не удалось удалить {0}.

# ++CODE++f7a651621eb764f916f46ebe62caf229dac567051acd6540f0e2b87d50e3f59c
source: Failed to drop database '{0}'. {1}
it: Non è possibile rimuovere il database "{0}". {1}

# ++CODE++81e351f7a6077b0ce810f3e316831fbfbfe02b36e74496748b59abc51274001b
source: Failed to establish connection with ID "{0}". Please check connection details and network connectivity.
es: No se pudo establecer la conexión con el id. "{0}". Compruebe los detalles de la conexión y la conectividad de red.
it: Non è possibile stabilire una connessione con ID "{0}". Verificare i dettagli della connessione e la connettività di rete.
ru: Не удалось установить подключение с идентификатором "{0}". Проверьте сведения о подключении и сетевую доступность.

# ++CODE++ea0dea0bb9eee10d354e63ec17ca218936102772ba4574d9f43fa980fd570b95
source: Failed to export results: {0}
es: Error al exportar los resultados: {0}
it: Non è stato possibile esportare la risorsa: {0}
ru: Не удалось экспортировать результаты: {0}

# ++CODE++5da8436d7f85f325dbcb03e43c8b81f49b13fa6997b2e200ff9f5272cb577fc5
source: Failed to fetch Docker container tags: {0}
es: Error al obtener las etiquetas del contenedor Docker: {0}
it: Non è stato possibile recuperare i tag del contenitore Docker: {0}
ru: Не удалось получить теги контейнера Docker: {0}

# ++CODE++fa3e091290b3ba78f8eaf354e98df990932f0b9bed9c453f61ac1a887867da16
source: Failed to fetch user tokens.
es: No se pudieron capturar los tokens de usuario.
fr: La récupération des jetons utilisateur a échoué.
it: Non è stato possibile recuperare i token utente.
ja: ユーザー トークンを取り込めませんでした。
pt_br: Falha ao buscar os tokens de usuário.
ru: Не удалось получить токены пользователя.

# ++CODE++241834c43f110abedd551f363f4ea866f360fe552cd16f8cec31ab975738c57c
source: Failed to generate SqlPackage command: {0}
it: Non è possibile generare il comando SqlPackage: {0}
ru: Не удалось создать команду SqlPackage: {0}

# ++CODE++fe1cb43be8ed9ac5acc09fb31eba382f60c86eaadf55b6931322b9b139162a9e
source: Failed to generate publish script: '{0}'
es: Error al generar el script de publicación: "{0}"
fr: Échec de la génération du script de publication : « {0} »
it: Non è stato possibile generare lo script di pubblicazione: '{0}'
ru: Не удалось создать сценарий публикации: "{0}"

# ++CODE++765a301a99c7eee94fb83e4719d18340210f77b71528783b41061a2a9d555e3e
source: Failed to generate script. Please check the logs for more details.
es: No se pudo generar el script. Consulte los registros para obtener más detalles.
it: Non è stato possibile generare lo script. Per altri dettagli, controllare i log.
ru: Не удалось создать скрипт. Дополнительные сведения см. в журналах.

# ++CODE++cdf943bd7b320469af4343440384b361de46832547d9bc9c08b3bd9a90610364
source: Failed to generate script: '{0}'
es: No se pudo generar el script: "{0}"
fr: Échec de la génération du script : '{0}'
it: Non è stato possibile generare lo script: '{0}'
pt_br: Falha ao gerar script: '{0}'
ru: Не удалось создать сценарий: "{0}"

# ++CODE++8d5f2e14eff0aed3f2ac97085dfd89e385dab998301ffa54088ed3f52b37babb
source: Failed to generate script: {0}
es: No se pudo generar el script: {0}
it: Non è stato possibile generare lo script: {0}
ru: Не удалось создать скрипт: {0}

# ++CODE++90971b4f986b2a5d6c3d6f32b711a0bbb3f93d8453a9f0006c0a30d1350cdaff
source: Failed to get Fabric workspaces for tenant '{0} ({1})'.
es: No se pudieron obtener las áreas de trabajo de Fabric para el inquilino '{0} ({1})'.
it: Non è possibile ottenere le aree di lavoro di Fabric per il tenant '{0} ({1})'.
ru: Не удалось получить рабочие области Fabric для клиента "{0} ({1})".

# ++CODE++b4130b296ab05c9b6d46fa30eb4c7256fb9880192dca9262d2a8e524852dc226
source: Failed to get Fabric workspaces for tenant '{0} ({1})': {2}
es: Error al obtener las áreas de trabajo de Fabric para el inquilino "{0} ({1})": {2}
it: Non è possibile ottenere le aree di lavoro di Fabric per il tenant '{0} ({1})': {2}
ru: Не удалось получить рабочие области Fabric для клиента "{0} ({1})": {2}

# ++CODE++8eec604197ddc90723c687678e1e97206d9146c079b5e0ead48d533c67970d23
source: Failed to get authentication method, please remove and re-add the account.
es: No se pudo obtener el método de autenticación. Quite y vuelva a agregar la cuenta.
fr: Échec de l’obtention de la méthode d’authentification. Supprimez et rajoutez le compte.
it: Non è stato possibile ottenere il metodo di autenticazione. Rimuovere e aggiungere di nuovo l'account.
ja: 認証方法を取得できませんでした。アカウントを削除して再追加してください。
pt_br: Falha ao obter o método de autenticação. Remova e adicione novamente a conta.
ru: Не удалось получить метод проверки подлинности. Удалите и снова добавьте учетную запись.

# ++CODE++329f218a3e5212fcaa1558fed9984172c9a456980d1c8015ea761b5a017d19b4
source: Failed to get tenant '{0}' for account '{1}'.
es: No se pudo obtener el inquilino '{0}' para la cuenta '{1}'.
it: Non è possibile ottenere il tenant '{0}' per l'account '{1}'.
ru: Не удалось получить клиент "{0}" для учетной записи "{1}".

# ++CODE++11b16df18b896654fb041aa90fd64079d60b741da33d4b5f931d75f8dcc7d1a4
source: Failed to list databases
es: Error al enumerar las bases de datos
it: Creazione dell'elenco dei database non riuscita
ru: Не удалось получить список баз данных

# ++CODE++d1167662f9f4ae95339878cfc71934cb03fce7f402dd7648b10e281fad1a6c4e
source: Failed to load data: {0}
es: No se pudieron cargar los datos: {0}
it: Non è stato possibile caricare i dati: {0}
ru: Не удалось загрузить данные: {0}

# ++CODE++10b8baec7e7c3be69a945e7d6efbe3672d2a7a1b19642cd0867e8ea353335579
source: Failed to load databases
es: No se pudieron cargar las bases de datos
it: Non è stato possibile caricare i database
ru: Не удалось загрузить базы данных

# ++CODE++3124ddbedded23af64f8d5506005863517b446c2767c1d81660d1074b969e089
source: Failed to load publish profile
es: Error al cargar el perfil de publicación
it: Non è possibile caricare il profilo di pubblicazione
ru: Сбой загрузки профиля публикации

# ++CODE++0b4d03ded989b13fa01f90e1cff6b70f68bdae9f9cd4e6ab5607a098baa80b20
source: Failed to open scmp file: '{0}'
es: No se pudo abrir el archivo scmp: "{0}"
fr: Échec de l'ouverture du fichier scmp : '{0}'
it: Non è stato possibile aprire il file scmp: '{0}'
pt_br: Falha ao abrir o arquivo scmp: '{0}'
ru: Не удалось открыть файл SCMP: "{0}"

# ++CODE++139d19f27345e3ce0787cd0cdd3497658705c987f492c0f1881127e5ffcdc79e
source: Failed to open script in editor.
es: No se pudo abrir el script en el editor.
it: Non è stato possibile aprire lo script nell'editor.
ru: Не удалось открыть скрипт в редакторе.

# ++CODE++00e34162fb43e373f12b352ea75d1e2241f480dbda87ec290aaa6f020232edaa
source: Failed to open script: {0}
es: No se pudo abrir el script: {0}
it: Non è stato possibile aprire lo script: {0}
ru: Не удалось открыть скрипт: {0}

# ++CODE++644046a988c76e759d05ee90c400f545f6fee393f6c75a23495c621fe9e27b5d
source: Failed to pull SQL Server image. Please check your network connection and try again.
es: No se pudo extraer la imagen de SQL Server. Compruebe la conexión de red e inténtelo de nuevo.
fr: Échec de l'extraction de l'image SQL Server. Veuillez vérifier votre connexion réseau et réessayer.
it: Pull dell'immagine di SQL Server non riuscito. Controllare la connessione di rete e riprovare.
ru: Не удалось получить образ SQL Server. Проверьте подключение к сети и повторите попытку.

# ++CODE++7f8ed04b6c80f9c80c6b9644594472ad2fd1da77707d2fa30f63418c0024f68c
source: Failed to refresh connection ${0} with uri {1}, invalid connection result.
es: No se pudo actualizar la conexión ${0} con uri {1}, resultado de conexión no válido.
fr: Échec de l’actualisation de la connexion ${0} avec l’URI {1}, résultat de connexion non valide.
it: Non è stato possibile aggiornare la connessione ${0} con l'URI {1}. Risultato della connessione non valido.
ja: URI {1} の接続 ${0} を更新できませんでした。接続の結果が無効です。
pt_br: Falha ao atualizar a conexão ${0} com o URI {1}, resultado da conexão inválida.
ru: Не удалось обновить подключение ${0} с URI {1}. Недопустимый результат подключения.

# ++CODE++e63c0b0e63209727946a87b02022f9648e8632a2b450e52618307c2107df5ead
source: Failed to remove row: {0}
es: No se pudo quitar la fila: {0}
it: Non è stato possibile rimuovere la riga: {0}
ru: Не удалось удалить строку: {0}

# ++CODE++309bc0739401a907fa1d222eff128feb5fc0feb86312e4f727ad14c7f8c20e95
source: Failed to rename database '{0}' to '{1}'. {2}
it: Non è possibile rinominare il database "{0}" in "{1}". {2}

# ++CODE++c5dfa95897b89c1d17492b4591948b4a1c45ddde07a7e6aeebaaecca6dbdd888
source: Failed to revert cell: {0}
es: No se pudo revertir la celda: {0}
it: Non è stato possibile ripristinare la cella: {0}
ru: Не удалось отменить изменения ячейки: {0}

# ++CODE++55b0c5ea36504fe873a64ee13ff67759e1652595433ef2f29f23c4672281a0fc
source: Failed to revert row: {0}
es: No se pudo revertir la fila: {0}
it: Non è possibile ripristinare la riga: {0}
ru: Не удалось отменить изменения строки: {0}

# ++CODE++07e849b745794c4b9068165d834b1819e8cc4663ec8a733b07337a06d1375fcb
source: Failed to save changes: {0}
es: No se pudieron guardar los cambios: {0}
it: Non è stato possibile salvare le modifiche: {0}
ru: Не удалось сохранить изменения: {0}

# ++CODE++656e30cd5a427ecbf935f88a531699c67f2edc2f0cfa7ef8cbec340a88c0c423
source: Failed to save publish profile
es: Error al guardar el perfil de publicación
it: Non è possibile salvare il profilo di pubblicazione
ru: Сбой сохранения профиля публикации

# ++CODE++283dc9bd4f27ff0efed1b3ac27910746f64f860e2e0c2240f9723ff02c1dc29c
source: Failed to save results.
es: No se pudieron guardar los resultados.
fr: L’enregistrement des résultats a échoué.
it: Non è stato possibile salvare i risultati.
ja: 結果を保存できませんでした。
pt_br: Falha ao salvar os resultados.
ru: Не удалось сохранить результаты.

# ++CODE++d264deec475c02adeccd53122253873cb7011b90f23c7af978cbfff13f3f92a6
source: Failed to save scmp file: '{0}'
es: No se pudo guardar el archivo scmp: "{0}"
fr: Échec de l'enregistrement du fichier scmp : '{0}'
it: Non è stato possibile salvare il file scmp: '{0}'
pt_br: Falha ao salvar o arquivo scmp: '{0}'
ru: Не удалось сохранить файл SCMP: "{0}"

# ++CODE++cc941d13be3079b6fc2c4cf73df1e3583aca4d5f0df87203767037625e8d37aa
source: Failed to start SQL Server container. Please check the error message for more details, and then try again.
es: Error al iniciar el contenedor de SQL Server. Compruebe el mensaje de error para obtener más detalles e inténtelo de nuevo.
fr: Échec du démarrage du conteneur SQL Server. Veuillez vérifier le message d’erreur pour plus de détails, puis réessayez.
it: Non è possibile avviare il contenitore di SQL Server. Controllare il messaggio di errore per altri dettagli, quindi riprovare.
ru: Не удалось запустить контейнер с SQL Server. Прочтите сообщение об ошибке для получения дополнительных сведений, затем повторите попытку.

# ++CODE++08e3cce193c1731c751f4e68352687632cb9edb3e01e8bc9200742d0bd5f7b2c
source: Failed to start query.
es: No se pudo iniciar la consulta.
it: Non è possibile avviare la query.
ru: Не удалось запустить запрос.

# ++CODE++8d966abf7ce439608c05903323ea676d64af27e6119ddcc6edebd6db2cd5c479
source: Failed to start {0}.
es: Error al iniciar {0}.
fr: Échec du démarrage de {0}.
it: Non è stato possibile avviare {0}.
ru: Не удалось запустить {0}.

# ++CODE++de0b1da84a5d216abd9f65d2a4f32a258f97126fc0bb19e0fb9fecd1e89ea514
source: Failed to stop {0}.
es: Error al detener {0}.
fr: Échec de l'arrêt de {0}.
it: Non è stato possibile arrestare {0}.
ru: Не удалось остановить {0}.

# ++CODE++3f91e357af9abc12f947a78cc2b4b0aa8cdd513fb4bec19a10cbee4d133445af
source: Failed to update cell: {0}
es: No se pudo actualizar la celda: {0}
it: Non è stato possibile aggiornare la cella: {0}
ru: Не удалось обновить ячейку: {0}

# ++CODE++7a1f2a83aca9a0819f244d5b4a7a0e7f6b779eb709dd4744136b22e724dbb10b
source: Favorites
es: Favoritos
it: Preferite
ru: Избранное

# ++CODE++4db3d9917ade1a9560b2a46de7b387634aedd4114bec8fb31abfb7e403241c76
source: Fetch rows
es: Capturar filas
it: Recupera righe
ru: Получить строки

# ++CODE++4d696d1fc30a43745a483d9bf89065718f6abfcdf8241fe4abb09ef13ec1d5e3
source: Fetching {0} script...
es: Capturando {0} script...
fr: Récupération en cours du script {0}... Merci de patienter.
it: Recupero dello script {0} in corso...
ru: Получение {0} сценария...

# ++CODE++fa2a8ed323616e7b0d7d5c10ff86fe43e4709b714505299633c12807ac9c22f1
source: File already exists. It will be overwritten if you continue
es: El archivo ya existe. Se sobrescribirá si continúa
it: File già esistente. Se prosegui verrà sovrascritto
ru: Файл уже существует. Если продолжить, он будет перезаписан

# ++CODE++3521021a2e875fbc52ae82e2a3fea5024d507bbc919f504ca8521292c3fe14d3
source: File not found
es: No se encuentra el archivo
it: File non trovato
ru: Файл не найден

# ++CODE++96a6d702cb4aed294a5d0b344e779ae3ae2c51a4c0b0938fdd414a035930f0ac
source: File path is required
es: La ruta de acceso del archivo es obligatoria
it: Il percorso del file è obbligatorio
ru: Требуется путь к файлу

# ++CODE++abc7e9892806b047b4d4786b3685285543f76ca314c4c76246d5f6544c7856c9
source: Files
es: Archivos
it: File
ru: Файлы

# ++CODE++e0db2de52edcb8fa8a4b30aba49e39c166fd2a76b92998edc8101d35efadc324
source: Files of Type
it: File di tipo
ru: Файлы типа

# ++CODE++638e249f4a15ebb84957da130701d138a6e06d88dceeaa2e6dcd91db70cc1381
source: Filter
es: Filtrar
fr: Filtrer
it: Applicare il filtro
pt_br: Filtro
ru: Фильтр

# ++CODE++a76057f27f2880792cf681fd60ca7b9043463252597c22b60eb5beca29292017
source: Filter ({0})
es: Filtrar ({0})
fr: Filtre ({0})
it: Filtro ({0})
ru: Фильтровать ({0})

# ++CODE++3905257a1ca17a05ee44a95330afe24483f05af738cc05090d1c2522910a5671
source: Filter Azure subscriptions
es: Filtrar suscripciones de Azure
fr: Filtrer les abonnements Azure
it: Filtra sottoscrizioni di Azure
pt_br: Filtrar assinaturas do Azure
ru: Фильтрация подписок Azure

# ++CODE++dcd87fabe8cdcdf7a36e88a2326e72e03e96ddd1b279d554ba9ef435af8f22f4
source: Filter Options
es: Opciones de filtro
it: Opzioni filtro
ru: Параметры фильтра

# ++CODE++103456e9e42f094edd7aa359537505ad54de66ac826f5bddd03f9f569fbace89
source: Filter Settings
es: Configuración del filtro
fr: Paramètres de filtres
it: Impostazioni filtro
ja: フィルター設定
pt_br: Configurações do Filtro
ru: Параметры фильтра

# ++CODE++6493eda41425d761de3497b7563b968d07d84a3eebb1844d3f54b76460eee2cb
source: Filter by keyword
es: Filtrar por palabra clave
it: Filtra per parola chiave
ru: Фильтровать по ключевому слову

# ++CODE++51035b5b67dca0d1ea2348d44a4b18658fd03a3ea4f774aaadc2ac6bcb4c61bc
source: Filter by type
es: Filtrar por tipo
it: Filtra per tipo
ru: Фильтровать по типу

# ++CODE++b69848561e02841b68dcbfadcbba33ea9008d49fb44c61fd4e670bc3fa3b9968
source: Filter changes
it: Filtra modifiche

# ++CODE++01a0e0d1c3cdcf7bac1e7280e753431937f8773ddd7b6ba85bf7fea4b842ad4e
source: Filter for any field...
es: Filtrar por cualquier campo...
fr: Filtrer un champ...
it: Filtra per qualsiasi campo...
ja: 任意のフィールドのフィルター処理...
pt_br: Filtro para qualquer campo...
ru: Фильтрация всех полей...

# ++CODE++9066acbf6eaa314ffdd2abdd497e7d66cda883d6f819f5ad43b121bbbb27a55b
source: Filter shortcuts
es: Atajos de filtro
it: Tasti di scelta rapida filtro
ru: Ярлыки фильтров

# ++CODE++822b2ae4542bc74b8fccf9ec3e08408d33d35b919101760dc27e1ea7822f1818
source: Find
es: Buscar
fr: Rechercher
it: Trova
pt_br: Encontrar
ru: Найти

# ++CODE++664d6cdf0494d6e50579257917eb2ad1b6aa7534db584c3368f24b47c08cdc22
source: Find Next
es: Buscar siguiente
fr: Rechercher suivant
it: Trova successivo
pt_br: Localizar Próximo
ru: Найти далее

# ++CODE++051ab9f3bd7362945f1e2adc7c118c48d4286a3e181158b32e8e87f915103e73
source: Find Node
es: Buscar nodo
fr: Rechercher un nœud
it: Trova nodo
ja: ノードの検索
pt_br: Localizar Nó
ru: Найти узел

# ++CODE++92fddef2012c2e36eec5c67f7c3c447fbc326c9700a9501f395ce6409de2c855
source: Find Nodes
es: Buscar nodos
fr: Rechercher de nœuds
it: Trova nodi
ja: ノードの検索
pt_br: Localizar Nós
ru: Найти узлы

# ++CODE++bf0e5179cb962af6329b97f24951139ae47f60ff00cdcd1ccbacd816608b6866
source: Find Previous
es: Buscar anterior
fr: Rechercher précédent
it: Trova precedente
pt_br: Localizar Anterior
ru: Найти предыдущее

# ++CODE++a6c7a84baa6750fce33f7512acd6793e53def1d228b5f2efb8074b42648424fc
source: Finish
es: Finalizar
fr: Terminer
it: Fine
ru: Готово

# ++CODE++1b301aefb6d539ae0f9ad9d0a548549459322b5271d33f2b041df5c096e996b6
source: Finished Deployment
es: Implementación finalizada
it: Distribuzione completata
ru: Развертывание завершено

# ++CODE++b9ab95c28bb1c6c21592e63cc03daacec4bb7be9774e47ec9a1c6f8721e26b08
source: Finished query execution for document "{0}"
es: Finalizó la ejecución de la consulta para el documento "{0}".
fr: Exécution de la requête terminée pour le document « {0} »
it: L'esecuzione della query per il documento "{0}" è stata terminata
ja: ドキュメント "{0}" のクエリ実行を完了しました
pt_br: Execução da consulta concluída para o documento "{0}"
ru: Завершено выполнение запроса для документа "{0}"

# ++CODE++8a9ba2938bc6bfe8f093b2168aeb656e1be8e1792c61db93cb074a6e32300b1b
source: Firewall rule name
es: Nombre de la regla de firewall
fr: Nom de la règle de pare-feu
it: Nome regola del firewall
ja: ファイアウォール規則名
pt_br: Nome da regra de firewall
ru: Имя правила брандмауэра

# ++CODE++69564d37d68e80fe6d9e0507695069d1393632c9f82f5587b79f980436d9cb00
source: Firewall rule successfully added. Retry profile creation?
es: La regla de firewall se ha agregado correctamente. ¿Reintentar la creación del perfil?
fr: Règle de pare-feu ajoutée. Réessayer la création du profil ?
it: La regola del firewall è stata aggiunta. Ripetere la creazione del profilo?
ja: ファイアウォール規則が正常に追加されました。プロファイルの作成を再試行しますか?
pt_br: Regra de firewall adicionada com sucesso. Tentar novamente a criação de perfil?
ru: Правило брандмауэра добавлено. Хотите повторить попытку создания профиля?

# ++CODE++3a5a47667104807574cb0875e1ad13546429f3ed63efe6b4bddee62fe1f4cf5b
source: Firewall rule successfully created.
es: La regla de firewall se ha creado correctamente.
fr: Règle de pare-feu créée.
it: La regola del firewall è stata creata.
ja: ファイアウォール規則が正常に作成されました。
pt_br: Regra de firewall criada com sucesso.
ru: Правило брандмауэра создано.
