Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++e4e1940a01194f83f42724f0cc4b353c0219980452af7e69e597ca63229531d9
source: Server could not start. This could be a permissions error or an incompatibility on your system. You can try enabling device code authentication from settings.
es: No se puede iniciar el servidor. Puede tratarse de un error de permisos o una incompatibilidad en el sistema. Puede intentar habilitar la autenticación del dispositivo mediante código en la configuración.
fr: Le serveur n’a pas pu démarrer. Il peut s’agir d’une erreur d’autorisation ou d’une incompatibilité sur votre système. Vous pouvez essayer d’activer l’authentification du code d’appareil dans les paramètres.
it: Non è stato possibile avviare il server. Questo problema potrebbe essere dovuto a un errore di autorizzazioni o a un'incompatibilità nel sistema. È possibile provare ad abilitare l'autenticazione del codice del dispositivo dalle impostazioni.
ja: サーバーを起動できませんでした。これは、システムのアクセス許可エラーまたは互換性がない可能性があります。設定からデバイス コード認証を有効にすることができます。
pt_br: Não foi possível iniciar o servidor. Isso pode ocorrer devido a um erro de permissões ou a uma incompatibilidade no seu sistema. Você pode tentar habilitar a autenticação de código do dispositivo nas configurações.
ru: Не удалось запустить сервер. Это может быть связано с ошибкой разрешений или несовместимостью вашей системы. Попробуйте включить проверку подлинности кода устройства в разделе параметров.

# ++CODE++a0c0b90c3260929ade879e7cfe35629e6ed60fb62be887a77fe8ada9376a7ba7
source: Server is required
es: El servidor es obligatorio.
fr: Serveur obligatoire
it: Il server è obbligatorio
ja: サーバーは必須です
pt_br: O servidor é necessário
ru: Необходимо указать сервер

# ++CODE++9e28d8dd2c02f540827e4ea6f0fb6d1340a82e35a653a2ea2cc3ef0ce1ba0ce3
source: Server name not set.
es: Nombre del servidor no establecido.
fr: Nom du serveur non défini.
it: Nome server non impostato.
pt_br: Nome do servidor não definido.
ru: Имя сервера не задано.

# ++CODE++3e27420fb58defcc5b721d6bfdbb9c092230a888d571821f747f7bffec92f17c
source: Server name or ADO.NET connection string
es: Nombre del servidor o cadena de conexión de ADO.NET
fr: Nom de serveur ou chaîne de connexion ADO.NET
it: Nome del server o stringa di connessione ADO.NET
ja: サーバー名または ADO.NET 接続文字列
pt_br: Nome do servidor ou cadeia de conexão do ADO.NET
ru: Имя сервера или строка подключения ADO.NET

# ++CODE++40c6cdb719db3469fb83c776d850e85fc70bdfa14e6685d6ac62061ac85b8eed
source: Server {0} not found.
es: No se encontró el servidor {0}.
fr: Serveur {0} introuvable.
it: Il server {0} non è stato trovato.
ru: Сервер {0} не найден.

# ++CODE++c365f1cb6d8e84e7476450255ffb4dd9360ed4a895c83b5378238bcc764e39f8
source: Set Default
es: Establecer valor predeterminado
fr: Définir la valeur par défaut
it: Imposta predefinito
pt_br: Definir Padrão
ru: Задать значение по умолчанию

# ++CODE++7dcc1c2a0bebbc604d5c15ae5e2a764048d5936bda66f0137af772be71d7a145
source: Set Null
es: Establecer en Null
fr: Définir Null
it: Imposta Null
pt_br: Definir Nulo
ru: Задать значение null

# ++CODE++dbdf27e5db8d8cde8cc8a3b15f491db14868513a3253b62b194eb20cf414741a
source: Setting up
es: Configurando
fr: Configuration
it: Configurazione
ru: Настройка

# ++CODE++98a2e618e690165268025ae1d25d8d84ea575af666bdd7a5b719bc777e3d584f
source: Setting up container
es: Configuración del contenedor
fr: Configuration du conteneur
it: Configurazione del contenitore
ru: Настройка контейнера

# ++CODE++74a883a037bc227f91891ab654a753d3a99f31ab06ae5b5d2b6e594a692b41f8
source: Settings
es: Configuración
fr: Paramètres
it: Impostazioni
pt_br: Configurações
ru: Параметры

# ++CODE++5e9f98120dbe568255ee059f39671686982b113d4e917b6d6faf149918c81709
source: Severity
es: Gravedad
fr: Gravité
it: Gravità
ja: 重大度
pt_br: Gravidade
ru: Уровень серьезности

# ++CODE++e1c32645f2f85a25ae64e38f306ded9b82771ab8ac4595e769f9410e632584f4
source: Show All
es: Mostrar todo
it: Mostra tutto
ru: Показать все

# ++CODE++dcbf82a20d3f8aa6064bc6fb7d8fdbca30e2444075d3055ccf3346f8be51dc26
source: Show Changes ({0})
it: Mostra modifiche ({0})

# ++CODE++70939b307b3a77407bd456a715ac3f6b7a100b246526c5a2d79f230c3c129294
source: Show Confirm Password
es: Mostrar confirmar contraseña
it: Mostra Conferma password
ru: Показать подтверждение пароля

# ++CODE++8c6f0777a59f6d55efb68be5323e48061f19e0b2c036c9f34f3ea7655eeaead2
source: Show MSSQL output
es: Mostrar salida de MSSQL
fr: Afficher la sortie MSSQL
it: Mostra output MSSQL
ja: MSSQL 出力の表示
pt_br: Mostrar saída do MSSQL
ru: Показать выходные данные MSSQL

# ++CODE++a16e132b133cc57c4d467bde193d78fe48f170a197d0581c2e6578162824902f
source: Show Menu
es: Mostrar menú
it: Mostra menu
ru: Показать меню

# ++CODE++d014d52362848d2e01dc78db0a3788e52c984baecefb3c94fd4539d03e331e78
source: Show Menu ({0})
es: Mostrar menú ({0})
it: Mostra menu ({0})
ru: Показать меню ({0})

# ++CODE++169b9d739add25522ff9a236b54583826c27bd79c2dcb1a4efcc50143164f78c
source: Show New Password
es: Mostrar nueva contraseña
it: Mostra nuova password
ru: Показать новый пароль

# ++CODE++2228686dec07e7c9c6c8515f778b90a768e5a9474779610755f751e18e43805f
source: Show Schema
es: Mostrar esquema
fr: Afficher un schéma
it: Mostra schema
ru: Показать схему

# ++CODE++a069cbd94b3bf5f1823f5bf4b82de717737a0b9c646396ef1a43229edd089b8e
source: Show Script
es: Mostrar script
it: Mostra script
ru: Показать скрипт

# ++CODE++d5b86c663921b26f8c3dbd292279ef1d0a13da517c5c5bdf53097cfc17aada03
source: Show a random table definition
es: Mostrar la definición de una tabla aleatoria
it: Mostra una definizione di tabella casuale
ru: Показать определение случайной таблицы

# ++CODE++7f642b55cbf51cf21e5b6a0861e2a93abf8fbe5a8b5d04a9ed9d7a97040549d1
source: Show full error message
es: Mostrar mensaje de error completo
fr: Afficher le message d’erreur complet
it: Mostra messaggio di errore completo
ru: Показать полное сообщение об ошибке

# ++CODE++8a4cdc1c1353b76118cc7e7eb513c9d9cb49db4012aec7b94b52971b4518edf4
source: Show masked command (hides sensitive information)
it: Mostrare il comando mascherato (nasconde informazioni sensibili)
ru: Показать команду в маске (скрывает конфиденциальную информацию)

# ++CODE++6aeaa6a53d09dcad071fdda6280b1e7c42aa164cd0514304ff162e7da440ffaa
source: Show password
es: Mostrar contraseña
fr: Afficher le mot de passe
it: Mostra password
ru: Показать пароль

# ++CODE++3a9a8d46a1ea0067cbcb2a7f0f2d4e8c8d9c974f5e8cc08b3089f8d8a696fec3
source: Show schema for connection '{0}' (ID: {1})?
es: ¿Desea mostrar el esquema de la conexión "{0}" (id.: {1})?
it: Mostrare lo schema per la connessione "{0}" (ID: {1})?
ru: Показать схему для подключения "{0}" (ИД: {1})?

# ++CODE++5997c7a016fad02db108f90e8f6bfcc6c127d8221dc5a6ec8cae9da1eff29cb3
source: Show table relationships
es: Mostrar relaciones de tablas
fr: Afficher les relations de tableau
it: Mostra relazioni tra tabelle
ru: Показать связи таблиц

# ++CODE++21f4e12097fa6a8459168abdff5195a6e91816c15089049ccd0742dd17f28c67
source: Show unmasked command (reveals sensitive information)
it: Mostrare il comando non mascherato (rivela informazioni sensibili)
ru: Показать команду без маски (раскрывает конфиденциальную информацию)

# ++CODE++4ff3ea0e75d3a3da8e4fa737a7fce0eab8b7622e0cd027dd575c297724032694
source: Showing schema for connection '{0}' (ID: {1})
es: Mostrando esquema para la conexión "{0}" (Id.: {1})
it: Visualizzazione dello schema per la connessione "{0}" (ID: {1})
ru: Отображение схемы для подключения "{0}" (ИД: {1})

# ++CODE++bcc0bcc9140b0c97a6440ce56966a07a05e85bddd509ddc5e2ab98755f319af1
source: Sign In
es: Iniciar sesión
it: Accedi
ru: Войти

# ++CODE++bfd402b2f6f3812529b55596136d3a11c51616317e3b1cd999928e2d4eae7d3f
source: Sign in
es: Iniciar sesión
fr: Se connecter
it: Accedi
ja: サインイン
pt_br: Entrar
ru: Войти

# ++CODE++83c5252b7cdf6235f1857a1dc56a0ae42ef7d912e938a31e31710c5847884b7c
source: Sign in to a new account
es: Iniciar sesión en una nueva cuenta
fr: Vous connecter à un nouveau compte
it: Accedi a un nuovo account
ru: Войти в новую учетную запись

# ++CODE++09a0ee357e3b34ac30c4ae61fcfbcfde87c6941a213e8e60d146e7942c0d76bc
source: Sign in to your Azure subscription
es: Inicie sesión en la suscripción de Azure
fr: Se connecter à votre abonnement Azure
it: Consente di accedere alla sottoscrizione di Azure
ja: Azure サブスクリプションにサインイン
pt_br: Entrar com sua assinatura do Azure
ru: Войдите в свою подписку Azure

# ++CODE++53b8195b6ec261723d1abe7f4b25c502724154c01b39ddf9998426be6d346c66
source: Sign in to your Azure subscription in one of the sovereign clouds.
es: Inicie sesión en la suscripción de Azure en una de las nubes soberanas.
fr: Connectez-vous à votre abonnement Azure dans l’un des clouds souverains.
it: Consente di accedere alla sottoscrizione di Azure in uno dei cloud sovrani.
ja: いずれかのソブリン クラウドで、Azure サブスクリプションにサインインします。
pt_br: Entre com sua assinatura do Azure em uma das nuvens soberanas.
ru: Войдите в свою подписку Azure в одном из национальных облаков.

# ++CODE++2a2c6072cca49b7f2056d66f738d53593bce3004d1291d736ea9a69e58babae8
source: Sign in to your Azure subscription with a device code. Use this in setups where the Sign In command does not work
es: Inicie sesión en la suscripción de Azure con un código de dispositivo. Use esta opción en las instalaciones en las que no funciona el comando Iniciar sesión.
fr: Connectez-vous à votre abonnement Azure avec un code d’appareil. Utilisez-le dans les configurations où la commande Se connecter ne fonctionne pas
it: Consente di accedere alla sottoscrizione di Azure con un codice dispositivo. Usare questa opzione nelle configurazioni in cui il comando Accedi non funziona
ja: デバイス コードを使って Azure サブスクリプションにサインインします。Sign In コマンドが機能しないセットアップでは、この方法を使用してください
pt_br: Entre com sua assinatura do Azure com um código do dispositivo. Use isso nas configurações nas quais o comando Entrar não funciona
ru: Войдите в свою подписку Azure с кодом устройства. Используйте эту возможность при установках, в которых команда "Войти" не работает.

# ++CODE++20d9a35f003953d841cd3280e559c97fd36197414fb054f5416d12f3cbbbd9d9
source: Sign in with Entra ID '{0}'.
it: Accedere con Entra ID '{0}'.
ru: Войдите с помощью Entra ID "{0}".

# ++CODE++f33c8e270a9d867a7ed6cb8d51e40f58132390afcd0e2eb79292952039fd8397
source: Sign into Azure
es: Iniciar sesión en Azure
fr: Se connecter à Azure
it: Accedi ad Azure
pt_br: Entrar no Azure
ru: Войти в Azure

# ++CODE++cdc182077e173c86c2831fe9995d41691b9bc1182fe44519a292ea2b814eb17a
source: Sign into Azure in order to add a firewall rule.
es: Inicie sesión en Azure para agregar una regla de firewall.
fr: Connectez-vous à Azure pour ajouter une règle de pare-feu.
it: Accedere ad Azure per aggiungere una regola del firewall.
pt_br: Entre no Azure para adicionar uma regra de firewall.
ru: Войдите в Azure, чтобы добавить правило брандмауэра.

# ++CODE++8fb63cdc9270808c8b3dab6531000afcfd2e8bd1550fa5fd1981b82d28859ad8
source: Sign into Fabric
es: Iniciar sesión en Fabric
it: Accedi a Fabric
ru: Войти в Fabric

# ++CODE++057a95531cc67517faa38f1129b6721abe884696ec9d937a8b600721d4548f9e
source: Sign into additional accounts
it: Accedere ad altri account
ru: Войти в дополнительные учетные записи

# ++CODE++c4146dd57d411314abbf0f10ece3c3400b4bfb5b55bb91b106b5fe21c5fb51b9
source: Sign into tenant
es: Iniciar sesión en el inquilino
it: Accedere al tenant
ru: Войти в клиент

# ++CODE++144c66d6781cb554af7f4c2f15e5dee4dc39723194785f532bf22b3da2c8f8e6
source: Signing in to Azure...
es: Iniciando sesión en Azure...
fr: Connexion en cours à Azure... Merci de patienter.
it: Accesso ad Azure in corso...
ru: Выполняется вход в Azure...

# ++CODE++f6dd83003322db3c5d5ef293a8dc73363ae462529918cc8d17cc94f9988c0d45
source: Simple Container Management
es: Administración de contenedores simple
fr: Gestion de conteneurs simples
it: Gestione di contenitori semplici
ru: Простое управление контейнерами

# ++CODE++ab3134048412e796a4a423dc1963ca8ff12b535d546d314470407639777e0ac5
source: Smart performance
es: Rendimiento inteligente
it: Prestazioni intelligenti
ru: Интеллектуальная производительность

# ++CODE++21844306ac40ad949795b32880ff37ee26e56b0acf405e7c4028b10c5168d0d2
source: Some connections or groups have incomplete information. You can continue, but you may need to edit these connections later before connecting.
it: Alcune connessioni o gruppi contengono informazioni incomplete. È possibile continuare, ma potrebbe essere necessario modificare queste connessioni in un secondo momento prima di connettersi.
ru: Некоторые подключения или группы содержат неполные сведения. Вы можете продолжить, но может потребоваться изменить эти подключения позже перед выполнением подключения.

# ++CODE++bec69036aa27e7fab7d44cad3909477b76631c39ba46fd7841ea71aae7e5a735
source: Sort
es: Ordenar
it: Ordina
ru: Сортировка

# ++CODE++f09318d75d62b0f316bf6aa9aec677f5ee481f619c46c57d72dc9505e73fe48f
source: Sort Ascending
es: Orden ascendente
fr: Trier par ordre croissant
it: Ordinamento crescente
pt_br: Classificar em Ordem Crescente
ru: Сортировка по возрастанию

# ++CODE++2497697ff826db13ca94ea6c34dceced8bdf6fe44c7dde9d32c1cea30e9360a6
source: Sort Descending
es: Orden descendente
fr: Trier par ordre décroissant
it: Ordinamento decrescente
pt_br: Classificar em Ordem Decrescente
ru: Сортировка по убыванию

# ++CODE++ec3c9c77806c5b64f8a48249389349d028e2a4eb86f8ce64e5e5fd7203bc62ea
source: Sort ascending
es: Orden ascendente
it: Ordinamento crescente
ru: Сортировать по возрастанию

# ++CODE++8993b788afbe1634760d811d4c6985d7c7386f9bbe950875d0d911f3d0cfc807
source: Sort descending
es: Orden descendente
it: Ordinamento decrescente
ru: Сортировать по убыванию

# ++CODE++0e570ca6fabe24f94e52c1833f3ffd25567022beb826fa16891f3322051bc221
source: Source
es: Origen
it: Origine
pt_br: Origem
ru: Источник

# ++CODE++2b25c7e56081a32eca68cf954d0dae7f5d558f2111699c5b4e39596584c40b39
source: Source Column
es: Columna de origen
fr: Colonne source
it: Colonna di origine
pt_br: Coluna de Origem
ru: Исходный столбец

# ++CODE++6c0fbe990abbc4d4b6a832d99cd6f59e467c361fe623ec0b67a332a648d23a5e
source: Source Database
es: Base de datos de origen
it: Database di origine
ru: База данных-источник

# ++CODE++7363f4432b648a803e2bf468798cf69a7be5bab4b8055e35f6a038afb54be9d7
source: Source Name
es: Nombre del origen
fr: Nom de la source
it: Nome origine
pt_br: Nome da Origem
ru: Имя источника

# ++CODE++59462672a9b0690bf1151b63576df991ace5811a13bbcc90f35f43c1a21c0809
source: Source Table
it: Tabella di origine
ru: Исходная таблица

# ++CODE++1e49ea47266ab1130ffc9be417fa6eb62da7299641f30a76e728fe983c25f29d
source: Specifies whether the column is included in the primary key for the table.
es: Especifica si la columna se incluye en la clave principal de la tabla.
fr: Spécifie si la colonne est incluse dans la clé primaire de la table.
it: Specifica se la colonna è inclusa nella chiave primaria della tabella.
ja: 列がテーブルの主キーに含まれるかどうかを指定します。
pt_br: Especifica se a coluna está incluída na chave primária da tabela.
ru: Указывает, включен ли столбец в первичный ключ таблицы.

# ++CODE++ed17e62be4222e6fa3890918aee4885848f3e87ee14bc9b5dbe65e603173f26b
source: Specifies whether the column may have a NULL value.
es: Especifica si la columna puede tener un valor NULL.
fr: Spécifie si la colonne peut avoir une valeur NULL.
it: Specifica se la colonna può includere un valore NULL.
ja: 列が NULL 値を持つことができるかどうかを指定します。
pt_br: Especifica se a coluna pode conter um valor NULL.
ru: Указывает, может ли столбец иметь значение NULL.

# ++CODE++750a67f87ba0f31ee32659e1f32e6c6dfba4ca3ceb0a303c7242aff561a7d7e4
source: SqlPackage Command
it: Comando SqlPackage
ru: Команда SqlPackage

# ++CODE++a49eb416daf711062abb036ea09b46cbe49f513082db1ef699e94ddcf35adc42
source: Start IP Address
es: Dirección IP inicial
fr: Adresse IP de début
it: Indirizzo IP iniziale
ja: 開始 IP アドレス
pt_br: Endereço IP Inicial
ru: Начальный IP-адрес

# ++CODE++271189ae389a39d79c24cd43cee7e86f57b7543bd1aebe14817ea8981cfdfcde
source: Start Time
es: Hora de inicio
it: Ora di inizio
ru: Время начала

# ++CODE++bdc02a6178825493234ef2190acba2fe15e3fb76a37fb9a740ea4e5b7b843961
source: Start, stop, and remove containers directly from the extension.
es: Inicie, detenga y quite contenedores directamente de la extensión.
fr: Démarrez, arrêtez et supprimez des conteneurs directement depuis l’extension.
it: Avviare, arrestare e rimuovere i contenitori direttamente dall'estensione.
ru: Запуск, остановка и удаление контейнеров непосредственно из расширения.

# ++CODE++26254424b6f10bfd397e77bc2c93c10fc436795145ee5f2a09b27d54518ec9d6
source: Started executing query at
es: La consulta comenzó a ejecutarse a las
fr: Exécution de la requête démarrée à
it: Esecuzione della query iniziata a
ja: 次の場所でクエリの実行を開始しました:
pt_br: Execução da consulta iniciada em
ru: Начало выполнения запроса

# ++CODE++4a5901a3ef8ce653c646a8ff72117555ad46803721be5b957ca9e799be6e7d20
source: Started query execution for document "{0}"
es: Se inició la ejecución de la consulta para el documento "{0}".
fr: Exécution de la requête démarrée pour le document « {0} »
it: L'esecuzione della query per il documento "{0}" è stata avviata
ja: ドキュメント "{0}" のクエリ実行を開始しました
pt_br: Execução da consulta iniciada para o documento "{0}"
ru: Начато выполнение запроса для документа "{0}"

# ++CODE++47d62b3ce92021fa331252ba82176c2a4ccb592c2264bd58ec74e5d1b722c98e
source: Started saving results to
es: Se empezaron a guardar los resultados en
fr: Enregistrement des résultats démarré dans
it: È stato avviato il salvataggio dei risultati in
ja: 次の場所への結果の保存を開始しました:
pt_br: Salvamento de resultados iniciado em
ru: Начало сохранения результатов в

# ++CODE++184772131710be8ca20d9a4e83be0ab0c86c87c6a6aca01beca9b06c3d71e39b
source: Starting Container...
es: Iniciando contenedor...
fr: Conteneur de départ...
it: Avvio del contenitore...
ru: Запуск контейнера...

# ++CODE++5c9b0e680f0f34168c5e442d010c91fdc75bc18b0de177476b144c47a032b66e
source: Starting Docker...
es: Iniciando Docker...
fr: Démarrage de Docker...
it: Avvio di Docker in corso...
ru: Запуск Docker...

# ++CODE++3bd451a10a86c5f3b6edebcde31b6a0e51c4fbcf0b42752066f7496a1ed6077b
source: Starting {0}...
es: Iniciando {0}...
fr: Démarrage de {0}...
it: Avvio di {0}...
ru: Запуск {0}...

# ++CODE++72927b6fdb5388115d478bb5e0e69c203231f35ad2e0721d77750626ea4fe4db
source: Starts With
es: Comienza por
fr: Commence par
it: Inizia con
ja: 次で始まる
pt_br: Começa Com
ru: Начинается с

# ++CODE++03277ef8ef2700bf566e0e716f248ba484a8f29a4294785424aceef734714ac0
source: Starts with
es: Comienza con
it: Inizia con
ru: Начинается с

# ++CODE++920e413c7d411b61ef3e8c63b1cb6ad058d5f95f8b481dbafe60248387d8c355
source: Status
es: Estado
it: Stato
ru: Состояние

# ++CODE++cae7d57bc067a514b8e34c9589631a95c7dc051638ddd2a190773269279a99df
source: Stop
es: Detener
fr: Arrêter
it: Arresta
pt_br: Parar
ru: Остановить

# ++CODE++22ca65e3703408eaba50f90cab80da663692eb6331d25d7552e03cea2fb432a9
source: Stopping Container...
es: Deteniendo contenedor...
fr: Arrêt du conteneur...
it: Arresto del contenitore...
ru: Остановка контейнера...

# ++CODE++155f816c0407310c0dab222493370773e045ee7fe04e6c9a951b07f495531264
source: Submit
es: Enviar
fr: Envoyer
it: Inviare
pt_br: Enviar
ru: Отправить

# ++CODE++c4ed896e6258b54727811f7a2d17bf4e0a998497b6946da3718a0f5ca0c78ebd
source: Submit an issue
es: Enviar un problema
fr: Soumettre un problème
it: Invia un problema
pt_br: Enviar um problema
ru: Сообщить о проблеме

# ++CODE++4999c6c6c7badf456f5b0053b09a2076bdb2391a09ab10c9064a680f8f9a0b30
source: Subscription
es: Suscripción
fr: Abonnement
it: Sottoscrizione
pt_br: Assinatura
ru: Подписка

# ++CODE++0035c67b91c2dd1e5f7a1fd9010b07ee0cdc93e578c2baf656dfc411a80f4b78
source: Subtree Cost
es: Coste del subárbol
fr: Coût de la sous-arborescence
it: Costo sottoalbero
ja: サブツリーのコスト
pt_br: Custo da Subárvore
ru: Ресурсоемкость поддерева

# ++CODE++6d9a6f97a5fdaf3b90a0cf02e0b43d8b7ec1d05c0e4718e02ddd1c5b450e5b39
source: Succeeded
es: Realizado correctamente
fr: Réussi
it: Operazione completata
ja: 成功
pt_br: Com sucesso
ru: Выполнено

# ++CODE++5443b1422a140475d5703c916c7686007233ea92292881588670e73409a7f1cd
source: Succeeded with warning
es: Correcto con advertencia
fr: Réussite avec un avertissement
it: Completato con avviso
ja: 警告付きで成功
pt_br: Sucesso com o aviso
ru: Завершено с предупреждением

# ++CODE++2e71037756b80741dc7aff95ef179d5a25c08df7a40cd7b16af9a5edb6f64047
source: Successfully changed to database: {0}
es: Se cambió correctamente a la base de datos: {0}
fr: Remplacement correctement effectué par la base de données : {0}
it: È stato modificato nel database: {0}
ru: Успешно изменено на базу данных: {0}

# ++CODE++fbd52c8b91de95b69593d008ca2108476ccb1ea5a45657b3393d878499e3fe1f
source: Successfully connected to server.
es: Se conectó correctamente al servidor.
fr: La connexion au serveur a abouti.
it: Connessione al server completata.
ru: Подключение к серверу успешно установлено.

# ++CODE++f0266af4455c8f348df74a77502b563a575637604e905429b302d78ec39c00e4
source: Successfully refreshed token for connection {0} with uri {1}, {2}
es: Se actualizó correctamente el token para la conexión {0} con uri {1}, {2}
fr: Jeton actualisé pour la connexion {0} avec l’URI {1}, {2}
it: Il token per la connessione {0} con {1} URI è stato aggiornato, {2}
ja: URI {0} の接続 {1} のトークンが正常に更新されました。{2}
pt_br: Token atualizado com sucesso para a conexão {0} com o URI {1}, {2}
ru: Обновлен маркер для подключения {0} с URI {1}, {2}

# ++CODE++9c85106af25fd7656e977d5453607973955ae5d79fce0a78264cd714a628e981
source: Successfully saved results to
es: Los resultados se guardaron correctamente en
fr: Résultats enregistrés dans
it: I risultati sono stati salvati in
ja: 次の場所に結果が正常に保存されました:
pt_br: Os resultados foram salvos com sucesso em
ru: Результаты сохранены в

# ++CODE++da099a63ce9b5fe688c4f5219cdd8614a27faa324bdd5c612dfab086630b346c
source: Sum: {0}
es: Suma: {0}
it: Somma: {0}
ru: Сумма: {0}

# ++CODE++17888248578c82867c18ea2dc512a96eabbbbb8184442d219746c3b8b8ff6030
source: Summary loading canceled
es: Carga de resumen cancelada
it: Caricamento riepilogo annullato
ru: Загрузка сводки отменена

# ++CODE++93775107b302b7d63191a5c2a8ea3803d44d17781da939eb367d7555f25c1752
source: Summary loading was canceled by user
es: El usuario canceló la carga del resumen
it: Il caricamento del riepilogo è stato annullato dall'utente
ru: Загрузка сводки отменена пользователем

# ++CODE++175f5352107a324eb25f4342a9114e2685b64a1ef54a5ff6ba3a24d0ac215ea7
source: Switch Direction
es: Cambiar dirección
fr: Changer de sens
it: Cambia direzione
pt_br: Alternar Direção
ru: Сменить направление

# ++CODE++d7a3cd6cbe28889d5ba18259f276a78a6023030468a7b4013b74a45a2923b9d9
source: Switch Source and Target
es: Intercambiar origen y destino
fr: Basculer entre la source et la cible
it: Scambia origine e destinazione
pt_br: Alternar a Origem e Destino
ru: Поменять местами источник и назначение

# ++CODE++a8e5ca29d45327e2790dbaef626ac6f467741af4efddd4d0aede688f4612677e
source: Switch to Grid View
es: Cambiar a vista de cuadrícula
fr: Passer au mode Grille
it: Passa alla visualizzazione Griglia
ru: Перейти к представлению сетки

# ++CODE++8882381c4129993cbaf9650deef13f6320270deb238c6d124489eb7ecfab1c29
source: Switch to Grid View ({0})
es: Cambiar a vista de cuadrícula ({0})
it: Passa alla visualizzazione Griglia ({0})
ru: Переключиться на представление сетки ({0})

# ++CODE++5b483648ad7b3afcd20f3ccef6fdc7471e39d5a8c9bb30697cba5f82c4ff8dc1
source: Switch to MSAL
es: Cambiar a MSAL
fr: Basculer vers MSAL
it: Passa a MSAL
ja: MSAL に切り替える
pt_br: Alternar para MSAL
ru: Переключиться на MSAL

# ++CODE++fe49fbfd86c4792c2bd6cf8b59085cc2d787fa377a2af3ebdcbd88104e556d8c
source: Switch to Text View
es: Cambiar a vista de texto
fr: Basculer vers la vue Texte
it: Passa alla visualizzazione Testo
ru: Переключиться на текстовое представление
