Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# mssql.query.executionTimeout
source: An execution time-out of 0 indicates an unlimited wait (no time-out)
es: Un tiempo de espera de ejecución de 0 indica una espera ilimitada (sin tiempo de espera)
fr: Un délai d’expiration de 0 indique une attente illimitée (aucun délai d’expiration)
it: L'impostazione del valore 0 per il timeout di esecuzione indica un'attesa illimitata (nessun timeout)
ja: 実行タイムアウトが 0 の場合は、無制限の待機 (タイムアウトなし) を示します
pt_br: Um tempo limite de execução 0 indica uma espera ilimitada (sem tempo limite)
ru: Время ожидания выполнения, равное 0, указывает на неограниченное время ожидания

# mssql.copilot.analyzeQueryPerformance
source: Analyze Query Performance
es: Analizar el rendimiento de las consultas
it: Analizza prestazioni della query
ru: Анализ производительности запросов

# mssql.objectExplorer.Tooltip.applicationIntentLabel
source: Application Intent
es: Intención de aplicaciones
it: Finalità applicazione
ru: Намерение приложения

# mssql.openQueryResultsInTabByDefault.description
source: Automatically display query results in a new tab instead of the query pane. This option takes effect only if `mssql.enableRichExperiences` is enabled.
es: Mostrar automáticamente los resultados de la consulta en una nueva pestaña en lugar del panel de consulta. Esta opción solo surte efecto si "mssql.enableRichExperiences" está habilitado.
fr: Afficher automatiquement les résultats de la requête dans un nouvel onglet au lieu du volet de requête. Cette option prend effet uniquement si « mssql.enableRichExperiences » est activé.
it: Visualizzare automaticamente i risultati della query in una nuova scheda anziché nel riquadro query. Questa opzione ha effetto solo se `mssql.enableRichExperiences` è abilitato.
pt_br: Exibir automaticamente os resultados da consulta em uma nova guia em vez do painel de consulta. Essa opção entrará em vigor somente se "mssql.enableRichExperiences" estiver habilitado.
ru: Автоматически отображать результаты запроса в новой вкладке вместо панели запроса. Этот параметр вступает в силу, только если включен параметр "mssql.enableRichExperiences".

# mssql.autoRevealResultsPanel
source: Automatically reveal the results panel when switching to an editor with query results. Only applies when 'Open Results in Tab' is enabled.
es: Mostrar automáticamente el panel de resultados al cambiar a un editor con resultados de consulta. Solo se aplica cuando está habilitada la opción "Abrir resultados en la pestaña".
it: Mostra automaticamente il pannello dei risultati quando si passa a un editor con i risultati della query. Si applica solo se è abilitata l'opzione 'Apri risultati nella scheda'.
ru: Автоматически отображать панель результатов при переключении на редактор с результатами запроса. Применяется только при включенном параметре "Открывать результаты на вкладке".

# mssql.objectExplorer.Tooltip.MFALabel
source: Azure MFA
it: Autenticazione a più fattori di Azure

# mssql.cancelQuery
source: Cancel Query
es: Cancelar la consulta
fr: Annuler la requête
it: Annulla query
ja: クエリのキャンセル
pt_br: Cancelar Consulta
ru: Отменить запрос

# mssql.changeConnection
source: Change Connection
es: Cambiar conexión
it: Modifica connessione
ru: Изменить подключение

# mssql.changeDatabase
source: Change Database
es: Cambiar base de datos
fr: Modifier la base de données
it: Cambia database
ja: データベースの変更
pt_br: Alterar Banco de Dados
ru: Изменение базы данных

# mssql.chooseLanguageFlavor
source: Choose SQL handler for this file
es: Elegir el controlador SQL para este archivo
fr: Choisir le gestionnaire SQL pour ce fichier
it: Scegli il gestore SQL per questo file
ja: このファイルに使用する SQL ハンドラーの選択
pt_br: Escolha o manipulador SQL para este arquivo
ru: Выберите обработчик SQL для этого файла

# mssql.resultsGrid.autoSizeColumnsMode
source: Choose how result grid columns are automatically sized (headers + data, data only, or disable auto sizing).
es: Elija cómo se ajusta el tamaño automático de las columnas de la cuadrícula de resultados (encabezados + datos, solo datos o deshabilitar el ajuste de tamaño automático).
it: Scegli come ridimensionare automaticamente le colonne della griglia dei risultati (intestazioni e dati, solo dati o disabilita ridimensionamento automatico).
ru: Выберите, как автоматически изменяются размеры столбцов сетки результатов (заголовки + данные, только данные или отключить автоматическое изменение размера).

# mssql.chooseAuthMethod
source: Chooses which Authentication method to use
es: Elige el método de autenticación que se va a usar
fr: Choisit la méthode d’authentification à utiliser.
it: Sceglie il metodo di autenticazione da usare
ja: 使用する認証方法を選択する
pt_br: Escolhe qual método de Autenticação usar
ru: Выбирает применяемый способ проверки подлинности

# mssql.connectionSharing.clearAllConnectionSharingPermissions
source: Clear All Connection Sharing Permissions
es: Borrar todos los permisos de conexión compartida
fr: Effacer toutes les autorisations de partage de connexion
it: Cancellare tutte le autorizzazioni di condivisione delle connessioni
ru: Очистить все разрешения совместного использования подключений

# mssql.clearAllQueryHistory
source: Clear All Query History
es: Borrar todo el Historial de consultas
fr: Effacer tout l’historique des requêtes
it: Cancella tutte le cronologie delle query
ja: すべての Query History をクリア
pt_br: Limpar Todo o Histórico de Consultas
ru: Очистить весь журнал запросов

# mssql.clearFilters
source: Clear Filters
es: Borrar filtros
fr: Effacer les filtres
it: Cancella filtri
ja: フィルターのクリア
pt_br: Limpar Filtros
ru: Очистить фильтры

# mssql.clearAzureAccountTokenCache
source: Clear Microsoft Entra account token cache
es: Borrar caché de tokens de cuenta de Microsoft Entra
fr: Effacer le cache des jetons du compte Microsoft Entra
it: Cancella la cache dei token dell'account Microsoft Entra
ja: Microsoft Entra アカウント トークン キャッシュのクリア
pt_br: Limpar cache de token de conta do Microsoft Entra
ru: Очистить кэш маркеров учетной записи Microsoft Entra

# mssql.clearPooledConnections
source: Clear Pooled Connections
es: Borrar conexiones agrupadas
fr: Effacer les connexions groupées
it: Cancella connessioni in pool
ja: プールされた接続のクリア
pt_br: Limpar Conexões em Pool
ru: Очистить подключения в пулах

# mssql.objectExplorer.Tooltip.commandTimeoutLabel
source: Command Timeout
es: Tiempo de espera de comando
it: Timeout comando
ru: Время ожидания команды

# mssql.connect
source: Connect
es: Conectar
fr: Connecter
it: Connetti
ja: 接続
pt_br: Conectar
ru: Подключить

# mssql.walkthroughs.getStarted.connectToDatabase.title
source: Connect to a SQL Database
es: Conexión a una base de datos SQL
fr: Se connecter à une base de données SQL
it: Connetti a un database SQL
pt_br: Conectar-se a um Banco de Dados SQL
ru: Подключение к базе данных SQL

# mssql.walkthroughs.getStarted.connectToDatabase.altText
source: Connection Dialog
es: Cuadro de diálogo de conexión
fr: Boîte de dialogue de connexion
it: Finestra di dialogo Connessione
pt_br: Caixa de Diálogo de Conexão
ru: Диалоговое окно подключения

# mssql.objectExplorer.Tooltip.connectionTimeoutLabel
source: Connection Timeout
es: Tiempo de espera de la conexión
it: Timeout connessione
ru: Время ожидания подключения

# mssql.connectionGroups
source: Connection groups
es: Grupos de conexiones
fr: Groupes de connexions
it: Gruppi di connessione
pt_br: Grupos de conexões
ru: Группы подключений

# mssql.connections
source: Connection profiles defined in 'User Settings' are shown under 'MS SQL: Connect' command in the command palette.
es: Los perfiles de conexión definidos en "Configuración de usuario" se muestran bajo el comando "MS SQL: Conectar" en la paleta de comandos.
fr: Les profils de connexion définis dans « Paramètres utilisateur » apparaissent sous la commande « MS SQL: Connect » dans la palette de commandes.
it: I profili di connessione definiti in 'Impostazioni utente' sono visualizzati sotto il comando 'MS SQL: Connetti' nel riquadro comandi.
ja: [ユーザー設定] で定義されている接続プロファイルが、コマンド パレット内の 'MS SQL: Connect' コマンドの下に表示されます。
pt_br: Os perfis de conexão definidos em "Configurações de Usuário" são mostrados sob o comando "MS SQL: Conectar" na paleta de comandos.
ru: Профили подключения, заданные в разделе "Параметры пользователей", показаны в разделе команды "MS SQL: Connect" палитры команд.

# extension.connections
source: Connections
es: Conexiones
fr: Connexions
it: Connessioni
ja: 接続
pt_br: Conexões
ru: Подключения

# mssql.resultsGrid.inMemoryDataProcessingThreshold
source: Controls the max number of rows allowed to do filtering and sorting in memory. If the number is exceeded, sorting and filtering will be disabled. Warning: Increasing this may impact performance.
es: Controla el número máximo de filas permitidas para filtrar y ordenar en memoria. Si se supera el número, se deshabilitará la ordenación y el filtrado. Advertencia: El incremento de este número puede afectar al rendimiento.
fr: Contrôle le nombre maximal de lignes autorisées pour effectuer le filtrage et le tri en mémoire. Si ce nombre est dépassé, le tri et le filtrage sont désactivés. Avertissement : l’augmentation de cette valeur peut avoir un impact sur les performances.
it: Controlla il numero massimo di righe consentite per l'applicazione di filtri e ordinamento in memoria. Se il numero viene superato, l'ordinamento e il filtro verranno disabilitati. Avviso: l'aumento di questo valore può influire sulle prestazioni.
ru: Определяет максимальное количество строк, разрешенных для фильтрации и сортировки в памяти. Если число будет превышено, сортировка и фильтрация будут отключены. Предупреждение. Увеличение этого параметра может сказаться на производительности.

# mssql.copyAll
source: Copy All
es: Copiar todo
fr: Copier tout
it: Copia tutto
pt_br: Copiar Tudo
ru: Копировать все

# mssql.copyObjectName
source: Copy Object Name
es: Copiar nombre de objeto
fr: Copier le nom de l’objet
it: Copia nome oggetto
ja: オブジェクト名のコピー
pt_br: Copiar Nome do Objeto
ru: Копировать имя объекта

# mssql.copyConnectionString
source: Copy as Connection String
es: Copiar como cadena de conexión
it: Copia come stringa di connessione
ru: Копировать как строку подключения

# mssql.createAzureFunction
source: Create Azure Function with SQL binding
es: Crear Azure Function con enlace SQL
fr: Créer une fonction Azure avec une liaison SQL
it: Creare una funzione di Azure con l'associazione SQL
ja: SQL バインドを使用して Azure 関数を作成する
pt_br: Criar Função do Azure com associação SQL
ru: Создание Функций Azure с привязкой SQL

# mssql.createDatabase
source: Create Database
it: Crea database

# mssql.walkthroughs.getStarted.createNewTable.title
source: Create a Table with Table Designer
es: Creación de una tabla con el Diseñador de tablas
fr: Créer une table avec le Concepteur de tables
it: Crea una tabella con Progettazione tabelle
pt_br: Criar uma tabela com o Designer de Tabela
ru: Создание таблицы с помощью конструктора таблиц

# mssql.walkthroughs.getStarted.createNewTable.description
source: Create a new table in your database, or edit existing tables with the table designer. Once you're done making your changes, click the 'Publish' button to send the changes to your database.
es: Cree una nueva tabla en su base de datos o edite las tablas existentes con el Diseñador de tablas. Cuando haya terminado de realizar los cambios, haga clic en el botón 'Publicar' para enviar los cambios a la base de datos.
fr: Créez une table dans votre base de données ou modifiez les tables existantes à l’aide du concepteur de tables. Une fois vos modifications terminées, cliquez sur le bouton « Publier » pour envoyer les modifications à votre base de données.
it: Crea una nuova tabella nel tuo database o modifica le tabelle esistenti con il Designer di tabelle. Una volta completate le modifiche, fai clic sul pulsante 'Pubblica' per inviare le modifiche al tuo database.
pt_br: Crie uma nova tabela no seu banco de dados ou edite tabelas existentes com o designer de tabela. Quando terminar de fazer suas alterações, clique no botão "Publicar" para enviar as alterações para o seu banco de dados.
ru: Создать новую таблицу в вашей базе данных и изменить существующие таблицы поможет конструктор таблиц. Внеся изменения, нажмите кнопку "Опубликовать", чтобы отправить изменения в базу данных.

# mssql.dacpacDialog.launch
source: Data-tier Application (Preview)
es: Aplicación de capa de datos (versión preliminar)
it: Applicazione livello dati (anteprima)
ru: Приложение уровня данных (предварительная версия)

# mssql.defaultQueryResultsViewMode.description
source: Default view mode for query results display.
es: Modo de vista predeterminado para mostrar los resultados de la consulta.
fr: Mode d’affichage par défaut pour l’affichage des résultats de la requête.
it: Modalità di visualizzazione predefinita per la visualizzazione dei risultati della query.
ru: Представление по умолчанию для отображения результатов запроса.

# mssql.deleteQueryHistory
source: Delete
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
pt_br: Excluir
ru: Удалить

# mssql.connectionGroups.delete
source: Delete Connection Group
es: Eliminar grupo de conexiones
fr: Supprimer un groupe de connexion
it: Elimina gruppo di connessione
ru: Удалить группу подключений

# mssql.deleteContainer
source: Delete Container
es: Eliminar contenedor
fr: Supprimer le conteneur
it: Elimina contenitore
ru: Удалить контейнер

# mssql.dacpacDialog.deploy
source: Deploy DACPAC
es: Implementar DACPAC
it: Distribuisci pacchetto di applicazione livello dati
ru: Развернуть DACPAC

# mssql.disableActualPlan
source: Disable Actual Plan
es: Deshabilitar plan real
fr: Désactiver le plan réel
it: Disabilita piano effettivo
pt_br: Desabilitar Plano Real
ru: Отключить фактический план

# mssql.objectExplorer.disableGroupBySchema
source: Disable Group By Schema
es: Deshabilitar Agrupar por esquema
fr: Désactiver Grouper par schéma
it: Disabilita raggruppa per schema
ja: スキーマによるグループ化を無効にする
pt_br: Desabilitar Agrupar por Esquema
ru: Отключить группирование по схеме

# mssql.resultsGrid.disableAutoSizingEnumDescription
source: Disable automatic column sizing
es: Deshabilitar el ajuste automático de tamaño de columna
it: Disabilita ridimensionamento automatico delle colonne
ru: Отключить автоматическое изменение размера столбцов

# mssql.objectExplorer.Tooltip.disabledLabel
source: Disabled
es: Deshabilitado
it: Disabilitato
ru: Отключено

# mssql.disconnect
source: Disconnect
es: Desconectar
fr: Déconnecter
it: Disconnetti
ja: 切断
pt_br: Desconectar
ru: Отключить

# mssql.defaultQueryResultsViewMode.text.description
source: Display results in a formatted text format.
es: Mostrar los resultados en un formato de texto con formato.
fr: Afficher les résultats dans un format de texte formaté.
it: Visualizza i risultati in un formato di testo formattato.
ru: Показывать результаты в виде форматированного текста.

# mssql.defaultQueryResultsViewMode.grid.description
source: Display results in a tabular grid format (default)
es: Mostrar los resultados en un formato de cuadrícula tabular (valor predeterminado)
fr: Afficher les résultats dans un format de grille tabulaire (par défaut)
it: Visualizza i risultati in formato griglia tabulare (impostazione predefinita)
ru: Показывать результаты в виде табличной сетки (по умолчанию).

# mssql.openQueryResultsInTabByDefaultDoNotShowPrompt.description
source: Do not show prompts to display query results in a new tab.
es: No muestre mensajes para mostrar los resultados de la consulta en una nueva pestaña.
fr: Ne pas afficher les invites pour afficher les résultats de la requête dans un nouvel onglet.
it: Non mostrare le richieste per visualizzare i risultati della query in una nuova scheda.
pt_br: Não mostre solicitações para exibir os resultados da consulta em uma nova guia.
ru: Не показывать запросы на отображение результатов запроса в новой вкладке.

# mssql.enableRichExperiencesDoNotShowPrompt.description
source: Do not show prompts to enable UI-based features
es: No mostrar mensajes para habilitar características basadas en la interfaz de usuario
fr: Ne pas afficher les invites pour activer les fonctionnalités basées sur l’interface utilisateur
it: Non mostrare le richieste per abilitare le funzionalità basate sull'interfaccia utente.
pt_br: Não mostrar solicitações para habilitar os recursos baseados na interface do usuário
ru: Не показывать запросы на включение функций пользовательского интерфейса

# mssql.dropDatabase
source: Drop Database
it: Rimuovi database

# mssql.editConnection
source: Edit Connection
es: Editar conexión
fr: Modifier la connexion
it: Modifica connessione
ja: 接続の編集
ru: Изменить подключение

# mssql.connectionGroups.edit
source: Edit Connection Group
es: Editar grupo de conexiones
fr: Modifier le groupe de connexion
it: Modifica gruppo di connessione
ru: Изменить группу подключений

# mssql.connectionSharing.editConnectionSharingPermissions
source: Edit Connection Sharing Permissions
es: Editar permisos de conexión compartida
fr: Modifier les autorisations de partage de connexion
it: Modificare le autorizzazioni di condivisione delle connessioni
ru: Изменить разрешения совместного использования подключений

# mssql.tableExplorer
source: Edit Data (Preview)
es: Editar datos (versión preliminar)
it: Modifica dati (anteprima)
ru: Изменить данные (предварительная версия)

# mssql.enableActualPlan
source: Enable Actual Plan
es: Habilitar plan real
fr: Activer le plan réel
it: Abilita piano effettivo
pt_br: Habilitar Plano Real
ru: Включить фактический план

# mssql.objectExplorer.enableGroupBySchema
source: Enable Group By Schema
es: Habilitar Agrupar por esquema
fr: Activer Grouper par schéma
it: Abilita raggruppa per schema
ja: スキーマによるグループ化を有効にする
pt_br: Habilitar Agrupar por Esquema
ru: Включить группирование по схеме

# mssql.walkthroughs.getStarted.enableModernFeatures.title
source: Enable Modern Features
es: Habilitación de características modernas
fr: Activer les fonctionnalités modernes
it: Abilita funzionalità moderne
pt_br: Habilitar Recursos Modernos
ru: Включить современные функции

# mssql.enableRichExperiences
source: Enable Modern Features
es: Habilitación de características modernas
fr: Activer les fonctionnalités modernes
it: Abilita funzionalità moderne
pt_br: Habilitar Recursos Modernos
ru: Включить современные функции

# mssql.query.alwaysEncryptedParameterization
source: Enable Parameterization for Always Encrypted
es: Habilitar parametrización de Always Encrypted
fr: Activer la paramétrisation pour Always Encrypted
it: Abilita parametrizzazione per Always Encrypted
ja: Always Encrypted のパラメーター化を有効にする
pt_br: Habilitar a Parametrização para Always Encrypted
ru: Включить параметризацию для Always Encrypted

# mssql.enableQueryHistoryCapture
source: Enable Query History Capture
es: Habilitar captura de Historial de consultas
fr: Activer la capture Historique des requêtes
it: Abilita acquisizione cronologia delle query
ja: Query History キャプチャを有効にする
pt_br: Habilitar a Captura do Histórico de Consultas
ru: Включить ведение журнала запросов

# mssql.query.ansiDefaults
source: Enable SET ANSI_DEFAULTS
es: Habilitar SET ANSI_DEFAULTS
fr: Activer SET ANSI_DEFAULTS
it: Abilita SET ANSI_DEFAULTS
ja: SET ANSI_DEFAULTS を有効にする
pt_br: Habilitar SET ANSI_DEFAULTS
ru: Установить параметр SET ANSI_DEFAULTS

# mssql.query.ansiNulls
source: Enable SET ANSI_NULLS
es: Habilitar SET ANSI_NULLS
fr: Activer SET ANSI_NULLS
it: Abilita SET ANSI_NULLS
ja: SET ANSI_NULLS を有効にする
pt_br: Habilitar SET ANSI_NULLS
ru: Установить параметр SET ANSI_NULLS

# mssql.query.ansiNullDefaultOn
source: Enable SET ANSI_NULL_DFLT_ON
es: Habilitar SET ANSI_NULL_DFLT_ON
fr: Activer SET ANSI_NULL_DFLT_ON
it: Abilita SET ANSI_NULL_DFLT_ON
ja: SET ANSI_NULL_DFLT_ON を有効にする
pt_br: Habilitar SET ANSI_NULL_DFLT_ON
ru: Установить параметр SET ANSI_NULL_DFLT_ON

# mssql.query.ansiPadding
source: Enable SET ANSI_PADDING
es: Habilitar SET ANSI_PADDING
fr: Activer SET ANSI_PADDING
it: Abilita SET ANSI_PADDING
ja: SET ANSI_PADDING を有効にする
pt_br: Habilitar SET ANSI_PADDING
ru: Установить параметр SET ANSI_PADDING

# mssql.query.ansiWarnings
source: Enable SET ANSI_WARNINGS
es: Habilitar SET ANSI_WARNINGS
fr: Activer SET ANSI_WARNINGS
it: Abilita SET ANSI_WARNINGS
ja: SET ANSI_WARNINGS を有効にする
pt_br: Habilitar SET ANSI_WARNINGS
ru: Установить параметр SET ANSI_WARNINGS

# mssql.query.arithAbort
source: Enable SET ARITHABORT option
es: Habilitar la opción SET ARITHABORT
fr: Activer l’option SET ARITHABORT
it: Abilita l'opzione SET ARITHABORT
ja: SET ARITHABORT オプションを有効にする
pt_br: Habilitar a opção SET ARITHABORT
ru: Установить параметр SET ARITHABORT

# mssql.query.cursorCloseOnCommit
source: Enable SET CURSOR_CLOSE_ON_COMMIT
es: Habilitar SET CURSOR_CLOSE_ON_COMMIT
fr: Activer SET CURSOR_CLOSE_ON_COMMIT
it: Abilita SET CURSOR_CLOSE_ON_COMMIT
ja: SET CURSOR_CLOSE_ON_COMMIT を有効にする
pt_br: Habilitar SET CURSOR_CLOSE_ON_COMMIT
ru: Установить параметр SET CURSOR_CLOSE_ON_COMMIT

# mssql.query.deadlockPriority
source: Enable SET DEADLOCK_PRIORITY option
es: Habilitar la opción SET DEADLOCK_PRIORITY
fr: Activer l’option SET DEADLOCK_PRIORITY
it: Abilita l'opzione SET DEADLOCK_PRIORITY
ja: SET DEADLOCK_PRIORITY オプションを有効にする
pt_br: Habilitar a opção SET DEADLOCK_PRIORITY
ru: Установить параметр SET DEADLOCK_PRIORITY

# mssql.query.implicitTransactions
source: Enable SET IMPLICIT_TRANSACTIONS
es: Habilitar SET IMPLICIT_TRANSACTIONS
fr: Activer SET IMPLICIT_TRANSACTIONS
it: Abilita SET IMPLICIT_TRANSACTIONS
ja: SET IMPLICIT_TRANSACTIONS を有効にする
pt_br: Habilitar SET IMPLICIT_TRANSACTIONS
ru: Установить параметр SET IMPLICIT_TRANSACTIONS

# mssql.query.lockTimeout
source: Enable SET LOCK TIMEOUT option (in milliseconds)
es: Habilitar la opción SET LOCK TIMEOUT (en milisegundos)
fr: Activer l’option SET LOCK TIMEOUT (en millisecondes)
it: Abilita l'opzione SET LOCK TIMEOUT (in millisecondi)
ja: SET LOCK TIMEOUT オプションを有効にする (ミリ秒単位)
pt_br: Habilitar a opção SET LOCK TIMEOUT (em milissegundos)
ru: Установить параметр SET LOCK TIMEOUT (в миллисекундах)

# mssql.query.noCount
source: Enable SET NOCOUNT option
es: Habilitar la opción SET NOCOUNT
fr: Activer l’option SET NOCOUNT
it: Abilita l'opzione SET NOCOUNT
ja: SET NOCOUNT オプションを有効にする
pt_br: Habilitar a opção SET NOCOUNT
ru: Установить параметр SET NOCOUNT

# mssql.query.noExec
source: Enable SET NOEXEC option
es: Habilitar la opción SET NOEXEC
fr: Activer l’option SET NOEXEC
it: Abilita l'opzione SET NOEXEC
ja: SET NOEXEC オプションを有効にする
pt_br: Habilitar a opção SET NOEXEC
ru: Установить параметр SET NOEXEC

# mssql.query.parseOnly
source: Enable SET PARSEONLY option
es: Habilitar la opción SET PARSEONLY
fr: Activer l’option SET PARSEONLY
it: Abilita l'opzione SET PARSEONLY
ja: SET PARSEONLY オプションを有効にする
pt_br: Habilitar a opção SET PARSEONLY
ru: Установить параметр SET PARSEONLY

# mssql.query.queryGovernorCostLimit
source: Enable SET QUERY_GOVERNOR_COST_LIMIT
es: Habilitar SET QUERY_GOVERNOR_COST_LIMIT
fr: Activer SET QUERY_GOVERNOR_COST_LIMIT
it: Abilita SET QUERY_GOVERNOR_COST_LIMIT
ja: SET QUERY_GOVERNOR_COST_LIMIT を有効にする
pt_br: Habilitar SET QUERY_GOVERNOR_COST_LIMIT
ru: Установить параметр SET QUERY_GOVERNOR_COST_LIMIT

# mssql.query.quotedIdentifier
source: Enable SET QUOTED_IDENTIFIER
es: Habilitar SET QUOTED_IDENTIFIER
fr: Activer SET QUOTED_IDENTIFIER
it: Abilita SET QUOTED_IDENTIFIER
ja: SET QUOTED_IDENTIFIER を有効にする
pt_br: Habilitar SET QUOTED_IDENTIFIER
ru: Установить параметр SET QUOTED_IDENTIFIER

# mssql.query.statisticsIO
source: Enable SET STATISTICS IO option
es: Habilitar la opción SET STATISTICS IO
fr: Activer l’option SET STATISTICS IO
it: Abilita L'opzione SET STATISTICS IO
ja: SET STATISTICS IO オプションを有効にする
pt_br: Habilitar a opção SET STATISTICS IO
ru: Установить параметр SET STATISTICS IO
