Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++136a37d2ee433b1eb4302a84ebee86659922e34ca61c2383bc863191b5aeeafa
source: Loading text view...
es: Cargando vista de texto...
fr: Chargement de l’affichage du texte...
it: Caricamento della visualizzazione Testo...
ru: Загрузка текстового представления...

# ++CODE++58878f300e53ea741b29ea101504537639f39f997791a5950d225f8353fad887
source: Loading workspaces
es: Cargando áreas de trabajo
it: Caricamento delle aree di lavoro
ru: Загрузка рабочих областей

# ++CODE++3f9adb0f75f8f08022d5289c54dae461204356f0f718404bf22c0d08214ab34a
source: Loading workspaces...
es: Cargando áreas de trabajo...
it: Caricamento delle aree di lavoro in corso...
ru: Загрузка рабочих областей...

# ++CODE++47d2a515ef2f05b87d688656286a61e4f743da4b878684c7654969db17711c40
source: Loading...
es: Cargando...
fr: Chargement en cours...
it: Caricamento in corso...
ru: Выполнятся загрузка...

# ++CODE++8b40b52b182ad6e53db8c7a2b46b81c4daa05a4737719ec9e7290f3407d9b20d
source: Local SQL Server Container
it: Contenitore SQL Server locale
ru: Локальный контейнер SQL Server

# ++CODE++2c91c2c68950d956381637d4e22e626dbf560a93aa4fc8126d755251a70230ea
source: Local SQL Server database container
es: Contenedor de base de datos de SQL Server local
fr: Conteneur de base de données SQL Server local
it: Contenitore del database di SQL Server locale
ru: Локальный контейнер базы данных SQL Server

# ++CODE++a33a6dbd416ebaa5cdafa7c33ddc623bd52eb841a2206542a8f47b1d4eafa3b1
source: Locate an Azure Data Studio settings.json file to import
it: Individuare un file settings.json di Azure Data Studio da importare
ru: Найти файл Azure Data Studio settings.json для импорта

# ++CODE++15b61974b2707a7b3d4201385e0f01f4ff5eb1f17c5639d98788ee5add2025cd
source: Location
es: Ubicación
fr: Emplacement
it: Posizione
pt_br: Localização
ru: Расположение

# ++CODE++ac93cb35e24190764d9718b44e0c847f9e06a22105b20e4f8ca8ef96ed959775
source: Location (Workspace)
es: Ubicación (área de trabajo)
it: Località (area di lavoro)
ru: Расположение (рабочая область)

# ++CODE++28c3a8199a6dcd1373eb25c32820524f38fbba49d1e1fb378bd30dfb6d61ec2d
source: MSSQL - Azure Auth Logs
es: MSSQL: Registros de autenticación de Azure
fr: MSSQL – Journaux d’authentification Azure
it: MSSQL - Log di autenticazione di Azure
ru: MSSQL — журналы проверки подлинности Azure

# ++CODE++ac71b6a015738ee5338790cb940cf29b65310494e9c98aba9894dac78b05e4ca
source: MSSQL - VS Code walkthrough
it: MSSQL - Procedura dettagliata di VS Code
ru: MSSQL — пошаговое руководство по VS Code

# ++CODE++9f67971ab8a605f2aedf0b33a5fce37d2b135aef48f886231da5d8163aa488a6
source: MSSQL Feedback
es: Comentarios de MSSQL
fr: Commentaires sur MSSQL
it: Feedback MSSQL
pt_br: Comentários do MSSQL
ru: Отзыв о MSSQL

# ++CODE++845cd20358ee1964f66ca8b28c6df89c00d0f59d43a3e8e3f3d65a515194a1da
source: MSSQL: Welcome & What's New
es: MSSQL: bienvenida y novedades
it: MSSQL: benvenuto e novità
ru: MSSQL: приветствие и новые возможности

# ++CODE++614e5389e87ce465fe548a0665aeaa67a52a06ff792f2f791615cd37fb610178
source: Manage Connection Profiles
es: Administrar perfiles de conexión
fr: Gérer les profils de connexion
it: Gestisci profili di connessione
ja: 接続プロファイルの管理
pt_br: Gerenciar Perfis de Conexão
ru: Управление профилями подключения

# ++CODE++5ae5256284272a7585c1b275ef82e5d337ca3353c8e608120019177aad6a26c6
source: Manage relationships
es: Administrar relaciones
fr: Gérer les relations
it: Gestisci relazioni
pt_br: Gerenciar relações
ru: Управление отношениями

# ++CODE++f7fbe0b74789184e887d43fff291578ae0fe4d2b6b9fa4550271dc4a51ff980e
source: Mandatory (Recommended)
es: Obligatorio (recomendaciones)
fr: Obligatoire (recommandé)
it: Obbligatorio (scelta consigliata)
ja: 必須 (推奨)
pt_br: Obrigatório (Recomendado)
ru: Обязательно (Рекомендуется)

# ++CODE++d54543fb6beb1b6dc5aaa5961c0d92fe25a4ae3bc6fe81b241bd9064e43f46d7
source: Mandatory (True)
es: Obligatorio (true)
fr: Obligatoire (Vrai)
it: Obbligatorio (Vero)
ja: 必須 (True)
pt_br: Obrigatório (Verdadeiro)
ru: Обязательно (True)

# ++CODE++305fd6adb2295a939e62e4fed83349c610aa4e1840280503e6b64c8042dccd16
source: Max Length
es: Longitud máxima
fr: Longueur maximale
it: Lunghezza massima
pt_br: Comprimento Máximo
ru: Максимальная длина

# ++CODE++3cb29430462001e8edb74afebb929c2e967e7eac89679c4d549a8305ec4a2fe7
source: Max row count for filtering/sorting has been exceeded. To update it, navigate to User Settings and change the setting: mssql.resultsGrid.inMemoryDataProcessingThreshold
es: Se ha superado el número máximo de filas para el filtrado y la ordenación. Para actualizarla, vaya a Configuración de usuario y cambie la configuración: mssql.resultsGrid.inMemoryDataProcessingThreshold
fr: Le nombre maximal de lignes pour le filtrage/tri a été dépassé. Pour le mettre à jour, accédez à Paramètres utilisateur et modifiez le paramètre : mssql.resultsGrid.inMemoryDataProcessingThreshold
it: È stato superato il numero massimo di righe per i filtri/l'ordinamento. Per aggiornarlo, passare alle impostazioni utente e modificare l'impostazione: mssql.resultsGrid.inMemoryDataProcessingThreshold
ru: Превышено максимальное количество строк для фильтрации или сортировки. Для обновления перейдите к параметрам пользователя и измените параметр: mssql.resultsGrid.inMemoryDataProcessingThreshold

# ++CODE++fba6c2c5d9468e741725c7dfa1ac14fb59523c74fa86744027ec0a175e6cae3f
source: Maximize
es: Maximizar
fr: Agrandir
it: Ingrandisci
ja: 最大化
pt_br: Maximizar
ru: Развернуть

# ++CODE++413bb729f02d5d830364779a608ec96486cdbac9d8f519d246b280ee3fd3027d
source: Maximize ({0})
es: Maximizar ({0})
it: Ingrandisci ({0})
ru: Развернуть ({0})

# ++CODE++bfb44e231009293c2b2333bb7d0e9e5c0c79294bbb1c6a42c3471892ef016229
source: Maximize Panel Size
es: Maximizar el tamaño del panel
it: Ingrandisci dimensioni del pannello
ru: Максимально увеличить размер панели

# ++CODE++1aa744e397147289dead3a2403f0826fe7b0e380f9bdcc90253477175f18632c
source: Maximize panel size
es: Maximizar el tamaño del panel
fr: Maximiser la taille du panneau
it: Ingrandisci le dimensioni del pannello
pt_br: Maximizar o tamanho do painel
ru: Максимально увеличить размер панели

# ++CODE++2f77668a9dfbf8d5848b9eeb4a7145ca94c6ed9236e4a773f6dcafa5132b2f91
source: Message
es: Mensaje
it: Messaggio
ja: メッセージ
pt_br: Mensagem
ru: Сообщение

# ++CODE++04d7b48339271ea67d3c8493e07e90bc68dc565485eebe5e0b67c21c1586e3c0
source: Messages
es: Mensajes
it: Messaggi
ja: メッセージ
pt_br: Mensagens
ru: Сообщения

# ++CODE++d383f047a2ab3c6127191873e02bfe1e822d683f30c084fb0a6f54bad4716328
source: Messages ({0})
es: Mensajes ({0})
it: Messaggi ({0})
ru: Сообщения ({0})

# ++CODE++2d275a74912cca2e02e6d41f9cae3a75ceef3ed0ef734eff3710e10eb7112228
source: Metric
es: Métrica
fr: Métrique
it: Metrica
ja: メトリック
pt_br: Métrica
ru: Метрика

# ++CODE++e62105462009615e24c43715b276cc4743f4efd9bfd6e1e4bc108a5f9a328be9
source: Microsoft Account
es: Cuenta de Microsoft
it: Account Microsoft
ru: Учетная запись Майкрософт

# ++CODE++871ca3cb96885bd9a333a1d2914f5f4782b9d0477bcfddd603db5e4f98bde56a
source: Microsoft Account is required
es: Se requiere una cuenta de Microsoft
it: L'account Microsoft è obbligatorio
ru: Требуется учетная запись Майкрософт

# ++CODE++73c5b19bd87f6238ea91f7a12afda7927ec9708f0d2a5ca86154b2e0bbe06109
source: Microsoft Entra Account
es: Cuenta de Microsoft Entra
fr: Compte Microsoft Entra
it: Account Microsoft Entra
ja: Microsoft Entra アカウント
pt_br: Conta do Microsoft Entra
ru: Учетная запись Microsoft Entra

# ++CODE++d24b24ff2640e9b5731d40ac97ea534034176c1478b681eca122262c4d98a8a2
source: Microsoft Entra Id - Universal w/ MFA Support
es: Id. de Microsoft Entra: compatibilidad universal con MFA
fr: Identifiant Microsoft Entra – Universel avec prise en charge MFA
it: Microsoft Entra ID - Supporto universale con autenticazione a più fattori
ja: Microsoft Entra ID - MFA サポート付きユニバーサル
pt_br: Microsoft Entra ID – Universal com suporte para MFA
ru: Microsoft Entra ID — универсальный с поддержкой MFA

# ++CODE++d7f406a55a763bcaf21ae757e59b0ba9b5e2954c074d760a6afa484f977dcf3d
source: Microsoft Entra account {0} successfully added.
es: La cuenta de Microsoft Entra {0} agregó correctamente.
fr: Compte Microsoft Entra {0} ajouté avec succès.
it: L'account Microsoft Entra {0} è stato aggiunto correttamente.
ja: Microsoft Entra アカウント {0} が正常に追加されました。
pt_br: Conta do Microsoft Entra {0} adicionada com sucesso.
ru: Учетная запись Microsoft Entra {0} добавлена.

# ++CODE++ede0760e8703fdfcddf4d15e0406c0deeadd91e7907d2a3e7479c6a3d3e309e4
source: Microsoft SQL Server License Agreement
es: Contrato de licencia de Microsoft SQL Server
it: Contratto di licenza di Microsoft SQL Server
ru: Лицензионное соглашение Microsoft SQL Server

# ++CODE++951f4af90cfde827d87f358b3d8d275ee60a3306d9ddb5c4615483cff067697a
source: Microsoft reviews your feedback to improve our products, so don't share any personal data or confidential/proprietary content.
es: Microsoft revisa sus comentarios para mejorar nuestros productos. No comparta ningún dato personal ni contenido confidencial o de propiedad.
fr: Microsoft examine vos commentaires pour améliorer nos produits, donc veillez à ne pas inclure de données personnelles ou de contenu confidentiel/propriétaire.
it: Microsoft esamina il feedback degli utenti per migliorare i propri prodotti, quindi non condividere dati personali o contenuti riservati/proprietari.
pt_br: A Microsoft examina seus comentários para melhorar nossos produtos, portanto, não compartilhe nenhum dado pessoal ou conteúdo confidencial ou de proprietário.
ru: Корпорация Майкрософт изучает ваши отзывы для совершенствования наших продуктов, поэтому не включайте в них личные, конфиденциальные или защищаемые данные.

# ++CODE++1f5c209a4ee7cb85322b1d1fbde63de014d0871930fa88895405ebaea926535d
source: Microsoft will process the feedback you submit pursuant to your organization’s instructions in order to improve your and your organization’s experience with this product. If you have any questions about the use of feedback data, please contact your tenant administrator. Processing of feedback data is governed by the Microsoft Products and Services Data Protection Addendum between your organization and Microsoft, and the feedback you submit is considered Personal Data under that addendum.
es: Microsoft procesará los comentarios que envíe de acuerdo con las instrucciones de su organización con el fin de mejorar la experiencia de su organización con este producto. Si tiene alguna pregunta sobre el uso de datos de comentarios, póngase en contacto con el administrador de inquilinos. El procesamiento de datos de comentarios se rige por el Anexo de protección de datos de productos y servicios de Microsoft entre su organización y Microsoft, y los comentarios que envíe se consideran datos personales en ese anexo.
fr: Microsoft traitera les commentaires que vous envoyez conformément aux instructions de votre organisation pour améliorer son expérience et la vôtre avec ce produit. Si vous avez des questions sur l’utilisation des données des commentaires, veuillez contacter l’administrateur de votre tenant. Le traitement des données de commentaires est régi par l’Addendum de protection des données des produits et services Microsoft entre votre organisation et Microsoft, et les commentaires que vous envoyez sont considérés comme des Données personnelles conformément à cet addendum.
it: Microsoft elaborerà il feedback inviato in conformità alle istruzioni dell'organizzazione per migliorare l'esperienza dell'utente e dell'organizzazione con questo prodotto. Per eventuali domande sull'uso dei dati di feedback, contattare l'amministratore del tenant. Il trattamento dei dati di feedback è disciplinato dall'Addendum sulla protezione dei dati di prodotti e servizi Microsoft tra l'organizzazione e Microsoft e il feedback inviato è considerato come dati personali in base a tale addendum.
pt_br: A Microsoft processará os comentários enviados de acordo com as instruções da sua organização para melhorar a sua experiência e a da sua organização com esse produto. Se tiver alguma dúvida sobre o uso dos dados de comentários, entre em contato com o administrador do locatário. O processamento dos dados de comentários é regido pelo Adendo de Proteção de Dados dos Produtos e Serviços da Microsoft entre sua organização e a Microsoft, e os comentários que você enviar serão considerado Dados Pessoais conforme esse adendo.
ru: Корпорация Майкрософт будет обрабатывать отправляемые вами отзывы в соответствии с инструкциями вашей организации, чтобы улучшить взаимодействие с продуктом для вас и вашей организации. Если у вас возникли вопросы об использовании данных отзывов, обратитесь к администратору клиента. Обработка данных отзывов регулируется приложением о защите данных продуктов и служб Майкрософт между вашей организацией и корпорацией Майкрософт, а отправленные вами отзывы считаются персональными данными в рамках этого приложения.

# ++CODE++87a43e5185b677199f2369f90cd8518b8b1d7702edff307ed9e79883f43aaaaa
source: Microsoft will process the feedback you submit pursuant to your organization’s instructions in order to improve your and your organization’s experience with this product. If you have any questions...
es: Microsoft procesará los comentarios que envíe de acuerdo con las instrucciones de su organización con el fin de mejorar la experiencia de su organización con este producto. Si tiene alguna pregunta...
fr: Microsoft traitera les commentaires que vous envoyez conformément aux instructions de votre organisation pour améliorer son expérience et la vôtre avec ce produit. Si vous avez des questions...
it: Microsoft elaborerà il feedback inviato in conformità alle istruzioni dell'organizzazione per migliorare l'esperienza dell'utente e dell'organizzazione con questo prodotto. In caso di domande...
pt_br: A Microsoft processará os comentários enviados de acordo com as instruções da sua organização para melhorar a sua experiência e a da sua organização com esse produto. Se você tiver dúvidas...
ru: Корпорация Майкрософт будет обрабатывать отправляемые вами отзывы в соответствии с инструкциями вашей организации, чтобы улучшить взаимодействие с продуктом для вас и вашей организации. Если у вас есть вопросы...

# ++CODE++7d4b99d7fea1f8fb56040b0f388071d3f886f709000859485129c0ce1930fce9
source: Microsoft would like your feedback
es: A Microsoft le encantaría recibir sus comentarios
fr: Microsoft souhaite recevoir vos commentaires
it: La tua opinione è importante per Microsoft
pt_br: A Microsoft gostaria de receber seus comentários
ru: Корпорация Майкрософт очень хотела бы получить ваш отзыв

# ++CODE++7513be31d093689a83a5840217b05b63313b201192c5e2e9d590c86f52353a0e
source: Migrate saved connections and connection groups from Azure Data Studio into the MSSQL extension. This guided experience helps you continue working with familiar environments with minimal setup.
it: Eseguire la migrazione delle connessioni salvate e dei gruppi di connessioni da Azure Data Studio all'estensione MSSQL. Questa esperienza guidata consente di continuare a lavorare con ambienti familiari con una configurazione minima.
ru: Переносите сохраненные подключения и группы подключений из Azure Data Studio в расширение MSSQL. Этот интерактивный интерфейс поможет продолжить работу в привычной среде с минимальной настройкой.

# ++CODE++e8ce5dcaf408935ff76747226d2e8bee4319a2f593c1d7a838115e56183d1f37
source: Modified
it: Ultima modifica

# ++CODE++247f907d6e3294abdd7e74f9b418bdfa63295858aa3940a1c9dacaa6984db22d
source: Modified column '{0}'
it: Colonna '{0}' modificata

# ++CODE++8b8b2b1f92276bfac16ca4c1b219a0e14fe085e1a8ff20ed241c980d75605b69
source: Modified column '{0}': {1}
it: Colonna '{0}' modificata: {1}

# ++CODE++f3fed3ac5260e9d962afa7e9c3976fbe1f820afd3a1abe010faf7abb2e047092
source: Modified foreign key '{0}'
it: Chiave esterna '{0}' modificata

# ++CODE++5eb923d79b1a10036893ddc34f902b9ba8483b479ce9f10fd9d859e1dc7e95a7
source: Modified foreign key '{0}': {1}
it: Chiave esterna '{0}' modificata: {1}

# ++CODE++262d63bdafc4465b907e032f39a38463f560d64dba52d428ab76cf70bc97bf57
source: Modified table {0}
it: Tabella {0} modificata

# ++CODE++8c1da131c78db5c203dbde2e003b7644fc26985dbf4afee3e4f3b9d618474186
source: Modified table {0}: {1}
it: Tabella {0} modificata: {1}

# ++CODE++0149b409a73e8498a5256e13dbf70225738e9e1fed0d976e20ad8ef338cc2d22
source: More Query Actions
es: Más acciones de consulta
it: Altre azioni di query
ru: Другие действия с запросом

# ++CODE++b58330ac25057a441365f4f4f1be20daba2d6d940142c891231e0eac66843ff4
source: Move Down
es: Bajar
fr: Descendre
it: Sposta giù
ja: 下へ移動
pt_br: Mover para Baixo
ru: Переместить вниз

# ++CODE++1359626e7b6964345896285446db7977e67469251bb0cc52808db2a85ed940c1
source: Move Up
es: Subir
fr: Monter
it: Sposta su
ja: 上へ移動
pt_br: Mover para Cima
ru: Переместить вверх

# ++CODE++27b4c707cf413882a14ef7b762694ed52bbf69755646afa8cf1972dec4cf3c92
source: Move to Root
es: Mover a raíz
fr: Déplacer vers la racine
it: Passa alla radice
ru: Переместить в корень

# ++CODE++fee0735b5a3fda3dbca8a98565c568c91a4f03c9e52587bad82fd6d6f163f95a
source: Multiple connection groups with ID '{0}' found. Delete or rename all of them, except one in User/Global settings.json, then restart the extension.
es: Se encontraron varios grupos de conexiones con el identificador '{0}'. Elimínelas o cámbielas de nombre, excepto una en el settings.json usuario o global, y reinicie la extensión.
it: Sono stati trovati più gruppi di connessione con ID '{0}'. Eliminarli o rinominarli tutti, ad eccezione di uno in User/Global settings.json, quindi riavviare l'estensione.
ru: Найдено несколько групп подключений с идентификатором "{0}". Удалите или переименуйте все, кроме одной, в файле User/Global settings.json, затем перезапустите расширение.

# ++CODE++79e53b9f38d1c9de4d84c9a78339ceb838b609638b9194a2f0caad2f05ea2c85
source: My Data
es: Mis datos
it: Dati personali
ru: Мои данные

# ++CODE++dcd1d5223f73b3a965c07e3ff5dbee3eedcfedb806686a05b9b3868a2c3d6d50
source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
pt_br: Nome
ru: Имя

# ++CODE++ad4811485a0a0f3f000987d581730b04c0bf33a9d4ccf59a9ff1c127b33d76d1
source: Name of the primary key.
es: Nombre de la clave principal.
fr: Nom de la clé primaire.
it: Nome della chiave primaria.
ja: 主キーの名前。
pt_br: Nome da chave primária.
ru: Имя первичного ключа.

# ++CODE++2b7cfe25c7ec50bed3130625cf2450de919a7f1961b5081b5e069d3bc41bb9f5
source: Navigate to this item in the diagram
it: Vai a questo elemento nel diagramma

# ++CODE++c1ebc7817870e5be78fceae559ba5fcac2b68d5c5498d8080298004f3f79d62d
source: Needs attention
it: Richiede attenzione
ru: Требует внимания

# ++CODE++47fcb7ca194ec7de1be8ea7b91df9b1e51e273673b6410255e55f48fe0061598
source: New Azure SQL logical server (Preview)
es: Nuevo servidor lógico de Azure SQL (versión preliminar)
it: Nuovo server logico di Azure SQL (anteprima)
ru: Новый логический сервер Azure SQL (предварительная версия)

# ++CODE++e7d029a3c1b85e562db8e25ceb52958e3c3da9e6e50b95ebf95f3fae85091a15
source: New Check Constraint
es: Nueva restricción Check
fr: Nouvelle contrainte de vérification
it: Nuovo vincolo CHECK
ja: 新しい Check 制約
pt_br: Nova Restrição CHECK
ru: Новое проверочное ограничение

# ++CODE++5a59551b2622ee0d2767d9bbc3d03aa227824d88c6b25ac233cfb2a98684512c
source: New Column
es: Nueva columna
fr: Nouvelle colonne
it: Nuova colonna
ja: 新しい列
pt_br: Nova Coluna
ru: Создать столбец

# ++CODE++4a00fefe019ef43393da250ba4b62d7b6af849a1acac99b1192ffbeda8828fe7
source: New Column Mapping
es: Nueva asignación de columnas
fr: Nouveau mappage de colonnes
it: Nuovo mapping colonne
ja: 新しい列マッピング
pt_br: Novo Mapeamento de Coluna
ru: Новое сопоставление столбцов

# ++CODE++e4b1d1f865854b036aa3fc73eceb365135c402dbd2b73f2f81d5841196a71750
source: New Database
es: Nueva base de datos
it: Nuovo database
ru: Новая база данных

# ++CODE++ab23a59c68316fe4f3a53c610bdf6d7a43090ced0e69ce60895361f176ce93f6
source: New Deployment
es: Implementación nueva
it: Nuova distribuzione
ru: Новое развертывание

# ++CODE++b71586503f1694b5328fa16ed600eb0d20d4d9608dfb54f44ae97fe4ac43f0bf
source: New Foreign Key
es: Nueva clave externa
fr: Nouvelle clé étrangère
it: Nuova chiave esterna
ja: 新しい外部キー
pt_br: Nova Chave Estrangeira
ru: Создать внешний ключ

# ++CODE++30a5aebdb4a5faa3b927c90ef856e84e039707488be19e760b3701f24889875d
source: New Index
es: Nuevo índice
fr: Nouvel index
it: Nuovo indice
ja: 新しいインデックス
pt_br: Novo Índice
ru: Создание индекса

# ++CODE++6334507f512e52b67d0a5a0fb392e35e5d3acc29acdce7218f66b6199150f589
source: New Microsoft Entra account could not be added.
es: No se pudo agregar la nueva cuenta de Microsoft Entra.
fr: Le nouveau compte Microsoft Entra n’a pas pu être ajouté.
it: Non è stato possibile aggiungere il nuovo account Microsoft Entra.
ja: 新しい Microsoft Entra アカウントを追加できませんでした。
pt_br: Não foi possível adicionar a nova conta do Microsoft Entra.
ru: Не удалось добавить новую учетную запись Microsoft Entra.

# ++CODE++7c451e0f436d04a6f321f8d5de8da296a66cfb1d8cdc3918b1ed7ecd480cce28
source: New Password
es: Nueva contraseña
it: Nuova password
ru: Новый пароль

# ++CODE++f0ebbe4b20d0db8c4c52feb9dc715d1db281ae429389480780ce9120113da253
source: New SQL database
es: Nueva base de datos SQL
it: Nuovo database SQL
ru: Новая база данных SQL

# ++CODE++d9c78424d66905fdeabfc255d8900ff5c10df41268f883660b400d4dad09cfbd
source: New column mapping
es: Nueva asignación de columnas
fr: Nouveau mappage de colonnes
it: Nuovo mapping colonne
pt_br: Novo mapeamento de coluna
ru: Новое сопоставление столбцов

# ++CODE++0850ea0cc273586f20d521ce50115a6fc5e53ed6fc2e0b9bd698bd7631d6e2e3
source: New to MSSQL extension? Check out our quick-start guide.
es: ¿Nunca ha usado la extensión MSSQL? Consulte nuestra guía de inicio rápido.
it: Non si ha dimestichezza con l'estensione MSSQL? È possibile consultare la nostra guida rapida.
ru: Ранее не использовали расширение MSSQL? Ознакомьтесь с нашим кратким руководством.

# ++CODE++982508e73b4054980892537f3c6840f282b91d266b07729d248b2140cc50c08f
source: New to the MSSQL extension? Check out our quick-start guide.
it: Nuovo utente dell'estensione MSSQL? Consulta la nostra guida rapida.
ru: Ранее не использовали расширение MSSQL? Ознакомьтесь с нашим кратким руководством.

# ++CODE++1ff57a29d7c9d11bdf61c1b80f2b289b44c1ea844824d4b94a0d52b6ba5fc858
source: Next
es: Siguiente
fr: Suivant
it: Avanti
pt_br: Avançar
ru: Далее

# ++CODE++6ead5dfdc11ef7da26e4c09f348d42a8d6306b7faa54ce0a7dc6c567dab1db6f
source: Next Page
es: Página siguiente
it: Pagina successiva
ru: Следующая страница

# ++CODE++4e43f09881e3742e225d5e39243fa725d8dd7e9a9d64f05c7c814a12a0b32935
source: No Action
es: Sin acción
fr: Aucune action
it: Nessuna azione
pt_br: Nenhuma ação
ru: Нет действия

# ++CODE++dd1e244b4e319bb25477890a9327b3a2419908e042cd4063f9235a0afed6e908
source: No Microsoft Entra account can be found for removal.
es: No se encuentra ninguna cuenta de Microsoft Entra para su eliminación.
fr: Aucun compte Microsoft Entra n’a été trouvé pour la suppression.
it: Non è possibile trovare un account Microsoft Entra per la rimozione.
ja: 削除する Microsoft Entra アカウントが見つかりません。
pt_br: Nenhuma conta do Microsoft Entra pode ser encontrada para remoção.
ru: Не удалось найти учетную запись Microsoft Entra для удаления.

# ++CODE++b5353eb771f89b7df467f5082500e61791da1296427482e4eb5bb0cc5b6bec04
source: No Queries Available
es: No hay ninguna consulta disponible.
fr: Aucune requête disponible
it: Nessuna query disponibile
ja: 使用できるクエリはありません
pt_br: Não Há Consultas Disponíveis
ru: Нет доступных запросов

# ++CODE++b363e5f44515909e667e5e4b24f9690b87a202de3c6b1f1f7b8b597205461ad6
source: No account selected
es: No hay ninguna cuenta seleccionada
fr: Aucun compte sélectionné
it: Nessun account selezionato
ru: Учетная запись не выбрана
