Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++4e1af7c74096cf0a47ce343febcea35ec03b9599324314b5b8fc1de2fa479705
source: Operation failed
es: Error en la operación
it: Operazione non riuscita
ru: Сбой операции

# ++CODE++291101a07fe980e93b900ae85c9eb824f9e7e93d0d754be7440b9386b615cad7
source: Operator
es: Operador
fr: Opérateur
it: Operatore
ja: 演算子
pt_br: Operador
ru: Оператор

# ++CODE++e262d629c99156bd48e759790fae3387d08f1b1651ff7ec74a3ca9ad9202e0c9
source: Option Description
es: Descripción de la opción
fr: Description de l’option
it: Descrizione opzione
pt_br: Descrição da Opção
ru: Описание варианта

# ++CODE++da53ba1a285ffae9c6528e235b57336fa85b4f05e9fc00a51ee922069c3d9865
source: Optional (False)
es: Opcional (false)
fr: Facultatif (Faux)
it: Facoltativo (Falso)
ja: 省略可能 (False)
pt_br: Opcional (Falso)
ru: Необязательно (False)

# ++CODE++7f528941bf8224f8dd6956f98aa9ae63472375cfaebddbcb78005f15c5f239df
source: Optional - Override default GraphQL type name
it: Facoltativo - Eseguire l'override del nome del tipo GraphQL predefinito
ru: Необязательно — переопределить имя типа GraphQL по умолчанию

# ++CODE++88f7acca017a3a274d4c9ee22712b49f567fcadb30287e007c1ac2ea00cb6927
source: Optional - Override default api/entityName path
it: Facoltativo - Eseguire l'override del percorso api/entityName predefinito
ru: Необязательно — переопределить путь api/entityName по умолчанию

# ++CODE++d0db8b5e364b6989e4b8f38a2b3846b87d99a51c1592ebf35d21cc66405a8e39
source: Options
es: Opciones
it: Opzioni
pt_br: Opções
ru: Возможности

# ++CODE++974ccf82fb956ae52dd736ed3f1046fe6da2fcb80bc6679104cbd37773665175
source: Options have changed. Recompare to see the comparison?
es: Las opciones han cambiado. ¿Volver a comparar para ver la comparación?
fr: Les options ont changé. Relancer la comparaison pour voir les différences ?
it: Le opzioni sono state modificate. Ripetere il confronto?
pt_br: As opções mudaram. Comparar novamente para ver a comparação?
ru: Параметры изменились. Выполнить повторное сравнение для просмотра его результатов?

# ++CODE++2de12c616c9f918c2f9b8736ac202dcfef66460ded9a0292131caaf08466ff3f
source: Output file
es: Archivo de salida
it: File di output
ru: Выходной файл

# ++CODE++eabaa5ba70b7871bd005170e9a540a993456433cdaad54eacc4e4c07a13c71bb
source: Overall, how satisfied are you with the MSSQL extension?
es: En general, ¿cuál es su grado de satisfacción con la extensión MSSQL?
fr: Dans l’ensemble, quel est votre degré de satisfaction à l’égard de l’extension MSSQL ?
it: Nel complesso, quanto si è soddisfatti dell’estensione MSSQL?
pt_br: No geral, qual é o seu nível de satisfação com a extensão MSSQL?
ru: Насколько вы в целом удовлетворены расширением MSSQL?

# ++CODE++cd184ad9e92906aa47b1a2a184c7d63d4c3642b0ee74079f2d428841ff17036c
source: Overall, how satisfied are you with {0}?
es: En general, ¿cuál es su grado de satisfacción con {0}?
fr: Globalement, dans quelle mesure êtes-vous satisfait(e) de {0} ?
it: Nel complesso, quanto si è soddisfatti di {0}?
pt_br: No geral, qual é seu nível de satisfação com {0}?
ru: Насколько вы в целом удовлетворены функцией {0}?

# ++CODE++4b1b8aa3608a26da451ae0630d75b60ab1bc2dd229c41a80838fc7993e835c46
source: Owner
it: Proprietario

# ++CODE++f739807a9884bf6669e1185bac07658249fc43288b25fc4319a683d18b36a188
source: Package file
es: Archivo de paquete
it: File del pacchetto
ru: Файл пакета

# ++CODE++0a30a815d67d7dd2018fe18f4e995a26f3b753369cd4327e9b6034b50a2cd153
source: Page
es: Página
it: Pagina
ru: Страница

# ++CODE++e68b36b17cbd990802f57741cb75cf3a73fa66a61999b0cd70e3cf7d26cfb25f
source: Parameters
es: Parámetros
fr: Paramètres
it: Parametri
ja: パラメーター
pt_br: Parâmetros
ru: Параметры

# ++CODE++5cafcd08f15a2a6ce49d703f1da5861c94ec134cc92984cc6b2f67965c31b5ee
source: Parent node was not TreeNodeInfo.
es: El nodo primario no era TreeNodeInfo.
fr: Le nœud parent n’était pas TreeNodeInfo.
it: Il nodo padre non è TreeNodeInfo.
ja: 親ノードは TreeNodeInfo ではありませんでした。
pt_br: O nó pai não era TreeNodeInfo.
ru: TreeNodeInfo не является родительским узлом.

# ++CODE++b0f439de4ac489dfe75bf62e7fb55c9c993851f6f462fbbacae37851a6cad588
source: Password (SQL Login)
es: Contraseña (inicio de sesión de SQL)
fr: Mot de passe (connexion SQL)
it: Password (account di accesso SQL)
ja: パスワード (SQL ログイン)
pt_br: Senha (logon do SQL)
ru: Пароль (имя для входа SQL)

# ++CODE++7aeae1412484f6378e5877b660a41baa6a521988eb8b2620ca3223b05e2ff20c
source: Password is required
es: La contraseña es obligatoria
it: La password è obbligatoria
ru: Требуется указать пароль

# ++CODE++80dc52b50a4e9dc210b0dc44b71eaa2912aef3a1d931d41f51ad8bfc0061df16
source: Password must be changed for '{0}' to continue logging into '{1}'
es: Debe cambiar la contraseña de "{0}" para seguir iniciando sesión en "{1}"
it: È necessario cambiare la password per '{0}' per continuare l'accesso a '{1}'
ru: Чтобы продолжить вход в "{1}", необходимо изменить пароль для "{0}''

# ++CODE++9a6b795a5a551cedd30148a98d54756e10a329d6dbd317ef8007d2837abc1100
source: Password must be changed to continue logging into '{0}'
es: Se debe cambiar la contraseña para continuar iniciando sesión en ''{0}''
it: È necessario cambiare la password per continuare l'accesso a '{0}'
ru: Чтобы продолжить вход в "{0}", необходимо изменить пароль

# ++CODE++b6eb82cd3300c838f99773b371b2f81d5ad517b3ba903de637d3e5920de7c04f
source: Passwords do not match
es: Las contraseñas no coinciden
it: Le password non corrispondono
ru: Пароли не совпадают

# ++CODE++f3380f7b44bd70af2a369de6026bf2ca2a7b36fde9086935efcd62a0e379cc7a
source: Paste
es: Pegar
fr: Coller
it: Incolla
pt_br: Colar
ru: Вставить

# ++CODE++aa7e02a360294359df9e77459e71e6f350056d94cf36d644cc2c910fff983359
source: Paste connection string from clipboard
es: Pegar cadena de conexión desde el Portapapeles
fr: Coller la chaîne de connexion à partir du Presse-papiers
it: Incolla stringa di connessione dagli Appunti
pt_br: Colar cadeia de conexão da área de transferência
ru: Вставить строку подключения из буфера обмена

# ++CODE++71f0edbc866bcd836e06eefc36556b0e6a3552f2d422dc8bc12bddd51e3b5a8e
source: Path: {0}
es: Ruta de acceso: {0}
fr: Chemin d’accès : {0}
it: Percorso: {0}
ja: パス: {0}
pt_br: Caminho: {0}
ru: Путь: {0}

# ++CODE++0a59729d88d37ed0f6bddc3a9a92d14b94528c315fec4cd3c70cd2d4bcabe1ff
source: Pick from multiple SQL Server versions, including SQL Server 2025 (Preview) with built-in AI capabilities like vector search and JSON enhancements.
es: Elija entre varias versiones de SQL Server, incluida SQL Server 2025 (versión preliminar) con funcionalidades de inteligencia artificial integradas, como la búsqueda vectorial y las mejoras de JSON.
fr: Choisissez parmi plusieurs versions de SQL Server, notamment SQL Server 2025 (préversion) avec des fonctionnalités d’IA intégrées telles que la recherche vectorielle et les améliorations JSON.
it: Scegliere tra più versioni di SQL Server, tra cui SQL Server 2025 (Anteprima) con funzionalità di intelligenza artificiale integrate come la ricerca vettoriale e i miglioramenti JSON.
ru: Выберите нужный вариант из нескольких версий SQL Server, включая SQL Server 2025 (предварительная версия) со встроенными функциями ИИ, такими как поиск векторов и улучшения JSON.

# ++CODE++2d88a61abeffd59a3bd59240d49c72a6b54deaecde6c449c2a4fd88f698d2628
source: Please Accept the SQL Server EULA
es: Acepte el CLUF de SQL Server
fr: Veuillez accepter le CLUF de SQL Server
it: Accettare il contratto di licenza di SQL Server
ru: Примите условия лицензионного соглашения SQL Server

# ++CODE++e9867ec277676c80767b62a3ccde695a9fd4b9927c6541f6bfb0be08bed55596
source: Please choose a unique name for the container
es: Elija un nombre único para el contenedor
fr: Choisissez un nom unique pour le conteneur
it: Scegliere un nome univoco per il contenitore
ru: Выберите уникальное имя для контейнера

# ++CODE++aa9bb805dc517bc0164702b53526a013fbfece6dabeb9871e0b9910d23978c5e
source: Please choose a unique name for the profile
es: Elija un nombre único para el perfil
fr: Choisissez un nom unique pour le profil
it: Scegliere un nome univoco per il profilo
ru: Выберите уникальное имя для профиля

# ++CODE++759058121cf2833fdf5f3228c2d13019bf96166084c277f8fb23c117159cb3a7
source: Please make sure the port is a number, and choose a port that is not in use
es: Asegúrese de que el puerto es un número y elija un puerto que no esté en uso
fr: Veuillez vérifier que le port est un numéro et choisissez un port qui n’est pas utilisé
it: Assicurarsi che la porta sia un numero e scegliere una porta che non sia in uso
ru: Убедитесь, что номер порта является числом, и выберите неиспользуемый порт

# ++CODE++d81d6eb21f473c77ba01056237fcd372e9021b555b36efc68d24d22a5d608ba5
source: Please make your password 8-128 characters long.
es: Escribe la contraseña entre 8 y 128 caracteres.
fr: Veuillez définir votre mot de passe entre 8 et 128 caractères.
it: Impostare una password di lunghezza compresa tra 8 e 128 caratteri.
ru: Установите пароль длиной от 8 до 128 символов.

# ++CODE++0f179525aa14d186654c204026817bf67502b1de9f993418f8de58aab9e05ce6
source: Please select a database node in Object Explorer to drop.
it: Selezionare un nodo di database in Esplora oggetti da rimuovere.

# ++CODE++42990e221cd66206bd59e10ce7ba785f6e8a88282b99827f844bbe43089294d5
source: Please select a database node in Object Explorer to rename.
it: Selezionare un nodo di database in Esplora oggetti da rinominare.

# ++CODE++268f2704823f66b7bf71157cbbb60e14938ed5553068335e93ee23bb6960ed47
source: Please select a node from Object Explorer to script.
es: Seleccione un nodo del Explorador de objetos para generar el script.
it: Selezionare un nodo da Esplora oggetti di cui eseguire lo script.
ru: Выберите узел в обозревателе объектов для скрипта.

# ++CODE++c3b03607c2bb1ba12950e5d6e40b67962fbaf476154b4ce14c11d5d918d9df58
source: Please select a server node in Object Explorer to create a database.
it: Selezionare un nodo del cluster in Esplora oggetti per creare un database.

# ++CODE++2e0422920bb9bd61c1c7edf3554564e5ca37f4f0bc5d5a96b0402fb3a4c00155
source: Please select a workspace where you have sufficient permissions (Contributor or higher)
es: Seleccione un área de trabajo en la que tenga permisos suficientes (Colaborador o superior)
it: Selezionare un'area di lavoro in cui si dispone di autorizzazioni sufficienti (Collaboratore o superiore)
ru: Выберите рабочую область, в которой у вас достаточно разрешений (участник или выше)

# ++CODE++56244c066a4a09fb49e716fc19de4620d586a5b4776fb08f8450b3e7800850b1
source: Please select only one node to script. Multiple node scripting is not supported.
es: Seleccione solo un nodo para generar el script. No se admite el la generación de scripts de varios nodos.
it: Selezionare un solo nodo di cui eseguire lo script. Lo scripting di più nodi non è supportato.
ru: Выберите только один узел для скрипта. Создание скрипта для нескольких узлов не поддерживается.

# ++CODE++72e9a59f5a1d6289dbacb35df897d6c007c55a27e77018455c37e7b372668475
source: Port
es: Puerto
it: Porta
ru: Порт

# ++CODE++ed66c5818178010b7908ff51b8195453260bb97629cc433ea0b53795840b8645
source: Port must be a number between 1 and 65535
es: El puerto debe ser un número entre 1 y 65535.
it: Il numero della porta deve essere compreso tra 1 e 65535
ru: Порт должен быть числом от 1 до 65535

# ++CODE++c56a86c298eb5a88289af29ba70d8dfdfbf42f6a0c6cf7fe8317a824db4eb767
source: Possible Data Loss detected. Please review the changes.
es: Posible pérdida de datos detectada. Revise los cambios.
fr: Perte de données possible détectée. Veuillez examiner les modifications.
it: Rilevata possibile perdita di dati. Rivedi le modifiche.
pt_br: Possível Perda de Dados detectada. Examine as alterações.
ru: Обнаружена возможная потеря данных. Проверьте изменения.

# ++CODE++b5d65f0ae389b60297c51acb9d3f3ee1e5b846deeb84a90fd69ccdfadca7c331
source: Precision
es: Precisión
fr: Précision
it: Precisione
ja: 精度
pt_br: Precisão
ru: Точность

# ++CODE++db941d8c187f4fc67aa4904ca92e659aa8f19fc4f6409af9f9e63f741d1fcc80
source: Precision/scale mismatch between '{0}' and '{1}'
es: Error de coincidencia de precisión/escala entre "{0}" y "{1}"
fr: Incompatibilité de précision/échelle entre « {0} » et « {1} »
it: Precisione/scala non corrispondente tra '{0}' e '{1}'
pt_br: Precisão/incompatibilidade de escala entre ''{0}'' e ''{1}''
ru: Несоответствие точности или масштаба между "{0}" и "{1}"

# ++CODE++9d13699b657fe91178f41ecf87e9c11095306c7b62e26f7e7a1b019df9ca50b1
source: Preview Database Updates
es: Vista previa de actualizaciones de base de datos
fr: Aperçu des mises à jour de la base de données
it: Anteprima aggiornamenti database
ja: データベース更新のプレビュー
pt_br: Visualizar Atualizações de Banco do Dados
ru: Предварительный просмотр обновлений базы данных

# ++CODE++a57b08a480b822a0a572b993391c292ede593bf8000b406675b180bbb16260fa
source: Previous
es: Anterior
fr: Précédent
it: Precedente
pt_br: Anterior
ru: Назад

# ++CODE++a163aaa22cf7ce6c4c2a634f98bef10d0fe0a0602ada2aa50d60b262dc70b2d9
source: Previous Page
es: Página anterior
it: Pagina precedente
ru: Предыдущая страница

# ++CODE++a89f61eb88c67866f6b2666a2e7f19b6fa1c97ca8330b81f848895bcc3594a3f
source: Previous pending reconnect promise for uri {0} is rejected with error {1}, will attempt to reconnect if necessary.
es: La promesa de reconexión pendiente anterior para uri {0} se rechaza con el error {1}, intentará volver a conectar si es necesario.
fr: La promesse de reconnexion en attente précédente pour l’URI {0} est rejetée avec l’erreur {1}. Tentative de reconnexion si nécessaire.
it: La precedente promessa di riconnessione in sospeso per l'URI {0} viene rifiutata con l'errore {1}, verrà tentata la riconnessione se necessario.
ja: URI {0} の前回の保留中の再接続 Promise は、エラー {1} で拒否されました。必要に応じて再接続が試行されます。
pt_br: A promessa de reconexão pendente anterior para o URI {0} foi rejeitada com o erro {1}. Tentará reconectar, se necessário.
ru: Предыдущее ожидающее обещание повторного подключения для URI {0} отклонено с ошибкой {1}. При необходимости будет предпринята попытка повторного подключения.

# ++CODE++74ddf875033fe6ed895f48a8abc4373883fb876b36dfa7614f3f130ceee1ab20
source: Previous pending reconnection for uri {0}, succeeded.
es: La reconexión pendiente anterior para el uri {0} se realizó correctamente.
fr: La reconnexion en attente précédente pour l’URI {0} a réussi.
it: La precedente riconnessione in sospeso per l'URI {0} è riuscita.
ja: URI {0} に対する、前回の保留中の再接続に成功しました。
pt_br: A reconexão pendente anterior para o URI {0} foi bem-sucedida.
ru: Предыдущее ожидающее повторное подключение для URI {0} выполнено успешно.

# ++CODE++d196df298e2df96370fbe47015195f865db9761ab45899b56376f17df4174a88
source: Previous step failed. Please check the error message and try again.
es: Error en el paso anterior. Compruebe el mensaje de error e inténtelo de nuevo.
fr: Échec de l’étape précédente. Veuillez vérifier le message d’erreur et réessayer.
it: Il passaggio precedente non è riuscito. Controllare il messaggio di errore e riprovare.
ru: Сбой на предыдущем этапе. Прочтите сообщение об ошибке, затем повторите попытку.

# ++CODE++576a15f12aaf6d6a15053e3618a9cc740d9ab8b79b68e6515a851ed3cf6dcdc6
source: Previously released features you may not have explored yet.
it: Funzionalità rilasciate in precedenza che potresti non aver ancora esplorato.
ru: Ранее выпущенные функции, которые вы, возможно, еще не изучили.

# ++CODE++92022c2f45b6a9ba92c51438e6fed444d69673e4bd6c529e3ea8f0a8bfe1e969
source: Primary Key
es: Clave principal
fr: Clé primaire
it: Chiave primaria
ja: 主キー
pt_br: Chave Primária
ru: Первичный ключ

# ++CODE++a0de89c19964a6454c6d6b4f4205b8c8fcb6c1bfe9370b6d3183226ce8009141
source: Primary Key Columns
es: Columnas de clave principal
fr: Colonnes de clé primaire
it: Colonne chiave primaria
ja: 主キー列
pt_br: Colunas de Chave Primária
ru: Столбцы первичного ключа

# ++CODE++25f4fe8cd149e57de765fa487f6e70395ed29ad8d1f2b9c116f9efa24262b420
source: Privacy Statement
es: Declaración de privacidad
fr: Déclaration de confidentialité
it: Informativa sulla privacy
pt_br: Política de Privacidade
ru: Заявление о конфиденциальности

# ++CODE++c63eb6720c6e88493897548d3620d45e539d18574465f7b26fdddcbade044ee2
source: Private
es: Privado
it: Privato
ru: Частный

# ++CODE++5271d6ce4f647db55fc114096f1dbb3b2cc6287df8fd299c3635574761ea9fb7
source: Processing include or exclude all differences operation.
es: El procesamiento incluye o excluye todas las operaciones de diferencias.
fr: Le traitement inclut ou exclut toutes les opérations de différences.
it: Elaborazione dell'operazione di inclusione o esclusione di tutte le differenze.
pt_br: Processando a operação de incluir ou excluir todas as diferenças.
ru: Обработка операции включения или исключения всех различий.

# ++CODE++a423b47777783386516c79baa19b0dfcd12cb40e4fba79348ad14ab0169402cd
source: Profile Name
es: Nombre de perfil
fr: Nom de profil
it: Nome profilo
ja: プロファイル名
pt_br: Nome do Perfil
ru: Имя профиля

# ++CODE++f7821e5b83af275fa9638d6840dc6edd1e7c8179f566d99cb2fd713ca13e9e3c
source: Profile created and connected
es: El perfil se ha creado y se ha conectado.
fr: Profil créé et connecté
it: Il profilo è stato creato e connesso
ja: プロファイルが作成され、接続されました
pt_br: Perfil criado e conectado
ru: Создан новый профиль, подключение установлено

# ++CODE++8a0d6f1276ee19a91fb06f73344d1d60f2d1f1c8d7e0454c8bb31ea00c2b9a30
source: Profile created successfully
es: El perfil se ha creado correctamente
fr: Création du profil réussie
it: Il profilo è stato creato
ja: プロファイルが正常に作成されました
pt_br: Perfil criado com sucesso
ru: Профиль создан

# ++CODE++b0d070ae80a582b478d83f8d81282ede72d99e81778076328e1c877c5a463f16
source: Profile loaded, but the connection could not be automatically established. Please create a connection to {0} then try again.
es: Perfil cargado, pero la conexión no se pudo establecer automáticamente. Cree una conexión a {0} y vuelva a intentarlo.
it: Profilo caricato, ma non è stato possibile stabilire automaticamente la connessione. Creare una connessione a {0} e riprovare.
ru: Профиль загружен, но подключение не удалось установить автоматически. Создайте подключение к {0} и повторите попытку.

# ++CODE++d3663280e101b56ddfbbcb0b124e7b19ac07da8d1691fcef6138356fdc2f8ac3
source: Profile name
it: Nome profilo
ru: Имя профиля

# ++CODE++c7b24e72fefeade2fc1706604bb5c2ee848b055ed154428128c10d5020549a7a
source: Profile removed successfully
es: El perfil se ha eliminado correctamente.
fr: Profil supprimé
it: Il profilo è stato rimosso
ja: プロファイルが正常に削除されました
pt_br: Perfil removido com sucesso
ru: Профиль удален

# ++CODE++ae43692b2a310b8ed2443d2b7d2a3e4cf0b6d73115badd72831b3d22381f235f
source: Properties
es: Propiedades
fr: Propriétés
it: Proprietà
ja: プロパティ
pt_br: Propriedades
ru: Свойства

# ++CODE++40040cb181f7f0ee5add2b52e8467c6652477f7ce12af39fe380b5084b64f4fe
source: Property
es: Propiedad
fr: Propriété
it: Proprietà
ja: プロパティ
pt_br: Propriedade
ru: Свойство

# ++CODE++7c68cc7494a11be986cf0d4ac8e2acb67d5aa67b35151c2435cb1c51ccd060d8
source: Provider '{0}' does not have a Microsoft resource endpoint defined.
es: El proveedor “{0}” no tiene definido un punto de conexión de recursos de Microsoft.
fr: Aucun point de terminaison de ressource n’est défini pour le fournisseur « {0} ».
it: Per il provider '{0}' non è definito un endpoint di risorsa Microsoft.
ja: プロバイダー '{0}' には、Microsoft リソース エンドポイントが定義されていません。
pt_br: O provedor "{0}" não tem um ponto de extremidade de recurso da Microsoft definido.
ru: Для поставщика {0} не определена конечная точка ресурса Майкрософт.

# ++CODE++a4c47b3e357e3753f7d611820a0490f9f1d85adaee725ca2af8d72d7e02df590
source: Proxy settings found, but encountered an error while parsing the URL: '{0}'. You may encounter connection issues while using the MSSQL extension. Error: {1}
es: Se ha encontrado la configuración del proxy, pero ocurrió un error al analizar la dirección URL: ''{0}''. Puede encontrar problemas de conexión al usar la extensión MSSQL. Error: {1}
it: Impostazioni proxy trovate, ma si è verificato un errore durante l'analisi dell'URL: ''{0}''. Potrebbero verificarsi problemi di connessione durante l'uso dell'estensione MSSQL. Errore: {1}
ru: Найдены параметры прокси-сервера, но при анализе URL-адреса возникла ошибка: '{0}'. При использовании расширения MSSQL могут возникнуть проблемы с подключением. Ошибка: {1}

# ++CODE++c8c11bfcb5b3707da6e11caf47e9434acbf1519ea1dd552ebb9cd203ab8acc21
source: Proxy settings found, but without a protocol (e.g. http://): '{0}'. You may encounter connection issues while using the MSSQL extension.
es: Se ha encontrado la configuración de proxy, pero sin un protocolo (por ejemplo, http://): ''{0}''. Puede encontrar problemas de conexión al usar la extensión MSSQL.
it: Impostazioni proxy trovate, ma senza un protocollo (ad esempio http://): '{0}'. Potrebbero verificarsi problemi di connessione durante l'uso dell'estensione MSSQL.
ru: Найдены параметры прокси-сервера, но отсутствует протокол (например, http://): '{0}'. При использовании расширения MSSQL могут возникнуть проблемы с подключением.

# ++CODE++591935b15b1c88e2d5f6be0a054604fcf36f0585a6f51098fa3803826fff278c
source: Public
es: Público
it: Pubblico
ru: Общедоступный

# ++CODE++859390eb495b2ead7f05f0f799546c71435b2db31dbe082adecc3426fffc3391
source: Publish
es: Publicar
fr: Publier
it: Pubblica
ja: 公開
pt_br: Publicar
ru: Опубликовать

# ++CODE++2061d7abe64ff08b697e992f6e5b0e379cae860434c608eb72552f3ce3bbcfc8
source: Publish Changes
es: Publicar cambios
fr: Publier les modifications
it: Pubblica modifiche
pt_br: Publicar as Alterações
ru: Опубликовать изменения

# ++CODE++cf3c1d568793b842a356b2e44265de54b7f5c9d301b8de3487afd3b1689f7215
source: Publish DACPAC
es: Publicar DACPAC
it: Pubblica pacchetto di applicazione livello dati
ru: Опубликовать DACPAC

# ++CODE++dce49ef71e44b5c107d066069bd508af15fbffd22c8e410f76db1f120371635a
source: Publish Profile
es: Perfil de publicación
it: Profilo di pubblicazione
ru: Профиль публикации

# ++CODE++42b341b8072aa3adcb1b6f83353574f79b03c073faeb2c64253cdb6248c011c1
source: Publish Project
it: Pubblica progetto
ru: Опубликовать проект

# ++CODE++e800f91c86916c398645bf581043fd3d6a275d1199cb474019114e6f2195f8b1
source: Publish Project (Preview)
it: Pubblica progetto (anteprima)
ru: Опубликовать проект (предварительная версия)

# ++CODE++a2ca822b9abcd933ac2e91d9b212646bfa3bf125e734e4bf1e1d1d6b9235925f
source: Publish Settings File
es: Archivo de configuración de publicación
it: File di impostazioni di pubblicazione
ru: Опубликовать файл параметров

# ++CODE++d5ce61b547d2e5793b2ac208be904ea9f94d5e5594d0c5c02bdda22abf61fcf0
source: Publish Target
es: Publicar destino
it: Destinazione di pubblicazione
ru: Опубликовать целевой объект

# ++CODE++f9f3a475ce7608957aa4ae746b37117f26d543fb676f2f78eff8e185a3cbb143
source: Publish profile saved to: {0}
es: Perfil de publicación guardado en: {0}
it: Profilo di pubblicazione salvato in: {0}
ru: Профиль публикации сохранён в: {0}

# ++CODE++10209ed1750a4b5c09b80ea470ed45083d8d1ad3d1da877d160d9ab61a5031fc
source: Publishing Changes
es: Publicando cambios
fr: Modifications de publication
it: Pubblicazione delle modifiche
ja: 変更をパブリッシュしています
pt_br: Publicando Alterações
ru: Публикуем изменения…

# ++CODE++d7a082f416fcd5289f06b3cda1fdf7b7d3999dabb4209c0d324fdf0c57ff2ee2
source: Pulling SQL Server Image
es: Extrayendo la imagen de SQL Server
fr: Extraction d'une image SQL Server
it: Pull dell'immagine di SQL Server
ru: Получение образа SQL Server
