Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++0e1d9858f1e51bd313981a0d8da504fb12e0405fc869634ad52babe02eff9e3d
source: Pulling the SQL Server container image. This might take a few minutes depending on your internet connection.
es: Extrayendo la imagen de contenedor de SQL Server. Esto puede tardar unos minutos dependiendo de la conexión a Internet.
fr: Extraction de l'image du conteneur SQL Server. Cela peut prendre quelques minutes en fonction de votre connexion Internet.
it: Pull dell'immagine del contenitore di SQL Server in corso... Questa operazione potrebbe richiedere alcuni minuti a seconda della connessione Internet.
ru: Получение образа контейнера SQL Server. Это может занять несколько минут в зависимости от вашего подключения к Интернету.

# ++CODE++f44ad102b5dd5df1b5691408d19d39ee92cc1c9ad20f7125845df3d961a805d3
source: Query Plan
es: Plan de consulta
fr: Plan de requête
it: Piano di query
pt_br: Plano de Consulta
ru: План запроса

# ++CODE++849546c6df0763a6f8aa890e76dff62d494b20db8125f937e529ad74e52c34f1
source: Query Plan ({0})
es: Plan de consulta ({0})
it: Piano di query ({0})
ru: План запроса ({0})

# ++CODE++bebc9b760db9e5ba55f2632c57871653521c9094223eeb46476e3d7d49218b89
source: Query Plan ({0})
es: Plan de consulta ({0})
it: Piano di query ({0})
ru: План запроса ({0})

# ++CODE++9e83dc6d2db272ac27cc875b994f834b62b7202a49b69e885f8f4e8f9c29a452
source: Query executed
es: Consulta ejecutada
fr: Requête exécutée
it: Query eseguita
ja: クエリが実行されました
pt_br: Consulta executada
ru: Запрос выполнен

# ++CODE++222d8657e6ce5036c2c4e9baf67ab52aeb5b35c12ff05d913296ea5cefad1f9c
source: Query failed
es: Error en la consulta
fr: Échec de la requête
it: Query non riuscita
ja: クエリが失敗しました
pt_br: A consulta falhou
ru: Не удалось выполнить запрос

# ++CODE++9bb19ac86101a6dfe00ba121dc8fab54c216992ef8d061c9cf27bd93a4424a91
source: Query succeeded
es: Consulta realizada correctamente
fr: Requête réussie
it: Query riuscita
ja: クエリが成功しました
pt_br: Consulta bem-sucedida
ru: Запрос успешно выполнен

# ++CODE++9f24e982799f47ef97760b8fbb95ce6c89390fba37aa7fe9b6314f69aaa691ea
source: Query {0}: Query cost (relative to the script): {1}%
es: Consulta {0}: Coste de la consulta (relativo al script): {1} %
fr: Requête {0} : Coût de la requête (par rapport au script) : {1}%
it: Query {0}: costo della query (relativo allo script): {1}%
ja: クエリ {0}: クエリ コスト (スクリプトに対する相対): {1}%
pt_br: Consulta {0}: custo da consulta (em relação ao script): {1}%
ru: Запрос {0}: стоимость запроса (по отношению к сценарию): {1}%

# ++CODE++41a52587276c392bfdf0c5086b78662e089895fe2bf22e3d413af8e75f98bc3d
source: REST API
it: API REST

# ++CODE++9b9a8d05a7ec353bda84f9c1bb3178c299de3001b5e970508ddc889c487f92ca
source: Read
it: Lettura
ru: Читать

# ++CODE++1a87861144c312b1135b7e13f4da55c251e7ec3cb2d19ed06082aa132a11104e
source: Read docs
es: Leer documentos
it: Leggi la documentazione
ru: Читать документацию

# ++CODE++c386185bf02fec23ab41b4dbcc29406839df6efd9fd1cb03660aa0c2e5640617
source: Read docs on Microsoft Learn
it: Leggi la documentazione su Microsoft Learn
ru: Читать документацию на Microsoft Learn

# ++CODE++83b794145c0cc3f560cb6dfb6b5bcf7afac4dba15e5c6dbc54d103dae029fec6
source: Read more
es: Más información
fr: Découvrir plus d’informations
it: Altre informazioni
ja: 詳細情報
pt_br: Leia mais
ru: Подробнее

# ++CODE++26bbc19674f13d589450ded585fd3285cb51dc7409d3f00eb1f265936de06b3d
source: Ready for import
it: Pronta per l'importazione
ru: Готово к импорту

# ++CODE++8a71e31f52571efdf22b8d02a3c0f05489b38f70968e5741c1d4a1a47ea5bae4
source: Readying container for connections.
es: Preparando el contenedor para las conexiones.
fr: Préparation du conteneur pour les connexions.
it: Preparazione del contenitore per le connessioni.
ru: Подготовка контейнера для подключений.

# ++CODE++3c311675a5c2bf9cd3b95e78f5c957399730d791fae923def53395a43f131d1f
source: Readying container for connections...
es: Preparando el contenedor para las conexiones...
fr: Préparation du conteneur pour les connexions...
it: Preparazione del contenitore per le connessioni in corso...
ru: Подготовка контейнера для подключений...

# ++CODE++6aafab6eae72092eb7c25ffb6f34dab1a3eb70f1ef79e6e159f0fe540ca6b675
source: Receive natural language explanations to help developers unfamiliar with T-SQL understand code
es: Recibir explicaciones en lenguaje natural para ayudar a desarrolladores no familiarizados con T-SQL a entender el código
it: Ricevi spiegazioni in linguaggio naturale per aiutare gli sviluppatori non esperti di T-SQL a comprendere il codice
ru: Получайте объяснения на естественном языке, чтобы помочь понять код разработчикам, которые не знакомы с T-SQL

# ++CODE++690dbe9dc0993c4256683738fc3fd541cfa96f60d299be33343615dd58179d93
source: Recent
es: Reciente
it: Recenti
ru: Недавние

# ++CODE++705aa26f40f31a71c622836f9a913bf837817f54e45133215a5d222489e6a7c8
source: Recent Connections
es: Conexiones recientes
fr: Connexions récentes
it: Connessioni recenti
ja: 最近の接続
pt_br: Conexões Recentes
ru: Недавние подключения

# ++CODE++703f1ae8b7cdb3525cdab9ea694ab27b1b9e4337f0b2ca32f152f7f9a6e2f9d5
source: Recent connections list cleared
es: La lista de conexiones recientes se ha borrado
fr: Liste des connexions récentes effacée
it: L'elenco delle connessioni recenti è stato cancellato
ja: 最近の接続の一覧がクリアされました
pt_br: Lista de conexões recentes limpa
ru: Список последних подключений очищен

# ++CODE++85a3403bf7f8754b479e80917b7d779d63640b98e77450fe47ae7303ca7e9d03
source: Recovery Model
it: Modello di recupero

# ++CODE++74273989b0966e2369b6d01aadb23af4ad6a9e724643fa88f2bde99202a36708
source: Redo
es: Rehacer
fr: Restaurer
it: Ripristina
ru: Повторить

# ++CODE++d49d10a2017dc4911588fbe91abdc783a6eb59caf6b52432ddae0399d838014d
source: Referenced column '{0}' not found
es: No se encontró la columna "{0}" a la que se hace referencia
fr: Colonne référencée « {0} » introuvable
it: Colonna di riferimento '{0}' non trovata
pt_br: Coluna referenciada ''{0}'' não encontrada
ru: Столбец, на который имеется ссылка, "{0}", не найден

# ++CODE++797ad1e737f00e56b04c2d4140e177a26977d3a90e9ea84cb65016e21c50113f
source: Referenced table '{0}' not found
es: No se encontró la tabla "{0}" a la que se hace referencia
fr: Table référencée « {0} » introuvable
it: Tabella di riferimento '{0}' non trovata
pt_br: Tabela referenciada ''{0}'' não encontrada
ru: Указанная таблица "{0}" не найдена

# ++CODE++0e91610117029a62a478b7fa7df0b8598bebe3ab1e192d4b1882e310719c9671
source: Refresh
es: Actualizar
fr: Actualiser
it: Aggiorna
pt_br: Atualizar
ru: Обновить

# ++CODE++627fc5f9740b31ca7868476caa3694a842a494bf358329d1aaf28f3fd7a5a4f0
source: Refresh Credentials
es: Actualizar credenciales
fr: Actualiser les informations d’identification
it: Aggiorna credenziali
ja: 資格情報の更新
pt_br: Atualizar Credenciais
ru: Обновить учетные данные

# ++CODE++8244520578a62efeba5421b2c34605b58d39c05080245ba8a33abc9efc035f0e
source: Refresh dataset
es: Actualizar conjunto de datos
it: Aggiorna set di dati
ru: Обновить набор данных

# ++CODE++0cd1ba1d31d508fcf599096e647eb0c1a60819928248e404a3f71ea9f7aafad8
source: Reload Visual Studio Code
es: Volver a cargar Visual Studio Code
fr: Recharger le code Visual Studio
it: Ricarica Visual Studio Code
ja: Visual Studio Code の再読み込み
pt_br: Recarregar Visual Studio Code
ru: Перезагрузить Visual Studio Code

# ++CODE++b69ef66763bd411348c2bf030ab4cd0881dc36c538ce1a05966e92b927d2675c
source: Remind Me Later
es: Recordármelo más tarde
fr: Me rappeler plus tard
it: Ricordare più tardi
pt_br: Lembre-me Mais Tarde
ru: Напомнить позже

# ++CODE++c3812fc4acb861d5182fc2b8155f327f736fbe5e5eb86a7bd7afcb6dc5497282
source: Remove
es: Quitar
fr: Supprimer
it: Rimuovi
ja: 削除
pt_br: Remover
ru: Удалить

# ++CODE++67b215a4a9c0185c90cc9b971dcdf8dc2c3fddcaa5bfc78eed8cfcc2cefaf0d7
source: Remove Sort
es: Quitar ordenación
it: Rimuovi ordinamento
ru: Удалить сортировку

# ++CODE++23c5cdc6269ef451d3b3aed87b2cf78c0153cc9097143b6140f23d2331f5947f
source: Remove filter
es: Quitar filtro
it: Rimuovi filtro
ru: Удалить фильтр

# ++CODE++7024a828547b51d9fb11f26d4d1d472691dd7e6ec7d7a2f499cb08731a63e943
source: Remove recent connection
es: Quitar conexión reciente
fr: Supprimer la connexion récente
it: Rimuovi connessione recente
pt_br: Remover conexão recente
ru: Удалить последнее подключение

# ++CODE++d5001dd4aab39b12094fd9e9b68e3b8ab67a6437c8eeaf592f0943dcd5851890
source: Remove sort
es: Quitar ordenación
it: Rimuovi ordinamento
ru: Удалить сортировку

# ++CODE++4f98318295cf61965501b5ff934574dfd3efea58641100c01dfa70131a732b31
source: Remove {0}
es: Quitar {0}
fr: Supprimer {0}
it: Rimuovi {0}
pt_br: Remover {0}
ru: Удалить {0}

# ++CODE++90d9ab3255a92db5b378418ece6b230df904cb32837a59f146c96966f659a683
source: Rename Database
it: Rinomina database

# ++CODE++0b73ca14b5d89fd5c289af312a66842146e766baf6c5018848b36f086944cb0b
source: Replication
es: Replicación
it: Replica
ru: Репликация

# ++CODE++cc874c54b76cd239b02d7fddeea1dd3415c1a0a3fe476cd537f26b06c0e98dcd
source: Request a new feature
it: Richiedi una nuova funzionalità
ru: Запросить новую функцию

# ++CODE++4850b174b713d88cfc63de107830d5388929020e78abc91fc19bba7a6821625f
source: Required
es: Obligatorio
it: Obbligatorio
ru: Обязательно

# ++CODE++7e069f05fe75d06f806f4772b8ab6ad6ab63626da27cd0d7f215913e529b1d43
source: Requires user authentication
it: Richiede l'autenticazione utente
ru: Требует проверки подлинности пользователя

# ++CODE++daee7606b339f3c339076fe2c9f372a3ff40c8ee896005d829c7481b64ca5303
source: Reset
es: Restablecer
fr: Réinitialiser
it: Reimposta
pt_br: Redefinir
ru: Сбросить

# ++CODE++2956e06ac0651084bbd5558dfe469615e9a5fc3072f60a09a9cb3c597a19324c
source: Resize
es: Cambiar tamaño
it: Ridimensiona
ru: Изменить размер

# ++CODE++fc71b6e1d435d817984f9c7394f47e21505efa2a9f81b5f3e17082ced1432cc7
source: Resize column '{0}'
es: Cambiar el tamaño de la columna ''{0}''
it: Ridimensiona colonna '{0}'
ru: Изменить размер столбца "{0}"

# ++CODE++ae6d9c313ef115d3be932d158acd74f5ab4db5c068cdc2c10ade081168b185d5
source: Resource Group
es: Grupo de recursos
fr: Groupe de ressources
it: Gruppo di risorse
pt_br: Grupo de Recursos
ru: Группа ресурсов

# ++CODE++e89b30aa1dc30a6ad8c34610689bede83b3ef645a24c3a84a0990826687fb735
source: Resources
es: Recursos
it: Risorse
ru: Ресурсы

# ++CODE++a76e13b9839270eb73ed11417f7d8acca55df0ad52065799361631d0fff74f27
source: Restore
es: Restaurar
fr: Restaurer
it: Ripristina
ja: 復元
pt_br: Restaurar
ru: Восстановить

# ++CODE++aa23cbfa14a31ad474e4c88dbaf83494d1f988d659568633b40d2e93cc39b61d
source: Restore ({0})
es: Restaurar ({0})
it: Ripristina ({0})
ru: Восстановить ({0})

# ++CODE++08a1e27d6e3c46f5a5b553a82a39ac2d0e89f6b37a9f57269532ed172d6d2de8
source: Restore Panel Size
es: Restaurar el tamaño del panel
it: Ripristina dimensioni del pannello
ru: Восстановить размер панели

# ++CODE++f225a9c1cec3aeb23174520a7be45fd29e7f9de8fecba6757bb7cd215235979e
source: Restore panel size
es: Restaurar el tamaño del panel
fr: Restaurer la taille du panneau
it: Ripristina le dimensioni del pannello
pt_br: Restaurar o tamanho do Painel
ru: Восстановить размер панели

# ++CODE++26b4293018ea72418733109f2e245387d9dfcfe7d4083c0c1f29eb1155c98365
source: Restore properties pane
es: Restaurar panel de propiedades
it: Riquadro Ripristina proprietà
ru: Восстановить панель свойств

# ++CODE++a1519957e8b397de6037c8e8a9a1af37009bf6d89fa0f388b1e4b3dc76179e64
source: Result Set Batch {0} - Query {1}
es: Lote de conjunto de resultados {0} - Consulta {1}
it: Batch set di risultati {0}: query {1}
ru: Пакет набора результатов {0} — запрос {1}

# ++CODE++219c4a6c86a716e99d5dc9611b61e584deb11b57e972d87d4b773387ebc3cadd
source: Results
es: Resultados
fr: Résultats
it: Risultati
ja: 結果
pt_br: Resultados
ru: Результаты

# ++CODE++ccb11e8d73c1d40ef67b26d9ca77a50ab2987d9ac9af361e065c3c1c6699c116
source: Results ({0})
es: Resultados ({0})
fr: Résultats ({0})
it: Risultati ({0})
ru: Результаты ({0})

# ++CODE++82d510eecb9f37659e99b55edff96e66aced3765063d0981d26bb433381f1945
source: Results ({0})
es: Resultados ({0})
it: Risultati ({0})
ru: Результаты ({0})

# ++CODE++a71f9e2908cf7df2e5ce9dafa67f3f4949fc4c74f525b9f4a6229ff6a7f93c86
source: Results copied to clipboard
es: Resultados copiados en el Portapapeles
it: Risultati copiati negli Appunti
ru: Результаты скопированы в буфер обмена

# ++CODE++47c4e447deebe0e891365e8fc7bd3805ac17b8753bb83205ee77b7408103de61
source: Results exported successfully to {0}
es: Los resultados se exportaron correctamente a {0}
it: Risultati esportati correttamente in {0}'
ru: Результаты экспортированы в {0}

# ++CODE++942087cc2d41e01304b7195558d093d10c72af8e838c7556d6a02d471ee71852
source: Retry
es: Reintentar
fr: Réessayer
it: Riprova
ja: 再試行
pt_br: Tentar novamente
ru: Повторить

# ++CODE++36b830bdb447f8c758a9b58f190eed468c4bd53e9c7662ee19bca9c53d3a3e3d
source: Reveal
it: Rivela

# ++CODE++b1d3c17e8d131616e4c9d243a6536aa7c23973e93908621d94b6b7ebf6486863
source: Reveal in Explorer
es: Mostrar en el Explorador
it: Visualizza in Esplora risorse
ru: Открыть в обозревателе

# ++CODE++cc849385646ba0d67a8687fb561eec23fadf51b144242cf6a41dd5b594bb4180
source: Reveal in Finder
es: Revelar en Finder
it: Visualizza in Finder
ru: Отобразить в Finder

# ++CODE++ed5c65311daf9e46eb0f5ac74221d4405dabfe18cca554232363495a3a268ca5
source: Reverse Alphabetical
es: Orden alfabético inverso
fr: Ordre alphabétique inversé
it: Ordine alfabetico inverso
ja: 逆アルファベット順
pt_br: Alfabético Reverso
ru: В обратном алфавитном порядке

# ++CODE++da37d071c9526cb361ef4fdb39a225e2ec0eefdf323c591b5741adf58295fda8
source: Reverse-engineer existing databases by explaining SQL schemas and relationships
es: Realiza ingeniería inversa de bases de datos existentes explicando los esquemas y las relaciones SQL
it: Decompila i database esistenti spiegando gli schemi e le relazioni SQL
ru: Изучить технологии существующих базы данных путем объяснения схем и связей SQL

# ++CODE++0026c505347863ae188a99df6946e16ac83262585044660440699346d24784e7
source: Revert
it: Ripristina

# ++CODE++289de1729d4ea9f6d9ab040fb6f260a4bb860bac27ecd4e88b968575cfc726f0
source: Revert Cell
es: Revertir celda
it: Ripristina cella
ru: Отменить изменения ячейки

# ++CODE++196561ed1b886dfa24402369be0ac725998191df58790075d4c74ff0378851b5
source: Revert Row
es: Revertir fila
it: Ripristina riga
ru: Отменить изменения строки

# ++CODE++2cd8b391ded485370b446d5df90c1cdb4fb6690d6cfd939c851fd2704c5114f7
source: Revert this change to its original state
it: Ripristina la modifica allo stato originale

# ++CODE++29185835a277f43007e12333c37a5bca92231e5bf3f9de29afc41a0497e2f8f3
source: Revert values to project defaults
es: Revertir los valores a los predeterminados del proyecto
it: Ripristina valori predefiniti del progetto
ru: Вернуться к значениям проекта по умолчанию

# ++CODE++02db2f499ba6ed0895fdb86e879b5758e87aacd4251189046218aec2617a0ba5
source: Rosetta is required to run SQL Server container images on Apple Silicon. Enable "Use Rosetta for x86_64/amd64 emulation on Apple Silicon" in Docker Desktop > Settings > General.
es: Rosetta es necesaria para ejecutar imágenes de contenedor de SQL Server en Apple Silicon. Habilite "Usar Rosetta para la emulación x86_64/amd64 en Apple Silicon" en Docker Desktop > Configuración > General.
fr: Rosetta est nécessaire pour exécuter des images de conteneur SQL Server sur Apple Silicon. Activez « Utiliser Rosetta pour l’émulation x86_64/amd64 sur Apple Silicon » dans Docker Desktop > Paramètres > Général.
it: Rosetta è necessaria per eseguire le immagini dei contenitori SQL Server su Apple Silicon. Abilita "Usa Rosetta per l'emulazione x86_64/amd64 su Apple Silicon" in Docker Desktop > Impostazioni > Generale.
ru: Rosetta необходима для запуска образов контейнеров SQL Server на Apple Silicon. Включите параметр "Использовать Rosetta для эмуляции x86_64/amd64 на Apple Silicon" в Docker Desktop > "Параметры" > "Основные".

# ++CODE++2f34dcbb175e7163055db4c74f8da053a82783ca89ca052d216bc867598b3ef3
source: Row created.
es: Fila creada.
it: Riga creata.
ru: Строка создана.

# ++CODE++e1bc7c26c53c918d01dedcacc525ec1f4c4f1f77395d22c9364fde74d2e43701
source: Row deleted.
es: Fila eliminada.
it: .Riga eliminata.
ru: Строка удалена.

# ++CODE++bec1d11423719e75365ab2e2d94e69229e18d8e25440ece25c0855deac353687
source: Row marked for removal.
es: Fila marcada para eliminación.
it: Riga contrassegnata per la rimozione.
ru: Строка помечена для удаления.

# ++CODE++141b69f95916694982e525599db8205af7ecd6ced92d36c8aec6c5a9daa1e90e
source: Rows per page
es: Filas por página
it: Righe per pagina
ru: Строк на страницу

# ++CODE++7c9de4e8e989511f39c9c515352856dbfe290c6de0e123d12cc60972e8fa8bf3
source: Rule name
es: Nombre de regla
fr: Nom de la règle
it: Nome regola
pt_br: Nome da regra
ru: Имя правила

# ++CODE++826cea94aca7f2bce9e97c214c1df682ea9fa53a85d642e06993064d077eda60
source: Run Query
es: Ejecutar consulta
fr: Exécuter la requête
it: Esegui query
ru: Выполнить запрос

# ++CODE++fa12adeb7bf1db8bea535fb7afc4cdb5121fe19f586fd0996a719007d8c7012c
source: Run Query History
es: Ejecutar historial de consultas
fr: Exécuter l’historique des requêtes
it: Eseguire la cronologia delle query
ja: Query History の実行
pt_br: Executar o Histórico de Consultas
ru: Запустить журнал запросов

# ++CODE++ac94961d65d453caddfb9b5cdcf79c96671b85462f0c7b9ff25e2a316c6dfa86
source: Run a query in the current editor, or switch to an editor that has results.
es: Ejecute una consulta en el editor actual o cambie a un editor que tenga resultados.
fr: Exécutez une requête dans l’éditeur actuel ou passez à un éditeur qui contient des résultats.
it: Esegui una query nell'editor corrente o passa a un editor che ha risultati.
ru: Запустите запрос в текущем редакторе или переключитесь на редактор с результатами.

# ++CODE++2c757183a36d594602187e88cad67e8e38ab92dd5c9c01ca69eb4c67f465b8e3
source: Run query on connection '{0}' (ID: {1})? Query: {2}
es: ¿Ejecutar consulta en la conexión "{0}" (Id.: {1})? Consulta: {2}
it: Eseguire query sulla connessione "{0}" (ID: {1})? Query: {2}
ru: Выполнить запрос при подключении "{0}" (ИД: {1})? Запрос: {2}

# ++CODE++4e16c2dab3b093c189f6f41be6961a3e5a42e6c8c2d3609ce6398e1bd9c8f60c
source: Running query is not supported when the editor is in multiple selection mode.
es: No se admite la ejecución de consultas cuando el editor está en modo de selección múltiple.
fr: L’exécution de la requête n’est pas prise en charge lorsque l’éditeur est en mode de sélection multiple.
it: L'esecuzione di query non è supportata quando l'editor è in modalità di selezione multipla.
ja: エディターが複数選択モードの場合、クエリの実行はサポートされません。
pt_br: A execução da consulta não tem suporte quando o editor está no modo de seleção múltipla.
ru: Выполнение запроса не поддерживается, если редактор находится в режиме выбора нескольких элементов.

# ++CODE++73aecbc2e3e136472dcf00378839efb802b36e46ee45efd2d0a79aa40e756409
source: Running query on connection '{0}' (ID: {1})
es: Ejecutando consulta en la conexión "{0}" (Id.: {1})
it: Esecuzione della query sulla connessione "{0}" (ID: {1})
ru: Выполнение запроса при подключении "{0}" (ИД: {1})

# ++CODE++59b151f69d83edf3eb174ff38c0f77aebf28c9195c785f2003a1cd708de0dc77
source: SQL Analytics Endpoint
es: Punto de conexión de análisis SQL
it: Endpoint di Analisi SQL
ru: Конечная точка аналитики SQL

# ++CODE++fa728e3cf6aa4aa3207afe540af912463db2631cd2358004e457e71dc0107148
source: SQL Container Name
es: Nombre del contenedor de SQL
it: Nome contenitore SQL
ru: Имя контейнера SQL

# ++CODE++418024d48b3bccf64d26f1031290f65e229c515336a4b5a08a0cde384d803ed7
source: SQL Container Version
es: Versión del contenedor de SQL
it: Versione del contenitore SQL
ru: Версия контейнера SQL

# ++CODE++7f779b8a3477b9909716127bf4ed2ef8e07e7f5fae134f7ad1506a7f267de247
source: SQL Database
it: Database SQL
ru: База данных SQL

# ++CODE++11f1ce06685908adfd2a88a77c9de4148392e6667521c7ff01845de7c8822849
source: SQL Database Projects – Publish Dialog (Preview)
it: Progetti di database SQL - Finestra di dialogo Pubblica (anteprima)
ru: Проекты базы данных SQL — диалоговое окно публикации (предварительная версия)

# ++CODE++bcb563c464628dce28a629cdda03742239a5b0f9e25da0a87aea6e68ad25933a
source: SQL Login
es: Inicio de sesión de SQL
fr: Connexion SQL
it: Account di accesso SQL
ja: SQL ログイン
pt_br: Logon do SQL
ru: Вход SQL

# ++CODE++2ea04a74395b2376e4dd5e83ffd39385d7b3dbfe4af1cb43bc8080b8b91c548e
source: SQL Plan Files
es: Archivos de plan de SQL
fr: Fichiers de plan SQL
it: File di piano SQL
pt_br: Arquivos de Plano SQL
ru: Файлы плана SQL

# ++CODE++0404cd9b41a2ccda40d68efcab8008a39503e1487a468ad37a26417a02df844f
source: SQL Server 2025 is not supported on ARM architecture. Please select a different SQL Server version.
es: SQL Server 2025 no se admite en la arquitectura Arm. Seleccione otra versión de SQL Server.
it: SQL Server 2025 non è supportato nell'architettura ARM. Selezionare una versione diversa di SQL Server.
ru: SQL Server 2025 не поддерживается в архитектуре ARM. Выберите другую версию SQL Server.

# ++CODE++31aead661ae4eee1d516f5b824b2d74ec3221ad35899111d62eb58ea7a78aaf6
source: SQL Server 2025 is not yet supported on ARM architecture. ARM support will be available starting with the SQL Server 2025 CU1 container image.
es: SQL Server 2025 aún no es compatible con la arquitectura Arm. La compatibilidad con ARM estará disponible a partir de la imagen de contenedor de SQL Server 2025 CU1.
it: SQL Server 2025 non è ancora supportato nell'architettura ARM. Il supporto ARM sarà disponibile a partire dall'immagine del contenitore SQL Server 2025 CU1.
ru: SQL Server 2025 пока не поддерживается в архитектуре ARM. Поддержка ARM станет доступна, начиная с образа контейнера SQL Server 2025 CU1.

# ++CODE++8553f640204422619af23f71ce8e01bb39f23579ff44b08e5da1cd2eb4482c27
source: SQL Server Container SA Password
es: Contraseña de administrador de sistema de contenedor SQL Server
fr: Mot de passe de l’administrateur(-trice) du conteneur SQL Server
it: Password dell'amministratore di sistema del contenitore di SQL Server
ru: Пароль системного администратора контейнера с SQL Server

# ++CODE++8fb9e52bba9bdebaf10c130eca428ca15b770d0ba41c5f854c47db14a380f8ae
source: SQL Server admin password
es: Contraseña de administrador de SQL Server
it: password amministratore SQL Server
ru: Пароль администратора SQL Server

# ++CODE++49946129c776c67af592a7bd5399b229d9e11260362f8dd0ee8a96778dbc3bee
source: SQL Server does not support Windows containers. Please switch to Linux containers in Docker Desktop settings.
es: SQL Server no admite contenedores de Windows. Cambie a los contenedores de Linux en la configuración de Docker Desktop.
fr: SQL Server ne prend pas en charge les conteneurs Windows. Basculez vers des conteneurs Linux dans les paramètres de Docker Desktop.
it: SQL Server non supporta i contenitori Windows. Passare ai contenitori Linux nelle impostazioni di Docker Desktop.
ru: SQL Server не поддерживает контейнеры с Windows. Переключитесь на контейнеры Linux в настройках Docker Desktop.

# ++CODE++fa9d43d3408d2b926cc81a65d48ab465911dbeecf89755eb0bb46c4a4ad61e04
source: SQL Server is not supported on ARM processors including both Windows and Apple silicon-based machines.
es: SQL Server no se admite en procesadores ARM, incluidos los equipos basados en silicio de Windows y Apple.
it: SQL Server non è supportato sui processori ARM, inclusi computer Windows e Apple basati su chip al silicio.
ru: SQL Server не поддерживается процессорами ARM, включая устройства с Windows и на базе Apple Silicon.

# ++CODE++035f6f2b97a039d49cb4ed684e5e8118c2acf2ff2fcc0e25fc94e2eacbc63b80
source: SQL Server port number
es: Número de puerto de SQL Server
it: Numero di porta di SQL Server
ru: Номер порта SQL Server
