Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++50f82f3bd4638f41e11892aa681c016d9f858ac119041d52c52d5fb661c5936f
source: First Page
es: Primera página
it: Prima pagina
ru: Первая страница

# ++CODE++9285cedcf26a7cbb5277c70b4651a54679ee9d2c89767bc9dbe532b14f4bb697
source: Flat
es: Plano
fr: Plat
it: Semplice
pt_br: Simples
ru: Без иерархии

# ++CODE++13fc8c5ffacfa92740bde97ad456803b31784d6451d83afd89f0a993d75c59e5
source: Folder Structure
es: Estructura de carpetas
fr: Structure du dossier
it: Struttura cartella
pt_br: Estrutura de Pastas
ru: Структура папок

# ++CODE++52742c9dc235ecbc2154d3bef091d1e39dd0b8b542ebac8031331a146b83242d
source: For numeric data, the maximum number of decimal digits that can be stored in this database object to the right of decimal point.
es: Para los datos numéricos, el número máximo de dígitos decimales que se pueden almacenar en este objeto de base de datos a la derecha del punto decimal.
fr: Pour les données numériques, le nombre maximal de chiffres décimaux qui peuvent être stockés dans cet objet de base de données à droite de la virgule décimale.
it: Per dati numerici, il numero massimo di cifre decimali che è possibile archiviare in questo oggetto di database a destra della virgola.
ja: 数値データの場合、この小数点の右側にあるデータベース オブジェクトに格納できる小数点以下の最大桁数です。
pt_br: Para dados numéricos, o número máximo de dígitos decimais que podem ser armazenados nesse objeto de banco de dados à direita do ponto decimal.
ru: Для числовых данных максимальное количество десятичных знаков справа от десятичного разделителя, которые могут быть сохранены в этом объекте базы данных.

# ++CODE++20b04b0eb9264d54736120dae88c712700ee14a95803823187961e630998a7fc
source: For numeric data, the maximum number of decimal digits that can be stored in this database object.
es: Para datos numéricos, número máximo de dígitos decimales que se pueden almacenar en este objeto de base de datos.
fr: Pour les données numériques, le nombre maximal de chiffres décimaux pouvant être stockés dans cet objet de base de données.
it: Per dati numerici, il numero massimo di cifre decimali che è possibile archiviare in questo oggetto di database.
ja: 数値データの場合、このデータベース オブジェクトに格納できる 10 進数の最大桁数です。
pt_br: Para dados numéricos, o número máximo de dígitos decimais que podem ser armazenados neste objeto de banco de dados.
ru: Для числовых данных: максимальное количество десятичных знаков, которые могут храниться в этом объекте базы данных.

# ++CODE++647da5cac1ce93e913f21be22e9dcb571b96b96a9d7aa7eaa2bac2f2d0ccd5b8
source: Force fit columns
es: Forzar ajuste de columnas
it: Imponi adattamento colonne
ru: Принудительно подогнать столбцы

# ++CODE++2390e8502ba64cd13706dd2af52d9983efe51a28984739601b0b86fbf7c65904
source: Foreign Column
es: Columna externa
fr: Chronique étrangère
it: Colonna esterna
ja: 外部列
pt_br: Coluna Estrangeira
ru: Внешний столбец

# ++CODE++43aaa008cb8b129bc33f70e1c70317da8a00fd95e83728587f3a84053b4df2a1
source: Foreign Key
es: Clave externa
fr: Clé étrangère
it: Chiave esterna
ja: 外部キー
pt_br: Chave Estrangeira
ru: Внешний ключ

# ++CODE++7243088a776ee64422264949fcd3e6bff4cab595d0f7fb6bf45d5765a2c2ef66
source: Foreign Key {0}
es: Clave externa {0}
fr: Clé étrangère {0}
it: Chiave esterna {0}
pt_br: Chave Estrangeira {0}
ru: Внешний ключ {0}

# ++CODE++7d30023ced5527cc9061c41e18c832bba55267935cbfc5c45a68dbf5dcc5a310
source: Foreign Keys
es: Claves externas
fr: Clés étrangères
it: Chiavi esterne
ja: 外部キー
pt_br: Chaves Estrangeiras
ru: Внешние ключи

# ++CODE++343460cabeff0fb48d3eaab8a7b7cec8ab6533656b987b607002e6fae59daa8b
source: Foreign Table
es: Tabla externa
fr: Table étrangère
it: Tabella della chiave esterna
ja: 外部テーブル
pt_br: Tabela Estrangeira
ru: Внешняя таблица

# ++CODE++328923e4274282cae8dc3222c0281c6454f9625843394b33364bfb4213436f1a
source: Foreign key '{0}' already exists
es: La clave externa "{0}" ya existe
fr: La clé étrangère « {0} » existe déjà
it: La chiave esterna '{0}' esiste già
pt_br: A chave estrangeira ''{0}'' já existe
ru: Внешний ключ "{0}" уже существует

# ++CODE++936af734b4badd8602cb27237f8dea0fd3950e12b5bab278565babc15e854136
source: Found pending reconnect promise for uri {0}, failed.
es: Se encontró una promesa de reconexión pendiente para el uri {0}, error.
fr: Promesse de reconnexion en attente trouvée pour l’URI {0}, échec.
it: Trovata promessa di riconnessione in sospeso per l'URI {0}, non riuscita.
ja: URI {0} の保留中の再接続 Promise が見つかりましたが、失敗しました。
pt_br: A promessa de reconexão pendente foi encontrada para o URI {0}, com falha.
ru: Найдено ожидающее обещание повторного подключения для URI {0}, сбой.

# ++CODE++463124bedefc986e5dc0c3e34607c881ba0337297037552decc1df70945e57e8
source: Found pending reconnect promise for uri {0}, waiting.
es: Se encontró una promesa de reconexión pendiente para el uri {0}, en espera.
fr: Promesse de reconnexion trouvée en attente pour l’URI {0}.
it: Trovata promessa di riconnessione in sospeso per l'URI {0}, in attesa.
ja: URI {0} の保留中の再接続 Promise が見つかりましたが、待機中です。
pt_br: Encontrada uma promessa de reconexão pendente para o URI {0}, aguardando.
ru: Найдено ожидающее обещание повторного подключения для URI {0}, ждем.

# ++CODE++fc70e7e548649aa12095a141703b67943b4437de990082c3646b3ab61884dcf0
source: Found {0} saved connection profile(s).
es: Se encontraron {0} perfiles de conexión guardados.
it: Trovati {0} profili di connessione salvati.
ru: Найдены сохраненные профили подключений ({0}).

# ++CODE++bb2f46cfafa54c18afeb7e7efc7ccf3b2d72b160c0381d2ad116e8f7139be42d
source: Freeze columns
es: Inmovilizar columnas
it: Blocca colonne
ru: Закрепить столбцы

# ++CODE++c910d474dcd724bff83ddedeb06bf1eceaf9fb3af7c76bb282be057f36e6dffa
source: General
fr: Général
it: Generale
pt_br: Geral
ru: Общее

# ++CODE++e6fcb24896423f9739a20e841d3c3f2ab319f222be60b150ed664e611be89ed4
source: General Options
es: Opciones generales
fr: Options générales
it: Opzioni generali
pt_br: Opções Gerais
ru: Общие варианты

# ++CODE++e7789e4d6916633a7461743194a10f2bc4d20b06c2e329b35c7a2da87aa8cbae
source: Generate Script
es: Generar script
fr: Générer le script
it: Genera script
ja: スクリプトの生成
pt_br: Gerar Script
ru: Сгенерировать скрипт

# ++CODE++733db825a41becaf624d0bcff31bacf744e7bcdb3412fffbb0fb12afdd89a1a8
source: Generate mock data and seed scripts to support testing and development environments
es: Generar datos de prueba y scripts de inicialización para apoyar los entornos de desarrollo y pruebas
it: Genera dati fittizi e script di seeding per supportare gli ambienti di test e sviluppo
ru: Генерируйте фиктивные данные и скрипты присвоения начальных значений для поддержки сред тестирования и разработки

# ++CODE++9a4a3cac279fe491c4cbc6a0e945d2e031dc2e925b98ae7f0676646d74547e82
source: Generate script to deploy changes to target
es: Generar script para implementar cambios en el destino
fr: Générer un script pour déployer les changements sur la cible
it: Genera script per distribuire le modifiche nella destinazione
pt_br: Gerar script para implantar alterações no destino
ru: Создать сценарий для развертывания изменений в целевом объекте

# ++CODE++553f9778e20ce771fa5313659bcd804d36168900a284dde2d5f1cf7e1f43446b
source: Generate sqlpackage command
it: Generare il comando sqlpackage
ru: Создать команду sqlpackage

# ++CODE++15bb1f371098735851e4d1d531c37e3652b2ceaf16055231f0a38312650cb08b
source: Generating Report. This may take a while...
es: Generar informe. Esto puede tardar un rato...
fr: Génération du rapport. Cela peut prendre du temps...
it: È in corso la generazione del report. L'operazione potrebbe richiedere del tempo...
ru: Создание отчета. Это может занять некоторое время...

# ++CODE++019c93d8e0baa64c24b53c1e6f34c8faa0fcac26a0ac69fdaa46b788f6c05912
source: Generating report, this might take a while...
es: Generando informe, esto puede tardar un rato...
fr: Génération du rapport en cours. Cela peut prendre un certain temps...
it: Generazione del report in corso. Questa operazione potrebbe richiedere del tempo...
pt_br: Gerando relatório, isso pode demorar um pouco...
ru: Создание отчета. Это может занять некоторое время...

# ++CODE++915fc447c859d56fa8e745484ac300e07e104e9ef318105f82b578bedf32c405
source: Generating script...
es: Generando el script...
it: Generazione script in corso...
ru: Создание скрипта...

# ++CODE++fddd3d1537452414b2a4c7bb1b231ca37398b9f211c1e0d8d80e6f69a7f58f2d
source: Get Connection Details
es: Obtener los detalles de la conexión
fr: Obtenir les informations sur la connexion
it: Ottieni i dettagli della connessione
ru: Получить детали подключения

# ++CODE++983f311018642b0ae60c71253b5735579906d43d260ea926ebe5e815b1c97abb
source: Get Started
es: Introducción
fr: Prise en main
it: Attività iniziali
ru: Начало работы

# ++CODE++8d931bb4019cd9ff4b45813baec027a9d80f9e353afc37d6643cc9ff6737997e
source: Get connection details for connection '{0}' (ID: {1})?
es: ¿Desea obtener los detalles de conexión para la conexión "{0}" (id.: {1})?
it: Ottenere dettagli di connessione per la connessione "{0}" (ID: {1})?
ru: Получить детали подключения для "{0}" (ИД: {1})?

# ++CODE++a43e5c073e9835ad6459998e88e6ad71d7b49f1a2fb3d0cd076b5bc0e1724fa7
source: Get security-related recommendations, such as avoiding SQL injection or excessive permissions
es: Obtener recomendaciones relacionadas con la seguridad, como evitar la inyección SQL o permisos excesivos
it: Ricevi raccomandazioni sulla sicurezza, ad esempio come evitare l'SQL injection o autorizzazioni eccessive
ru: Получайте рекомендации по безопасности, например о том, как избежать внедрения кода SQL или избыточных разрешений

# ++CODE++455754ccf3a6df55b0fe352903062c9adb22d5ce025f6c0b0b8b2a59c6e3a7fc
source: Getting Docker Ready...
es: Preparando Docker...
fr: Préparation de Docker...
it: Preparazione di Docker...
ru: Подготовка Docker...

# ++CODE++d6d1dc00ba08494d29eb2fb1a62a7b312e2a89c23b818493f1f3eec3167d54b9
source: Getting Fabric database '{0}'
es: Obteniendo la base de datos de Fabric '{0}'
it: Recupero del database di Fabric '{0}'
ru: Получение базы данных Fabric "{0}"

# ++CODE++4f2809d46e4d5ae64171f0a386b32412184dbf2ea9fb08956f407bed421b7bea
source: Getting Fabric workspace '{0}'
es: Obteniendo el área de trabajo de Fabric '{0}'
it: Recupero dell'area di lavoro Fabric '{0}'
ru: Получение рабочей области Fabric "{0}"

# ++CODE++d00eca1bae6742803906ab42a831e8b5396d15b6573ea13c139ec31631208ec1
source: Getting Started
es: Introducción
it: Attività iniziali
ru: Начало работы

# ++CODE++c486fe9fb4a7835ef55e4e3a8ef2f6443e3c9af800f24d301e95267065573dc1
source: Getting connection details for connection '{0}' (ID: {1})
es: Obteniendo detalles de conexión para la conexión "{0}" (Id.: {1})
it: Acquisizione dei dettagli di connessione per la connessione "{0}" (ID: {1})
ru: Получение деталей подключения для "{0}" (ИД: {1})

# ++CODE++7c6ecb13b6127990792bdb4cd61037a4d398bcda0034b4e9d23af714a5785c85
source: Getting connection string for SQL Endpoint '{0}' in workspace '{1}'
es: Obteniendo la cadena de conexión para el punto de conexión de SQL '{0}' en el área de trabajo '{1}'
it: Recupero della stringa di connessione per l'endpoint SQL '{0}' nell'area di lavoro '{1}'
ru: Получение строки подключения для конечной точки SQL "{0}" в рабочей области "{1}"

# ++CODE++407c9ce5c11270b1d15836456ad1efdbe70f71f3c845186e535f82f02112be4e
source: Getting container ready for connections
es: Preparando el contenedor para las conexiones
fr: Préparation du conteneur pour les connexions
it: Preparazione del contenitore per le connessioni
ru: Подготовка контейнера для подключений

# ++CODE++bccb449867268397632519e5695a6bb611a30529b735cac4f7d5ecbaee80e785
source: Getting definition ...
es: Obteniendo la definición...
fr: Obtention de la définition...
it: Recupero della definizione...
ja: 定義を取得中...
pt_br: Obtendo definição...
ru: Получаем определение…

# ++CODE++4ca83197033d1e5e20827525979b5a9323123783e32732e26731412bc6d59ce7
source: GitHub Copilot - VS Code walkthrough
it: GitHub Copilot - Procedura dettagliata VS Code
ru: GitHub Copilot — пошаговое руководство по VS Code

# ++CODE++737f47ca3f9975103a99da74b37a986e6a1e97b77817a154b27d53d840a9a599
source: GitHub Copilot integration
it: Integrazione di GitHub Copilot
ru: Интеграция GitHub Copilot

# ++CODE++f311c2fb4a90d31362e0c6578ce52cd4b6200755caf41040acf39fc9ea6ed487
source: GitHub Copilot survey
it: Sondaggio GitHub Copilot
ru: Опрос GitHub Copilot

# ++CODE++60c3ae4830143b646d9d70611c2ad5961faeca804e4713b5b768087167d1772b
source: Got invalid tool use parameters: "{0}". ({1})
es: Se obtuvieron parámetros de uso de herramienta no válidos: "{0}". ({1})
fr: Nous avons obtenu des paramètres d’utilisation d’outil non valides : « {0} ». ({1})
it: Parametri di utilizzo dello strumento non validi: "{0}". ({1})
ru: Получены недопустимые параметры использования инструмента: "{0}". ({1})

# ++CODE++774b3dff4a0e941fad0742c915bd93885c9cb15f769f2c92c2ea384b69780f51
source: Greater Than
es: Mayor que
fr: Supérieur à
it: Maggiore di
ja: 指定値より大きい
pt_br: Maior Que
ru: Больше

# ++CODE++0ca098e2022c5054b1ec77c08df3f3b1d5ccecfbf78f232071f644eb71161e8d
source: Greater Than or Equals
es: Mayor o igual que
fr: Supérieur ou égal à
it: Maggiore o uguale a
pt_br: Maior ou Igual a
ru: Больше или равно

# ++CODE++1fbcaddaa36260ff8a3c55cb7b0f95813cba07fbe56173e8a47a7099dcae75b6
source: Greater than
es: Mayor que
it: Maggiore di
ru: Больше

# ++CODE++85d08e84787824d6a0d1f70c740cbd8be8b0a2ffe54d329dc4202e867d283454
source: Greater than or equal to
es: Es mayor o igual que
it: Maggiore o uguale a
ru: Больше или равно

# ++CODE++38ee89c32a2a983a8b02689b35c8cdb60f5d9949c4e128a77cc3e79785c02b51
source: Grid View
es: Vista Cuadrícula
fr: Affichage en mode grille
it: Visualizzazione Griglia
ru: Представление сетки

# ++CODE++956a51f6b098a41b7c3108015f0790bb24af7693717b07cee39d5df6a5da1826
source: Group by
es: Agrupar por
it: Raggruppa per
ru: Группировать по

# ++CODE++b79cac926e0b2e347e72cc91d5174037c9e17ae7733fd7bdb570f71b10cd7bfc
source: Help
es: Ayuda
fr: Aide
it: Guida
ja: ヘルプ
pt_br: Ajuda
ru: Справка

# ++CODE++fe44c8ac09e3996f71f7153cac29fe00113075f95611f98e76cf3aae6232d0dd
source: Help us improve by sharing your thoughts.
it: Aiutaci a migliorare condividendo le tue opinioni.
ru: Помогите нам стать лучше, поделившись своими мыслями.

# ++CODE++e05cee2e915ff0d693e5f5acff33d2a7cabfc340e7a977e993a6cf92fb686f4e
source: Hide Confirm Password
es: Ocultar confirmar contraseña
it: Nascondi Conferma password
ru: Скрыть подтверждение пароля

# ++CODE++44900cb30578cbda86187326c4e7acfddc7828094583ff5d097f6080464aa6fc
source: Hide New Password
es: Ocultar nueva contraseña
it: Nascondi nuova password
ru: Скрыть новый пароль

# ++CODE++f499a7a9c57676d65af8383d5a0f6c5d6b649bb599235e6e20900f73a55968bd
source: Hide Script
es: Ocultar script
it: Nascondi script
ru: Скрыть скрипт

# ++CODE++c646b55d1fd317086a616548a2cc0b1606ecdc5a99bd2d3dcb43368fcb37ad30
source: Hide column
es: Ocultar columna
it: Nascondi colonna
ru: Скрыть столбец

# ++CODE++89276817789cad555d1e4daf6c6e0b6eac110c7073bd4b23e08ef8a6e7aad4c6
source: Hide full error message
es: Ocultar mensaje de error completo
fr: Masquer le message d’erreur complet
it: Nascondi messaggio di errore completo
ru: Скрыть полное сообщение об ошибке

# ++CODE++a60a56c584b3b05b1a95076a36edbab7131a447910cf21124efcb35f769502df
source: Hide password
es: Ocultar contraseña
fr: Masquer le mot de passe
it: Nascondi password
ru: Скрыть пароль

# ++CODE++7a364dd1e84a9c227a255eac46ca09a24bf78df77f50f95dec04e8899516908d
source: Hide this panel
es: Ocultar este panel
fr: Masquer ce panneau
it: Nascondi questo pannello
pt_br: Ocultar esse painel
ru: Скрыть эту панель

# ++CODE++881cda150f08bbb74d0fa62b161f8a953cf0e98bf734b60d0e059b408b75522b
source: Highlight Expensive Operation
es: Resaltar operación costosa
fr: Mettre en surbrillance l’opération coûteuse
it: Evidenzia operazione costosa
ja: 負荷の高い操作を強調表示する
pt_br: Realçar Operação Cara
ru: Выделить ресурсоемкую операцию

# ++CODE++2db533557011ec539fc4c6604367e99cbb77c0a49b8b73b655841d3ee08f4f3e
source: Hostname
es: Nombre de host
fr: Nom d’hôte
it: Nome host
ru: Имя узла

# ++CODE++cdcc527989217aea79f51128ad3c86fa74d6c9def496f199f6b8d9728791d3b4
source: How likely it is that you would recommend the MSSQL extension to a friend or colleague?
es: ¿Qué probabilidad hay de que recomiende la extensión MSSQL a un amigo o compañero de trabajo?
fr: Quelle est la probabilité que vous recommandiez l’extension MSSQL à un(e) ami(e) ou à un(e) collègue ?
it: Quanto è probabile che si consigli l’estensione MSSQL a un amico o un collega?
pt_br: Qual é a probabilidade de você recomendar a extensão MSSQL para um amigo ou colega?
ru: Какова вероятность, что вы порекомендуете расширение MSSQL друзьям или коллегам?

# ++CODE++31a89f9bfc36d6f9ecf0a7e2e82cb5a9a0f1e7b1702f08bd3aced239c4f48a0b
source: How likely it is that you would recommend {0} to a friend or colleague?
es: ¿Qué probabilidad hay de que recomiende {0} a un amigo o compañero?
fr: Quelle est la probabilité pour que vous recommandiez {0} à un(e) ami(e) ou à un(e) collègue ?
it: Quanto è probabile che si consigli {0} a un amico o un collega?
pt_br: Qual é a probabilidade de você recomendar o {0} a um amigo ou colega?
ru: Какова вероятность, что вы порекомендуете {0} друзьям или коллегам?

# ++CODE++42e746a45011321b661459a4a5bff6312360244050814e0813284fb729dfc90d
source: How many tables are in this database?
es: ¿Cuántas tablas hay en esta base de datos?
it: Quante tabelle contiene il database?
ru: Сколько таблиц в этой базе данных?

# ++CODE++4d7056f0e9bef4870b289d7b77634cead0e646a63708a1eb500c6eab11c1328e
source: Hue
es: Matiz
fr: Teinte
it: Tonalità
ru: Оттенок

# ++CODE++9638b09db2ce74e3d600f9a512a6116df9ba9b3a147569930a5d5b4682ac5a20
source: I have read the summary and understand the potential risks.
es: He leído el resumen y entiendo los posibles riesgos.
fr: J’ai lu le résumé et compris les risques potentiels.
it: Ho letto il riepilogo e ho compreso i potenziali rischi.
ja: 概要を読み、潜在的なリスクを理解しました。
pt_br: Li o resumo e entendo os riscos potenciais.
ru: Я прочел сводку и понимаю возможные риски.

# ++CODE++d8d462ddc91939459ae107d47fee7a34b3601b20fcd01615f98e1941674f14ea
source: I'm sorry, I can only assist with SQL-related questions.
es: Lo siento, solo puedo ayudar con preguntas relacionadas con SQL.
fr: Je suis désolé... Je ne peux vous aider qu’avec les questions liées à SQL.
it: È possibile fornire assistenza solo per le domande correlate a SQL.
ru: Извините, я могу помочь только по вопросам, связанным с SQL.

# ++CODE++b37cea142b959c4f6c75754d7b3d56bc41d1a2d6667600c748d7a168f10c8818
source: Ignore Options
es: Ignorar opciones
it: Ignora opzioni
ru: Игнорировать параметры

# ++CODE++1d59e3e131d04ce9ba04c0f297dbd4eddb83c0bfe977b2a6bf19bdeb73f2d5c3
source: Ignore Tenant
es: Omitir inquilino
fr: Ignorer le locataire
it: Ignora tenant
ja: テナントの無視
pt_br: Ignorar Locatário
ru: Игнорировать клиента

# ++CODE++c4a77afa3d5cd701f32b5f09c195c635b256db8595687828c3ea0785ab5b72f4
source: Image tag
es: Etiqueta de imagen
it: Tag immagine
ru: Тег образа

# ++CODE++09b493255c6cc11aae4f73f97494b4d0123bb42869372d0a2182f0a324eb5ef5
source: Import BACPAC
es: Importar BACPAC
it: Importa BACPAC
ru: Импорт BACPAC

# ++CODE++004f8760d5d76c5e1465f93ee7c48c0dd97666347f270fbbc9d31bbc56482a6d
source: Import a .bacpac file to a new or empty database
es: Importar un archivo .bacpac a una base de datos nueva o vacía
it: Importare un file con estensione bacpac in un database nuovo o vuoto
ru: Импорт файла BACPAC в новую или пустую базу данных

# ++CODE++e06eac7e7960029aa3e9849f6e1d9316e9bf7f143c1fb634dd0a2b3391e373f1
source: Import anyway
it: Importare comunque
ru: Все равно импортировать

# ++CODE++2e8e2a40f8096590ad749613dff43e0ffb3a0dae652f82c93d12d1248b1e28b8
source: Import complete. You can close this dialog.
it: Importazione completata. È possibile chiudere questa finestra di dialogo.
ru: Импорт выполнен. Это диалоговое окно можно закрыть.

# ++CODE++21ab0ed2ec6f107c8269eeca5ca446ab5d4d5908753a18676d09c362e478fdc3
source: Import failed: {0}
it: Importazione non riuscita: {0}
ru: Не удалось выполнить импорт: {0}

# ++CODE++ab74c7fb2fef1b04b1e8fed7e0a32350fffa22538a2ce63d3b70e5c83dfd0d8b
source: Import from Azure Data Studio
it: Importa da Azure Data Studio
ru: Импорт из Azure Data Studio

# ++CODE++f12310620d6f87e759ba952d49c66c25457a44fb9231a08c9e5f9ce40324f88e
source: Import selected
it: Importare selezionati
ru: Импортировать выбранные элементы

# ++CODE++3fc78b5e12952afa58a49beceabae7348dd0a44be1b9104b998dc1efc2967de4
source: Importance
es: Importancia
it: Importanza
ja: 重要度
pt_br: Importância
ru: Важность

# ++CODE++6ef88827ba30503ec0beb5b6cc6801a9f9f1b0dd11d47de6f30e57fce50a7f63
source: Importing BACPAC...
es: Importando BACPAC...
it: Importazione di BACPAC in corso...
ru: Импорт BACPAC...

# ++CODE++addd610c6d7490077d732bef42a410cdb12538afd39f1bbdc7a3942f39222645
source: Importing selections
it: Importazione delle selezioni
ru: Импорт выбранных элементов

# ++CODE++edc1807b28e26d830c47aea48d193d0a4a8d3f07dfc4cb3b11f43eabe698f01e
source: In case you missed it
it: Nel caso te lo fossi perso
ru: Если вы пропустили

# ++CODE++c1f88e9d6c4145cf0530ae020155384d5688d70ed82a07a35d783bbc4b32238c
source: In progress
es: En curso
fr: En cours
it: In corso
ja: 処理中
pt_br: Em andamento
ru: Выполняется

# ++CODE++7285576bdacf86fe37274d3d0d399c29b4be2959005f60ac0729615d8fca9186
source: Include
es: Incluir
fr: Inclure
it: Includi
pt_br: Incluir
ru: Включить

# ++CODE++e6918522718725ba7a74b087c48f889648bbfc7627b1d4ab826ac2cc1b30aa31
source: Include Object Types
es: Incluir tipos de objeto
fr: Inclure les types d’objets
it: Includi tipi di oggetto
pt_br: Incluir os Tipos de Objetos
ru: Включить типы объектов

# ++CODE++ac665fafc5f9732c9d322749a1f726be51f8b31d2ec83ecde83a6e1d2b632eda
source: Include all object types
es: Incluir todos los tipos de objeto
fr: Inclure tous les types d’objets
it: Includi tutti i tipi di oggetti
ru: Включить все типы объектов

# ++CODE++a19caa35e133f5a0e94975762741c4c73b09c8a830908934206474fea30817b0
source: Incomplete or orphaned connections
it: Connessioni incomplete o orfane
ru: Неполные или потерянные подключения

# ++CODE++39c3be1198a2fddf18d03608348d9cfaf8823d2dda4d5ff13fdb851bd15d29ea
source: Index
es: Índice
it: Indice
ja: インデックス
pt_br: Índice
ru: Индекс

# ++CODE++90b901a30c3f089e10d82e1b842bbdc736a36b536a19d207b36a8e7be1904dcb
source: Indexes
es: Índices
fr: Index
it: Indici
ja: インデックス
pt_br: Índices
ru: Индексы

# ++CODE++7d5a4174a3753666f30d8be2beadced4087df37a4af22a189e7b5abc55e1c382
source: Initializing DAB configuration...
it: Inizializzazione della configurazione DAB in corso...

# ++CODE++9d044dc2d1fe411614adccd3125e540b1b0176ec4bf30509e693113050ef11b0
source: Initializing comparison, this might take a while...
es: Inicializando la comparación, esto puede tardar un rato...
fr: Initialisation de la comparaison. Cette opération peut durer un certain temps...
it: Inizializzazione del confronto. L'operazione potrebbe richiedere qualche istante...
pt_br: Inicializando comparação. Isso pode demorar um pouco...
ru: Инициализируется сравнение. Это может занять некоторое время.

# ++CODE++8aa318eb7eaa233aada0d332bec14cb6a631c8fda25deb2c7d4f402888f1b1e2
source: Insert
es: Insertar
fr: Insérer
it: Inserisci
ru: Вставить

# ++CODE++336a8af254446c5c9006e090f430a9f283960aeefdd0dc52cf0401fa2c19ac03
source: Install Docker
es: Instalar Docker
fr: Installer Docker
it: Installa Docker
ru: Установить Docker

# ++CODE++23175b00048139605147500e1f2eb6c43b4e938ee3dbcfebb00ae6b472284cdb
source: Instant Container Setup
es: Configuración instantánea del contenedor
fr: Configuration instantanée du conteneur
it: Configurazione immediata del contenitore
ru: Мгновенная настройка контейнера
