Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++4c4d50191531a82f528c2802cf6b245d0c776a5d4b51d3b5da127aaf21728547
source: To use this command, Open a .sql file -or- Change editor language to "SQL" -or- Select T-SQL text in the active SQL editor.
es: Para usar este comando, abra un archivo .sql, cambie el lenguaje del editor a "SQL" o seleccione el texto T-SQL en el editor SQL activo.
fr: Pour utiliser cette commande, ouvrez un fichier .sql ou remplacez le langage de l’éditeur par « SQL » ou sélectionnez le texte T-SQL dans l’éditeur SQL actif.
it: Per usare questo comando, aprire un file con estensione sql oppure impostare il linguaggio dell'editor su "SQL" o selezionare il testo T-SQL nell'editor SQL attivo.
ja: このコマンドを使用するには、アクティブな SQL エディターで、.sql ファイルを開くか、エディターの言語を "SQL" に変更するか、T-SQL テキストを選択してください。
pt_br: Para usar este comando, abra um arquivo .sql, altere a linguagem do editor para "SQL" ou selecione o texto T-SQL no editor SQL ativo.
ru: Для использования этой команды откройте файл SQL, или измените языковой режим окна редактора на "SQL", или выберите текст T-SQL в активном окне редактора SQL.

# ++CODE++e53c65fb2c5014c76bacb8ae7e110d59e8f5a57507db2682d0bd4fdbd156c8f4
source: To use this command, you must set the language to "SQL". Confirm to change language mode.
es: Para usar este comando, debe establecer el lenguaje como "SQL". Confirme para cambiar el modo de lenguaje.
fr: Pour utiliser cette commande, vous devez définir le langage sur « SQL ». Confirmez pour changer de mode de langage.
it: Per usare questo comando, è necessario impostare il linguaggio su "SQL". Confermare per cambiare la modalità del linguaggio.
ja: このコマンドを使用するには、"SQL" に言語を設定する必要があります。言語モードの変更を確認してください。
pt_br: Para usar este comando, você deve definir a linguagem para "SQL". Confirme para alterar o modo de linguagem.
ru: Для использования этой команды в качестве языкового режима необходимо указать "SQL". Подтвердите изменение языкового режима.

# ++CODE++7f7e4a15a53ef424a17c5a29ba96b05d66d8fb6eb49fffe24fc86d970b50a7aa
source: Toggle Sort
es: Alternar ordenación
it: Attiva/Disattiva ordinamento
ru: Переключить сортировку

# ++CODE++0ffe6ba8fd16d1d71a8849f6707c1c14c97e7f110138c102351a5560a97a43b4
source: Toggle Tooltips
es: Alternar información sobre herramientas
fr: Activer/désactiver les info-bulles
it: Attiva/Disattiva descrizioni comando
ja: ツールヒントの切り替え
pt_br: Ativar/Desativar Dicas de Ferramentas
ru: Переключение подсказок

# ++CODE++ffe32a004b062d5e8252cac4729963ba6ff129023ea0b33c6aa3f0a9e725f157
source: Toggle dark mode
es: Alternar modo oscuro
it: Attiva/disattiva modalità scura
ru: Переключить темный режим

# ++CODE++0205dc96a474c1b5b12fadd44fb599a3d78af60d697f6136e7e21a51d9f29579
source: Toggle filter row
es: Alternar fila de filtro
it: Attiva/disattiva riga filtro
ru: Переключить строку фильтра

# ++CODE++c8c86447a74a9d36167b90e7c4359908771623e1bb592636feb58962bdee02f1
source: Toggle pre-header row
es: Alternar fila previa al encabezado
it: Attiva/disattiva riga pre-intestazione
ru: Переключить строку предзаголовков

# ++CODE++7d4d6138cf85c51e38656f86216b716e449fe20eb0d14ea074601e691241bedb
source: Toggle selection for {0}
it: Attivare/disattivare la selezione per {0}
ru: Выбрать подключение "{0}" или отменить выбор

# ++CODE++909717fe342b115370e475a3dde87aa1db0db4fa6012b92b3a87386b6654e236
source: Toggle selection for {0}
it: Attivare/disattivare la selezione per {0}
ru: Выбрать группу "{0}" или отменить выбор

# ++CODE++10b7ff2efd404627d5a929c6fb2a97fa57867f169fbf1016834477571a4cedb2
source: Tool lookup for: {0} - {1}.
es: Búsqueda de herramientas para: {0} - {1}.
fr: Recherche d’outil pour : {0} – {1}.
it: Ricerca strumento per: {0} - {1}.
ru: Поиск инструмента для: {0} – {1}.

# ++CODE++048652e110f74b298095b5a7123e8878dfbd665a9fa34991b269dd31ab9442d0
source: Total execution time: {0}
es: Tiempo total de ejecución: {0}
fr: Durée totale d’exécution : {0}
it: Tempo di esecuzione totale: {0}
ja: 総実行時間: {0}
pt_br: Tempo total de execução: {0}
ru: Общее время выполнения: {0}

# ++CODE++3018218f5b66be1c5027fdc1d75389f30f30ac7cfa00c77c3453790d8830dc9a
source: Total rows to fetch:
es: Total de filas que se van a capturar:
it: Totale righe da recuperare:
ru: Всего строк для получения:

# ++CODE++fe69511137842f6fddcfcc1e96e39bf6920b5ed00251ec6549d79463928b2e0c
source: Try it
es: Probar
it: Prova
ru: Попробовать

# ++CODE++baaddf70fb5d432b8bd948ef91d6f910124a6d138edae4d5f000c4610ddc8eae
source: Type
es: Tipo
it: Tipo
ja: 種類
pt_br: Tipo
ru: Тип

# ++CODE++e395097d9cde221cdb9af8b04e1073d0d3394439fce660d1c954d012cdeae6c1
source: Unable to execute the command while the extension is initializing. Please try again later.
es: No se puede ejecutar el comando mientras se está inicializando la extensión. Vuelva a intentarlo más tarde.
fr: Impossible d’exécuter la commande pendant l’initialisation de l’extension. Veuillez réessayer plus tard.
it: Non è possibile eseguire il comando durante l'inizializzazione dell'estensione. Riprovare più tardi.
ja: 拡張機能の初期化中はコマンドを実行できません。後でもう一度お試しください。
pt_br: Não é possível executar o comando enquanto a extensão está inicializando. Tente novamente mais tarde.
ru: Невозможно выполнить команду в процессе инициализации расширения. Повторите попытку позже.

# ++CODE++30f9be31de0326b58d28b9578bd91145abf4047074018ac47bc845f960328167
source: Unable to expand. Please check logs for more information.
es: No se puede expandir. Consulte los registros para obtener más información.
fr: Impossible de développer. Pour plus d’informations, consultez les journaux.
it: Non è possibile espandere. Per altre informazioni, vedere i log.
ja: 展開できません。詳細については、ログをご確認ください。
pt_br: Não é possível expandir. Verifique os logs para obter mais informações.
ru: Не удалось развернуть. Подробнее см. в журналах.

# ++CODE++955b62784673f0081b2a54d867245fa50ca1e830cea22348ff69caa6317e7889
source: Unable to open Table Explorer: No target node provided.
es: No se puede abrir el explorador de tabla: no se proporcionó ningún nodo de destino.
it: Non è possibile aprire Esplora tabelle: nessun nodo di destinazione specificato.
ru: Не удалось открыть обозреватель таблиц: не указан целевой узел.

# ++CODE++582be79ed5a63b2569e2b21a28ab0fe1f7acc6307aaaa8e52510a647959d05fa
source: Unable to read proxy agent options to get tenants.
es: No se pueden leer las opciones del agente proxy para obtener inquilinos.
fr: Impossible de lire les options de l’agent proxy pour obtenir les locataires.
it: Non è possibile leggere le opzioni dell'agente proxy per ottenere i tenant.
pt_br: Não é possível ler as opções do agente proxy para obter locatários.
ru: Не удалось прочитать параметры прокси-агента для получения клиентов.

# ++CODE++d7d09d502d5422aa5c2aaffacea9601c1011d9035e27986c8b243078a745b061
source: Understand and document business logic embedded in stored procedures, views, and functions
es: Comprender y documentar la lógica de negocio integrada en procedimientos almacenados, vistas y funciones
it: Interpreta e documenta la logica di business incorporata nelle stored procedure, visualizzazioni e funzioni
ru: Анализируйте и документируйте бизнес-логику, внедренную в хранимые процедуры, представления и функции

# ++CODE++a8283ade31856f71220db0e6f60a257c6889dc4dad0f275f66ad44b9ed9bf8d5
source: Undo
es: Deshacer
fr: Annuler
it: Annulla
ru: Отменить

# ++CODE++0c79e1387ac8034b8d51c64dd2349fe325ba5b03148a5eef241e5d0e77096b1a
source: Unfreeze columns
es: Liberar columnas
it: Sblocca colonne
ru: Снять закрепление столбцов

# ++CODE++1ebcd18ec5b7a5eccd5f9487c9802a107114658c58a9efdb016830f644d20f0d
source: Unfreeze columns/rows
es: Liberar columnas o filas
it: Sblocca colonne/righe
ru: Снять закрепление столбцов/строк

# ++CODE++bc19db3033b4d043992ebb6270192c658a14dcfc582aa3b03d07e4b1c688808e
source: Unknown Connection
es: Conexión desconocida
it: Connessione sconosciuta
ru: Неизвестное подключение

# ++CODE++0ac22ebf2e4c548e6b1f01b79672929184e0626822b651ceba6766f880cc2d27
source: Unknown account
it: Account sconosciuto
ru: Неизвестная учетная запись

# ++CODE++27c2ccd962c2b8dccb52fe3688ab236f186f7a41fd57d810478712048e9ad3f8
source: Unknown error
es: Error desconocido
it: Errore sconosciuto
ru: Неизвестная ошибка

# ++CODE++47910f2afddaf1712b164656a035d7fd1f09b784038c43c65b190ea778c68f58
source: Unknown object management dialog.
it: Finestra di dialogo di gestione oggetto sconosciuto.

# ++CODE++b9d28c62097f29ab65a3fda8317e0097e19e27393e9c6d6d96e88f4e20367a64
source: Unknown tenant ID
it: ID tenant sconosciuto
ru: Неизвестный идентификатор клиента

# ++CODE++e4dd0ac78c7663f350454bad4258d3b6d38971181470082487d131decc61880b
source: Unnamed Profile
es: Perfil sin nombre
it: Profilo senza nome
ru: Безымянный профиль

# ++CODE++a41927d919e273a317907b7f6817ca593d800bc0eb3262ff288630d157bb9448
source: Unsupported architecture for Docker: {0}
es: Arquitectura no admitida para Docker: {0}
fr: Architecture non prise en charge pour Docker : {0}
it: Architettura non supportata per Docker: {0}
ru: Архитектура не поддерживается для Docker: {0}

# ++CODE++0fca84e49ac02af373521c99fb0ff436c7908bd09697d4ff09b570441e3d81d5
source: Unsupported authentication type in connection string: {0}. Only SQL Login, Integrated, and Azure MFA authentication are supported.
es: Tipo de autenticación no admitido en la cadena de conexión: {0}. Solo se admiten el inicio de sesión de SQL, la autenticación integrada y la autenticación de Azure MFA.
it: Tipo di autenticazione non supportato nella stringa di connessione: {0}. Sono supportati solo account di accesso SQL e di autenticazione integrata o a più fattori di Azure.
ru: Неподдерживаемый тип проверки подлинности в строке подключения: {0}. Поддерживаются только вход SQL, интегрированная проверка подлинности и многофакторная проверка подлинности Azure.

# ++CODE++c074b14299b30a8058e3609567b5d799180ac9d267fdf56a931e7bda37b36b29
source: Unsupported platform for Docker: {0}
es: Plataforma no admitida para Docker: {0}
fr: Plateforme non prise en charge pour Docker : {0}
it: Piattaforma non supportata per Docker: {0}
ru: Платформа для Docker не поддерживается: {0}

# ++CODE++c1c1009d3f37ec058070a62e22caf9ac9dae2169d452487c5c271a8bcf57a291
source: Update
es: Actualizar
fr: Mettre à jour
it: Aggiorna
ru: Обновить

# ++CODE++6f32c6efd3fd051f5df8f5a6926828722e2734a8b2138751abf9363a674550bd
source: Update Database
es: Actualizar base de datos
fr: Mettre à jour la base de données
it: Aggiorna database
ja: データベースの更新
pt_br: Atualizar Banco de Dados
ru: Обновить базу данных

# ++CODE++e3f20e8be1b97880a4ce91df2a3a32d86e26db6188d0b1891376e1c076af2906
source: Update Script
es: Actualizar script
it: Aggiorna script
ru: Обновить скрипт

# ++CODE++92294188e79b2a13584eb3e6120f971c94ada2a387f3199a4cd3cb17039f9d37
source: Updating IntelliSense...
es: Actualizando IntelliSense...
fr: Mise à jour d’IntelliSense...
it: Aggiornamento di IntelliSense...
ja: IntelliSense を更新しています...
pt_br: Atualizando o IntelliSense...
ru: Обновляем IntelliSense...

# ++CODE++c83ce937073615b8c93e7c38ed529e567ff2c01f291f92e3b4d08245018f362b
source: Usage limits exceeded. Try again later, or consider optimizing your requests.
es: Límites de utilización superados. Inténtelo de nuevo más tarde o considere optimizar sus solicitudes.
fr: Les limites d’utilisation sont dépassées. Réessayez plus tard ou envisagez d’optimiser vos demandes.
it: Limiti di utilizzo superati. Riprovare più tardi o considerare la possibilità di ottimizzare le richieste.
ru: Превышены ограничения на использование. Попробуйте еще раз чуть позже или рассмотрите возможность оптимизации запросов.

# ++CODE++eeefe579e45c25e1a551b536d8eecc680562bce4d0aa58ffee1ad7df8cc84e63
source: Use T-SQL intellisense and syntax error checking on current document
es: Use la comprobación de errores de sintaxis e IntelliSense de T-SQL en el documento actual.
fr: Utiliser T-SQL IntelliSense et la vérification des erreurs de syntaxe sur le document actuel
it: Usa IntelliSense e il controllo degli errori di sintassi T-SQL nel documento corrente
ja: 現在のドキュメントで T-SQL インテリセンスと構文エラー チェックを使用する
pt_br: Usar o T-SQL IntelliSense e a verificação de erros de sintaxe no documento atual
ru: Использовать T-SQL IntelliSense и проверку синтаксиса на ошибки в текущем документе

# ++CODE++6fa7eeedfe2d3774f7d0d8fbb044c15710f171f58174bf7435ab1757e92d0c27
source: Use {0} to create a new connection.
es: Use {0} para crear una conexión nueva.
it: Usare {0} per creare una nuova connessione.
ru: Используйте {0} для создания нового подключения.

# ++CODE++f5e86af62d403420feae11b58a68c8df237889fb279d6a28cc08e11566ad5161
source: Used in API routes and responses
it: In uso nelle route e nelle risposte API
ru: Используется в маршрутах и ответах API

# ++CODE++b512d97e7cbf97c273e4db073bbb547aa65a84589227f8f3d9e4a72b9372a24d
source: User
es: Usuario
it: Utente
ru: Пользователь

# ++CODE++7967e089a7b94464ee1b0c6d4b8271e99bcf36f9e5481e40a5eec5c5a5108d01
source: User ID
it: ID utente
ru: ИД пользователя

# ++CODE++b82e11da3bc16786000d6e008e038f4d0272163a6476e0ca3c4b29d958051f9c
source: User name
es: Nombre de usuario
fr: Nom d’utilisateur
it: Nome utente
ja: ユーザー名
pt_br: Nome de usuário
ru: Имя пользователя

# ++CODE++d67e96ac435b6d4a9b9aedc12377ba5da6778e010fa1bd7e2942ed221ab16a4f
source: User name (SQL Login)
es: Nombre de usuario (inicio de sesión de SQL)
fr: Nom d’utilisateur (connexion SQL)
it: Nome utente (account di accesso SQL)
ja: ユーザー名 (SQL ログイン)
pt_br: Nome de usuário (logon do SQL)
ru: Имя пользователя (имя для входа SQL)

# ++CODE++bb6e451b4ca453ef7b93d4a89b702cde206029b5c57a46ac64072d7e909018c4
source: User name is required
es: El nombre de usuario es obligatorio
fr: Le nom d’utilisateur est obligatoire
it: Il nome utente è obbligatorio
ja: ユーザー名は必須です
pt_br: O nome de usuário é obrigatório
ru: Имя пользователя является обязательным

# ++CODE++e3b89e9d33f88e523083d8b4436adcc3726c89e97fd3179a2e102d765d1b16ed
source: Username
es: Nombre de usuario
it: Nome utente
ru: Имя пользователя

# ++CODE++1806851cf9209ecb674faf6fe227aa165f6dbc4df5d05ea9f0cc71e3d00245c7
source: Using {0} ({1})...
es: Usando {0} ({1})...
fr: Utilisation en cours de {0} ({1})...
it: Uso di {0} ({1})...
ru: Используется {0} ({1})...

# ++CODE++d31cf428966542cd931bd382d445f06e61e26c9a6c5aaf4227dffd0bfd18e97c
source: Using {0} to process your request...
es: Usando {0} para procesar la solicitud...
fr: Utilisation de {0} pour traiter votre demande...
it: Uso di {0} per elaborare la richiesta...
ru: Для обработки вашего запроса используется {0}...

# ++CODE++23a86f5a2daebf62665f27e6c911523cf8c7fa74b48dd330ca058d0285defb0c
source: Validation failed
es: Error de validación
it: Convalida non riuscita
ru: Проверка не пройдена

# ++CODE++acae50e95fddfac1fc564a334d7ccdd9442623a3e6fb58c935c2c6a2b98ee87b
source: Validation failed. Please check your inputs
es: Error de validación. Compruebe sus entradas
it: Convalida non riuscita. Verificare i dati inseriti
ru: Проверка не пройдена. Проверьте входные данные

# ++CODE++8e37953d23daca5ff01b8282c33f4e0a2152f1d1885f94c06418617e3ee1d24e
source: Value
es: Valor
fr: Valeur
it: Valore
ja: 値
pt_br: Valor
ru: Значение

# ++CODE++7ef8939f723e18dae31afe6a66699cdd093848ce10e84fcb5d34e15950cc2a06
source: Very Dissatisfied
es: Muy insatisfecho
fr: Très mécontent
it: Molto insoddisfacente
pt_br: Muito Insatisfeito
ru: Крайне не нравится

# ++CODE++421600005b3f0bef9188978d2e890f5c5ff1cdaafa4da92f07a52cdc6295c1c6
source: Very Satisfied
es: Muy satisfecho
fr: Très satisfait
it: Molto soddisfacente
pt_br: Muito Satisfeito
ru: Очень нравится

# ++CODE++15435b311c9371437109bd5323292504915507b034803118517fee44e9547a3c
source: View More
es: Ver más
fr: Afficher plus
it: Visualizza altro
ja: 表示数を増やす
pt_br: Exibir mais
ru: Показать больше

# ++CODE++ff01d2362e483ddaca44f0e7f02d280bef382c1a3209776e5a11ca21acf2cea4
source: View mssql for Visual Studio Code release notes?
es: ¿Desea ver mssql para Visual Studio Code notas de la versión?
fr: Afficher l’extension MSSQL pour les notes de publication Visual Studio Code ?
it: Visualizzare le note sulla versione di mssql per Visual Studio Code?
ja: mssql for Visual Studio Code リリース ノートを表示しますか?
pt_br: Exibir as notas sobre a versão do mssql para Visual Studio Code?
ru: Посмотреть примечания к выпуску mssql для Visual Studio Code?

# ++CODE++7b5b2bbcd1ff04bd807888af5196f4956355d5d4c3b7d23c190f98c572c80099
source: View roadmap
es: Ver plan de desarrollo
it: Visualizza roadmap
ru: Просмотреть дорожную карту

# ++CODE++572d3a23a2580a07174e5600a5b05a6c3a49820b9eaa3e150c0c43ccbdd76ab6
source: View, edit, add, and delete table rows in an interactive grid with real-time validation and live DML script previews.
it: Visualizza, modifica, aggiungi ed elimina righe di tabella in una griglia interattiva con la convalida in tempo reale e anteprime live degli script DML.
ru: Просматривайте, редактируйте, добавляйте и удаляйте строки таблиц в интерактивной сетке с проверкой в реальном времени и предварительным просмотром сценариев DML.

# ++CODE++0bfe6420924cc39134e0b79804ed823f99cc19ccd8e65477319db3139c1e3368
source: Visual Studio Code must be relaunched for this setting to come into effect. Please reload Visual Studio Code.
es: Visual Studio Code debe volver a iniciarse para que esta configuración entre en vigor. Vuelva a cargar Visual Studio Code.
fr: Visual Studio Code doit être relancé pour que ce paramètre entre en vigueur. Veuillez recharger Visual Studio Code.
it: È necessario riavviare Visual Studio Code per rendere effettiva questa impostazione. Ricaricare Visual Studio Code.
pt_br: O Visual Studio Code deve ser reiniciado para que essa configuração entre em vigor. Recarregue o Visual Studio Code.
ru: Чтобы этот параметр вступил в силу, необходимо перезапустить Visual Studio Code. Перезагрузите Visual Studio Code.

# ++CODE++e981ddae45d8f4ca53f1ccbe613ad254a041dacf65a06026099a6302d332113b
source: Warning
es: Advertencia
it: Avviso
ru: Предупреждение

# ++CODE++4d7371c8931fdd0178f7cbdabd1fd8260039a824a5c0912e880840b4d841f41e
source: Warnings detected. Please review the changes.
es: advertencias detectadas. Revise los cambios.
fr: Avertissements détectés. Veuillez examiner les modifications.
it: Avvisi rilevati. Rivedi le modifiche.
pt_br: Avisos detectados. Examine as alterações.
ru: Обнаружены предупреждения. Проверьте изменения.

# ++CODE++d7e723ab8286a6853d1f6fc0a59d215824e9ab149d391667863d3d3d46e91ad6
source: Watch demo
es: Ver demostración
it: Guarda la demo
ru: Посмотреть ролик

# ++CODE++5c3609430896d4699ab71dbb0b34c253b69d4cd07a22b6b890a29d6b7e0728a0
source: Watch demos on YouTube
es: Ver demostraciones en YouTube
it: Guarda demo su YouTube
ru: Смотреть демонстрации на YouTube

# ++CODE++d054fcb4284fd66975e378de56c04bda7b8e951e8e13f66834d9510e2b5461aa
source: We can't find where Docker Desktop is located on your machine. Please manually start Docker Desktop and try again.
es: No podemos encontrar dónde se encuentra Docker Desktop en el equipo. Inicie Docker Desktop manualmente e inténtelo de nuevo.
fr: Nous ne trouvons pas l’emplacement de Docker Desktop sur votre ordinateur. Veuillez démarrer le bureau Docker manuellement et réessayez.
it: Non è possibile trovare la posizione di Docker Desktop nel computer. Avviare manualmente Docker Desktop e riprovare.
ru: Не удалось найти Docker Desktop на компьютере. Запустите Docker Desktop вручную, затем повторите попытку.

# ++CODE++f0e54e5d12e2e2f5d8cf453857e0a307a8ecc5e8016b43b3c1c5c93300a40c60
source: We couldn't connect using the current connection information. Would you like to retry the connection or edit the connection profile?
es: No pudimos conectarnos con la información de conexión actual. ¿Quiere volver a intentar la conexión o editar el perfil de conexión?
fr: Nous n’avons pas pu nous connecter à l’aide des informations de connexion actuelles. Voulez-vous essayer de vous connecter à nouveau ou modifier le profil de connexion ?
it: La connessione non è possibile usando le informazioni di connessione correnti. Ritentare la connessione o modificare il profilo di connessione?
ru: Не удалось установить подключение, используя текущие сведения о подключении. Повторить попытку подключения или изменить профиль подключения?

# ++CODE++b88f26dec963b05be1fc4ad815cf0956a2b64c5c7819fc204857815fe8d596ae
source: What I can do for you:
es: Lo que puedo hacer por usted:
it: Cosa posso fare per te:
ru: Чем я могу помочь:

# ++CODE++bf3cd82434efadb9ea501ff44c7d52b0dd98b3d11c0097ba88a10b7fd14d9b54
source: What can we do to improve?
es: ¿Qué podemos hacer para mejorar?
fr: Que pouvons-nous faire pour nous améliorer ?
it: Cosa possiamo fare per migliorare?
pt_br: O que podemos fazer para melhorar?
ru: Что мы можем улучшить?

# ++CODE++4aa3356437232c6d45b29802f09eee6e201660a67cf78e145f39ad1fada6feab
source: Width cannot be 0 or negative
es: El ancho no puede ser 0 ni negativo
fr: La largeur ne peut pas être nulle ou négative
it: La dimensione non può essere 0 o negativa
ja: 幅を 0 または負にすることはできません
pt_br: A largura não pode ser 0 ou negativa
ru: Ширина не может быть отрицательной или равной 0

# ++CODE++8746aa4543652187c8719dbebc36f0609e31bbc53b14ed2ca12b0207c9e79345
source: Windows Authentication
es: Autenticación de Windows
it: Autenticazione di Windows
ru: Проверка подлинности Windows

# ++CODE++4c10fe506dfba55de4429a653b9f4b726797e9f52677db4e54d590165b8767e9
source: Works with VS Code/SSMS and uses Microsoft Entra authentication and Fabric access controls.
es: Funciona con VS Code y SSMS y utiliza la autenticación de Microsoft Entra y los controles de acceso de Fabric.
it: Funziona con VS Code/SSMS e usa l'autenticazione Microsoft Entra e i controlli di accesso di Fabric.
ru: Работает с VS Code/SSMS и использует проверку подлинности Microsoft Entra и элементы управления доступом Fabric.

# ++CODE++87bb59ba2f92f2a5a9f13e021fd58dd14ae5c065b1046146875e6e68d5ebc8b7
source: Workspace
es: Área de trabajo
it: Area di lavoro
ru: Рабочая область

# ++CODE++d53a5854df209c578705bfaec402128f2a44624d1e435ae700ef0f56c958c15e
source: Workspace is required
es: El área de trabajo es obligatoria
it: L'area di lavoro è obbligatoria
ru: Необходимо указать рабочую область

# ++CODE++e288577fddfc0fca255b96b887c869892311ba4f7ba0ecab34268b08e08d1ad3
source: Write, optimize, and troubleshoot SQL queries with AI-recommended improvements
es: Escribir, optimizar y solucionar problemas de consultas SQL con mejoras recomendadas por IA
it: Scrivi, ottimizza e risolvi i problemi delle query SQL con i miglioramenti consigliati dall'intelligenza artificiale
ru: Пишите и оптимизируйте запросы SQL, а также устраняйте их неполадки с помощью улучшений, рекомендованных ИИ

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
es: Sí
fr: Oui
it: Sì
ja: はい
pt_br: Sim
ru: Да

# ++CODE++4d58bf5bfe0aaf73306cc05df7a5ae7b1d136a347c493464f66e04cbf46c957d
source: You are about to deploy to an existing database. This operation will make permanent changes to the database schema and may result in data loss. Do you want to continue?
es: Va a implementar en una base de datos existente. Esta operación hará cambios permanentes en el esquema de la base de datos y puede causar pérdida de datos. ¿Desea continuar?
it: Stai per distribuire in un database esistente. Questa operazione apporterà modifiche permanenti allo schema del database e potrebbe causare la perdita di dati. Continuare?
ru: Вы собираетесь выполнить развертывание в существующей базе данных. Эта операция внесет постоянные изменения в схему базы данных и может привести к потере данных. Хотите продолжить?

# ++CODE++867d2664362bce58e979ee3de5b436d12ab50da730929367290fd6b9043b2a90
source: You are not connected to any database.
es: No está conectado a ninguna base de datos.
fr: Vous n’êtes connecté à aucune base de données.
it: Non si è connessi ad alcun database.
ru: Вы не подключены ни к одной базе данных.
