Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++56fd975f4cea21a748feabb6cb1cfb49161141245c2d4d1698cee7ae99c69bf2
source: Continue Editing
es: Continuar con la edición
fr: Poursuivre la modification
it: Continua modifica
ja: 編集を続行する
pt_br: Continuar Editando
ru: Продолжить редактирование

# ++CODE++8d525e5f158b9afe05f3122af363ac67763bdc4e1395b46597b320c289766ce3
source: Copied
es: Copiada
fr: Copié
it: Copiato
pt_br: Copiado
ru: Скопировано

# ++CODE++e21f935f11d7e966dbbae78da9daa378fe8142a14e7c0cd7434183005faa6c5c
source: Copy
es: Copiar
fr: Copier
it: Copia
ja: コピー
pt_br: Copiar
ru: Копировать

# ++CODE++7644dd0a33ff475c31116e369646b3410ca1463eb32dd1aabf3569f79cc02b4e
source: Copy As
es: Copiar como
it: Copia con nome
ru: Копировать как

# ++CODE++e172d8c5fbb864a5f85d4926588ef06167cdd4a29ddffdf07714bf25336c2269
source: Copy Headers
es: Encabezados de texto
fr: Copier les en-têtes
it: Copia intestazioni
pt_br: Copiar Cabeçalhos
ru: Копировать заголовки

# ++CODE++970a1f3493ca367ca4e95e0f203ef44c08040fa0563dd8b2cc2c9c69cf125da4
source: Copy Script
es: Copiar script
it: Copia script
ru: Копировать скрипт

# ++CODE++84f5172141bab484104cf73fd00dc9d1d9426606ec2f0a3785ede261956f1ed2
source: Copy Script to Clipboard
es: Copiar script en el Portapapeles
it: Copia script negli Appunti
ru: Копировать скрипт в буфер обмена

# ++CODE++ac030299960c4d5cba2b13fa5f358cb7f1b1531ce5f2e5315eff17b7c93a97bf
source: Copy as CSV
es: Copiar como archivo .csv
it: Copia come CSV
ru: Копировать как CSV

# ++CODE++5f7261cbf4eef17922f168d487b4e92de9bb9b118350254bfff4ea732bf0e1d9
source: Copy as IN clause
es: Copiar como cláusula IN
it: Copiare come clausola IN
ru: Копировать как предложение IN

# ++CODE++20e0663f2c175c2d6a5a11120ce06def7ecea5fd1cfb3cb837232bbd0aab34cd
source: Copy as INSERT INTO
es: Copiar como INSERT INTO
it: Copiare come INSERT INTO
ru: Копировать как INSERT INTO

# ++CODE++fd4aee4cb3fa5d5963fc78a7261f20700d94a8ddbbb5b963e97a84c441149508
source: Copy as JSON
es: Copiar como JSON
it: Copia come JSON
ru: Копировать как JSON

# ++CODE++d2b6ebb67aeb8ede651aa24682be64c81d2e0a970c297908b470e55fd14c0bcc
source: Copy code and open webpage
es: Copiar código y abrir página web
fr: Copier le code et ouvrir la page web
it: Copiare il codice e aprire la pagina Web
ja: コードをコピーして Web ページを開く
pt_br: Copiar o código e abrir a página da Web
ru: Копировать код и открыть веб-страницу

# ++CODE++334c24c15237b0764eb8571f1e8a34621cb5dd78ccc9b17e26b1670d96aeade2
source: Copy command to clipboard
es: Copiar el comando en el Portapapeles
it: Copia il comando negli Appunti
ru: Копировать команду в буфер обмена

# ++CODE++c06d8c1acc124f7c2fb5ce0e63e4b287b27bb49db0d25492ca85d5565f957ea2
source: Copy connection string to clipboard
es: Copia la cadena de conexión en el Portapapeles.
fr: Copier la chaîne de connexion dans le Presse-papiers
it: Copia la stringa di connessione negli Appunti
pt_br: Copiar a cadeia de conexão para a área de transferência
ru: Копирование строки подключения в буфер обмена

# ++CODE++c8b5428b9ac790b3952e08ceea5a8a170ad8b0af1e0f51c98a159f1147631e8a
source: Copy script
es: Copiar script
fr: Copier le script
it: Copia script
pt_br: Copiar o script
ru: Копировать сценарий

# ++CODE++3ae569f53ee1e765e3551a7f7881999f868289afbf0b1c6077d906c68cd10525
source: Copy with Headers
es: Copiar con encabezados
fr: Copier avec les en-têtes
it: Copia con intestazioni
ja: ヘッダー付きでコピー
pt_br: Copiar com Cabeçalhos
ru: Копировать с заголовками

# ++CODE++35c380196401c05c48fe5f5fffd349ba06d9988118b87a1c12e1164a28175997
source: Copying results...
es: Copiando resultados...
it: Copia dei risultati in corso...
ru: Копирование результатов...

# ++CODE++204a5eb2cd28bcfdf3be9f8c765948e9e831609e3c57048cdbd6b8a94cf49126
source: Cost
es: Costo
fr: Coût
it: Costo
ja: コスト
pt_br: Custo
ru: Стоимость

# ++CODE++f630f91edbf1dc6649a7de55179cb551ef8245ef63461de0094de54e58d5ea62
source: Could not find scripting metadata for {0} '{1}'.
es: No se encontraron metadatos de generación de scripts para {0} '{1}'.
it: Non è stato possibile trovare i metadati di scripting per {0} '{1}'.
ru: Не удалось найти метаданные создания скрипта для {0} "{1}".

# ++CODE++740a203633aed889e5b930b95ba1b4091d8813de60755ef81e481cc427703821
source: Count: {0}
es: Recuento: {0}
it: Conteggio: {0}
ru: Количество: {0}

# ++CODE++4a8d5a21d0db63fc6a204170919855b12207337b5357f2bb7eedcb7cafa77fce
source: Count: {0} Distinct Count: {1} Null Count: {2}
es: Recuento: {0} Recuento distinto: {1} Recuento nulo: {2}
fr: Nombre : {0} Nombre distinct : {1} Nombre de Null : {2}
it: Conteggio: {0} Conteggio valori distinti: {1} Conteggio valori Null: {2}
pt_br: Contagem: {0} Contagem distinta: {1} Contagem nula: {2}
ru: Количество: {0}, число уникальных значений: {1}, число значений NULL: {2}

# ++CODE++4759498ac2a719c619e2c8cf8ee60af2d2407425e95d308eb208425b2a6d427a
source: Create
es: Crear
fr: Créer
it: Crea
ja: 作成
pt_br: Criar
ru: Создать

# ++CODE++48d1f93834dfc421237288d07022d5dc4c61f90e5cc91494cee4960abc481d1d
source: Create Connection Group
es: Crear grupo de conexiones
fr: Créer un groupe de connexion
it: Crea gruppo di connessione
ru: Создать группу подключений

# ++CODE++71c1ec27a8c136ecdc781c1fd2364676155fbab7abf8837b9075eb3b9f9af7c0
source: Create Connection Profile
es: Crear un perfil de conexión
fr: Créer un profil de connexion
it: Crea profilo di connessione
ja: 接続プロファイルの作成
pt_br: Criar Perfil de Conexão
ru: Создать профиль подключения

# ++CODE++4b0281fd3c02c610c7ff9f781b1666d54182ee7c48812ea9332055a7814872ad
source: Create Container
es: Crear contenedor
fr: Créer un conteneur
it: Crea contenitore
ru: Создать контейнер

# ++CODE++a4772bd4c2a746f4bf95ffea1f8e9f44d3a8db72e301280d2bba6338c61724b6
source: Create Database
es: Crear base de datos
it: Crea database
ru: Создать базу данных

# ++CODE++0d5e7861b9a1710c8e1d2347dbb8d4dde272143bbeca537d216474ef7bd9193f
source: Create Firewall Rule
es: Crear regla de firewall
fr: Créer une règle de pare-feu
it: Crea regola del firewall
ja: ファイアウォール規則を作成する
pt_br: Criar Regra de Firewall
ru: Создать правило брандмауэра

# ++CODE++f7450e89276bf601752a2ef286965fb13e17c418012b0aa68be16f8941cc7321
source: Create Local SQL Container
es: Crear contenedor SQL local
fr: Créer un conteneur SQL local
it: Crea contenitore SQL locale
ru: Создать локальный контейнер с SQL

# ++CODE++037da908d1a0194c30554abfd678cc6ecc4762a021237b597c1205add3de7a4f
source: Create New Connection Group
es: Crear nuevo grupo de conexiones
fr: Créez un groupe de connexion
it: Crea nuovo gruppo di connessione
ru: Создать новую группу подключений

# ++CODE++2491afdca82a92663822feb8cd1ef045295b05178959965f47eb4d8b41058e47
source: Create a Local Docker SQL Server
es: Crear un SQL Server local en Docker
fr: Créer un serveur SQL Docker local
it: Creare un'istanza locale di SQL Server in Docker
ru: Создать локальный SQL Server в Docker

# ++CODE++1c67dff33030f48bfc399c9c9c43fb0c67e6986d741c12604cfd9cdf6f03bcb9
source: Create a SQL Server container in seconds—no manual steps required. Manage it easily from the MSSQL extension without leaving VS Code.
es: Cree un contenedor SQL Server en cuestión de segundos, sin necesidad de pasos manuales. Adminístrelo fácilmente desde la extensión MSSQL sin salir de VS Code.
fr: Créez un conteneur SQL Server en quelques secondes, aucune étape manuelle n’est requise. Gérez-le facilement à partir de l’extension MSSQL sans quitter VS Code.
it: Crea un contenitore SQL Server in pochi secondi senza bisogno di passaggi manuali. È possibile gestirlo facilmente dall'estensione MSSQL senza uscire da VS Code.
ru: Создание контейнера с SQL Server за считанные секунды — не требуется выполнять действия вручную. Удобное управление из расширения MSSQL без выхода из VS Code.

# ++CODE++76475214b86cde3b17e547c917253368f60ab3fb43eb8f71dca4d4c45535c1c5
source: Create a SQL database in Fabric (Preview)
es: Creación de una base de datos SQL en Fabric (versión preliminar)
it: Creare un database SQL in Fabric (anteprima)
ru: Создать базу данных SQL в Fabric (предварительная версия)

# ++CODE++4c4e11ad9f72c183a2ea2cdf1ed42c358aee2b87c96cad4d22d7d22b967dd3b8
source: Create a new database on '{0}'.
it: Creare un nuovo database su "{0}".

# ++CODE++4cbb437498e0de07f05b633c28f811c67840a2f67e956543557c6085560869e3
source: Create a new firewall rule
es: Crear una nueva regla de firewall
fr: Créer une règle de pare-feu
it: Crea una nuova regola del firewall
pt_br: Crie uma nova regra de firewall
ru: Создать правило брандмауэра

# ++CODE++6949d95c17351423dbbdb4d30d440bd9557c55fe734ab155cddeebdf86d86423
source: Create and manage local SQL Server containers directly from VS Code for fast, consistent local development.
it: Crea e gestisci contenitori SQL Server locali direttamente da VS Code per uno sviluppo locale rapido e coerente.
ru: Создавайте локальные контейнеры SQL Server и управляйте ими прямо из VS Code для быстрой и согласованной локальной разработки.

# ++CODE++920a110919d9017fb66218139efb71c5907532cbe6292a1db645f05d06a171ae
source: Create as Script
es: Create como script
it: Crea come script
ru: Создать как сценарий

# ++CODE++7ec04ea2bc2ba275e7471e9e6ec9ed4764f7c069d84e751a4652cb5bd3cba6b7
source: Create new firewall rule for {0}
es: Crear una nueva regla de firewall para {0}
fr: Créer une règle de pare-feu pour {0}
it: Crea nuova regola del firewall per {0}
pt_br: Criar nova regra de firewall para {0}
ru: Создать новое правило брандмауэра для {0}

# ++CODE++28b1fabfaa559d20e2654f3f6e126257916ec09e5923c77149138a2baa3b823a
source: Created table {0}
it: Tabella {0} creata

# ++CODE++e7d103b1170502b9fb94e08c67732e21aa132dbed79e58605736029791d7a8a8
source: Creating Container
es: Creando contenedor
fr: Création du conteneur
it: Creazione del contenitore
ru: Создание контейнера

# ++CODE++f25b28d86db44d028580bac2348b043db0eebc8a41f443aaaa5d22bfd2cb3fd2
source: Creating SQL Database for workspace {0}
es: Creando base de datos SQL para el área de trabajo {0}
it: Creazione del database SQL per l'area di lavoro {0}
ru: Создание Базы данных SQL для рабочей области {0}

# ++CODE++13329d1a1f2527d959fddce415af48d6141533dbec36dd8d8e33fae7bce865df
source: Creating SQL Server container...
es: Creando contenedor de SQL Server...
it: Creazione del contenitore SQL Server in corso...
ru: Создание контейнера SQL Server...

# ++CODE++9c37c64c878515cc2b5cd8ce05b7513d90d2134a1a2c36469aaa548d6fdfa6e9
source: Creating and starting your SQL Server container
es: Creación e inicio del contenedor de SQL Server
fr: Création et démarrage de votre conteneur SQL Server
it: Creazione e avvio del contenitore di SQL Server
ru: Создание и запуск контейнера SQL Server

# ++CODE++dbfe0a6c5a4cae79965c542e317484c3b53346daa195d3ec31d91c55c92181a3
source: Creating workspace with capacity {0}
es: Creando área de trabajo con capacidad {0}
it: Creazione dell'area di lavoro con capacità {0}
ru: Создание рабочей области с емкостью {0}

# ++CODE++60c0c05c936ef432e55dd4ea862b5dd1d454413310190ddaef63ef2dbbf75c03
source: Credential Error: An error occurred while attempting to refresh account credentials. Please re-authenticate.
es: Error de credencial: error al intentar actualizar las credenciales de la cuenta. Vuelva a autenticarse.
fr: Erreur d’informations d’identification : une erreur s’est produite lors de la tentative d’actualisation des informations d’identification du compte. Veuillez vous authentifier à nouveau.
it: Errore delle credenziali: si è verificato un errore durante il tentativo di aggiornare le credenziali dell'account. Ripeti l'autenticazione.
ja: 資格情報エラー: アカウント資格情報の更新中にエラーが発生しました。再認証してください。
pt_br: Erro de credencial: ocorreu um erro ao tentar atualizar as credenciais da conta. Autentique-se novamente.
ru: Ошибка учетных данных: произошла ошибка при попытке обновить данные учетной записи. Повторите проверку подлинности.

# ++CODE++87a66e3c88ffbca47508d5dcd250ebaa992c772a4b9d260c36216d4695e05475
source: Currently signed in as:
es: Sesión iniciada actualmente como:
fr: Actuellement connecté en tant que :
it: Accesso attualmente eseguito come:
ru: Вход выполнен от имени:

# ++CODE++c01dcd0e5ceb3a50adfe0ba0d9ab5e70b74daf484cbce1b937f8fa14910f7928
source: Custom GraphQL Type
it: Tipo GraphQL personalizzato
ru: Настраиваемый тип GraphQL

# ++CODE++9084f018e1499a8e51a7e04312970c63a473ec7cbe1cdbe804048ad01461983e
source: Custom REST Path
it: Percorso REST personalizzato
ru: Настраиваемый путь REST

# ++CODE++3cc30692596cf10ca4319a818741998997632cce895dbf138cb3299b1314d37f
source: Custom Zoom
es: Zoom personalizado
fr: Zoom personnalisé
it: Personalizza zoom
ja: ズームの指定
pt_br: Zoom Personalizado
ru: Пользовательское увеличение

# ++CODE++c525ed2944e05f661b7bc658ddccb355cd47a8daab5629ce4310c575aa58e2a1
source: Customize keyboard shortcuts
es: Personalizar las funciones rápidas de teclado
it: Personalizzare i tasti di scelta rapida
ru: Настройка сочетаний клавиш

# ++CODE++8f56b52b4f497c14810f52351db46c7f638c38f1a321f5bdfb38a3fb817f0ad9
source: DACPAC deployed successfully
es: DACPAC implementado correctamente
it: Distribuzione DACPAC eseguita correttamente
ru: DACPAC развернут

# ++CODE++c013d84f45a8e17f8b3f0bfea676174416117e054fa2315d1e3f1daeac57af36
source: DACPAC deployed successfully to database '{0}'
es: DACPAC se implementó correctamente en la base de datos '{0}'
it: Distribuzione del pacchetto di applicazione livello dati nel database ''{0}'' completata
ru: DACPAC развернут в базе данных "{0}"

# ++CODE++fec6ccad8071c66a146f4f9bab40620ba0279984c3c35763ac115ac3825fa6fd
source: DACPAC extracted successfully
es: DACPAC extraído correctamente
it: Estrazione DACPAC eseguita correttamente
ru: DACPAC извлечен

# ++CODE++efa7e304910e512aeaeb6c9dc608a6f993bd69b672cd3de63dba56475ed3e244
source: DACPAC extracted successfully to '{0}'
es: DACPAC extraído correctamente a '{0}'
it: DACPAC estratto correttamente in ''{0}''
ru: DACPAC извлечен в "{0}"

# ++CODE++859430fa647177df2bca8384a1b91e9f607ab6c35eba8d61c1ff399e80cf0ac2
source: DACPAC path not found. Please build the project first.
it: Percorso DACPAC non trovato. Compilare prima il progetto.
ru: Путь к DACPAC не найден. Сначала создайте проект.

# ++CODE++02b435f9a4c73633bef7d3b2b6548de6bb7ec5414c63e0bb6db520a4ca4d1004
source: DacFx service is not available. Profile loaded without deployment options. Publish and generate script operations cannot be performed.
es: Servicio DacFx no disponible. El perfil se cargó sin opciones de implementación. No se pueden realizar operaciones de publicación ni de generación de scripts.
it: Il servizio DacFx non è disponibile. Profilo caricato senza opzioni di distribuzione. Non è possibile eseguire operazioni di pubblicazione e generazione script.
ru: Служба DacFx недоступна. Профиль загружен без параметров развертывания. Невозможно выполнить операции публикации и создания скрипта.

# ++CODE++7ca6d6b94c100c4f405187f90cd8ed2b66402f6b47804856b75931feccf9b9f4
source: DacFx service is not available. Publish and generate script operations cannot be performed.
es: Servicio DacFx no disponible. No se pueden realizar operaciones de publicación ni de generación de scripts.
it: Il servizio DacFx non è disponibile. Non è possibile eseguire operazioni di pubblicazione e generazione script.
ru: Служба DacFx недоступна. Невозможно выполнить операции публикации и создания скрипта.

# ++CODE++54470469ac121dc0733beade1c15c864cc818522a03a555ce485481734f7bd16
source: Data API Builder Configuration
it: Configurazione del generatore di API dati
ru: Конфигурация построителя API данных

# ++CODE++68cd154732021d9684d0dcad6276e99d675f962c9b08774f23f5de9398e19290
source: Data Type
es: Tipo de datos
fr: Type de données
it: Tipo di dati
pt_br: Tipo de Dados
ru: Тип данных

# ++CODE++e3a5d47b33a0d2d672730f3278c43f30e8a43b8c973534f001e775f9dc5135bf
source: Data automatically replicated to OneLake in real time with a SQL analytics endpoint.
es: Los datos se replican automáticamente en OneLake en tiempo real con un punto de conexión de análisis de SQL.
it: Dati replicati automaticamente in OneLake in tempo reale tramite un endpoint di analisi SQL.
ru: Данные автоматически реплицируются в Одно озеро в режиме реального времени с помощью конечной точки аналитики SQL.

# ++CODE++002d75dcd5ce57695a446308e181eaf59edc9236246aa29a124ecb72409a65d7
source: Data type mismatch: '{0}' in column '{1}' incompatible with '{2}' in '{3}'
es: Error de coincidencia del tipo de datos: "{0}" en la columna "{1}" incompatible con "{2}" en "{3}"
fr: Incompatibilité de type de données : « {0} » dans la colonne « {1} » incompatible avec « {2} » dans « {3} »
it: Tipo di dati non corrispondente: '{0}' nella colonna '{1}' incompatibile con '{2}' in '{3}'
pt_br: Incompatibilidade de tipo de dados: ''{0}'' na coluna ''{1}'' incompatível com ''{2}'' em ''{3}''
ru: Несоответствие типов данных: "{0}" в столбце "{1}" несовместим с "{2}" в "{3}"

# ++CODE++7e986cf4465d2b2d98f423377f2fbd7e7a3b4d6e4a44023ca39027c3a0229fe0
source: Data-Tier Application (DACPAC / BACPAC) Import & Export (Preview)
it: Importazione ed esportazione di applicazioni livello dati (DACPAC/BACPAC) (Anteprima)
ru: Импорт и экспорт приложений уровня данных (DACPAC/BACPAC) (предварительная версия)

# ++CODE++775a3b4289d195d3cf2e85c782aab780c673c834c23bf5b90f54e1d87dfcf4ee
source: Data-tier Application (Preview)
es: Aplicación de capa de datos (versión preliminar)
it: Applicazione livello dati (anteprima)
ru: Приложение уровня данных (предварительная версия)

# ++CODE++2c9656ff01800f0250595c53f2b5010179b7f3759334fa473f89c10725e0b0bd
source: Data-tier Application File (.dacpac)
es: Archivo de aplicación de capa de datos (.dacpac)
fr: Fichier d'application de la couche Données (.dacpac)
it: File dell'applicazione livello dati (con estensione dacpac)
pt_br: Arquivo do Aplicativo da Camada de Dados (.dacpac)
ru: Файл приложения уровня данных (DACPAC)

# ++CODE++cc2bc1468b131fa8c46d376dd879592e78af283343403eb011206e52450a7ad3
source: Database Description
es: Descripción de la base de datos
it: Descrizione database
ru: Описание базы данных

# ++CODE++331a6c931050da7a047695a8068d30760c2c3abcdc09249f23c6a68a585d2ca7
source: Database Details
it: Dettagli database

# ++CODE++15f0fd55dd5c59cd5dabc0966ac7d02f83e3303b36ad6f692da47a8778eb4186
source: Database Name
es: Nombre de la base de datos
it: Nome database
ru: Имя базы данных

# ++CODE++11fc4c8107afd167c617e0099298c647d423931e67c1257d1f4eb7811b2512fd
source: Database Name is required
es: Se requiere el nombre de la base de datos
it: Il nome del database è obbligatorio
ru: Требуется имя базы данных

# ++CODE++667dd91d86c6b574073536489e39f0c5ab034846a63d946e8ef9f7bedeb1f4fb
source: Database Project
es: Proyecto de la base de datos
fr: Projet de base de données
it: Progetto di database
pt_br: Projeto de Banco de Dados
ru: Проект базы данных

# ++CODE++ec9c37392a809590dbb62879bd1b261c3675552b33d4d8936d539925d774f6a6
source: Database changed successfully
es: La base de datos se cambió correctamente
it: Modifica del database completata
ru: База данных изменена

# ++CODE++4027712bbc416cfc7ec6cf98c5be5578684cd55571f48076e82ea6230a66811e
source: Database list
es: Lista de bases de datos
it: Elenco database
ru: Список баз данных

# ++CODE++e97a0773fb7b656c174155270bd9ded70bc82caa0fc5d65b3ba24871577a5b08
source: Database name
es: Nombre de la base de datos
fr: Nom de base de données
it: Nome del database
ja: データベース名
pt_br: Nome do banco de dados
ru: Имя базы данных

# ++CODE++3974a472dbe02563d91333a7c499121cb0058aa7d3b280ec6cb6cc0ddc43208e
source: Database name contains invalid characters. Avoid using: < > * ? " / \ |
es: El nombre de la base de datos contiene caracteres no válidos. Evite usar: < > * ? " / \ |
it: Il nome del database contiene caratteri non validi. Evita di usare: < > * ? " / \ |
ru: Имя базы данных содержит недопустимые символы. Не используйте: < > * ? " / \ |

# ++CODE++3f0af542763ab0fd4d14de082ebedee3de024d89fb59bb569a6400087177d6db
source: Database name is required
es: Se requiere el nombre de la base de datos
it: Il nome del database è obbligatorio
ru: Требуется имя базы данных

# ++CODE++e64407cd183c9ac5788f9e96fbcebb236838ab1361d3a1106833f30dc63a9a6e
source: Database name is too long. Maximum length is 128 characters
es: El nombre de la base de datos es demasiado largo. La longitud máxima es de 128 caracteres
it: Il nome del database è troppo lungo. La lunghezza massima è 128 caratteri
ru: Слишком длинное имя базы данных. Максимальная длина: 128 символов

# ++CODE++402d00d25022d7d90590017acaa8ef375ab6ddd4f14be17bb58c7003175216ae
source: Database name must be 128 characters or fewer
it: Il nome del database deve contenere al massimo 128 caratteri

# ++CODE++0c44c1ef5c326d66d59992daca9150070537b80433d82792a6f4a8451bbba635
source: Database not found on the server
es: Base de datos no encontrada en el servidor
it: Database non trovato sul server
ru: База данных не найдена на сервере

# ++CODE++21b111cbfe6e8fca2d181c43f53ad548b22e38aca955b9824706a504b0a07a2d
source: Default
es: Valor predeterminado
fr: Par défaut
it: Predefinito
pt_br: Padrão
ru: По умолчанию

# ++CODE++647cc4253428b25fe686fa8d5d5da5841fed53ad85395cdd43920d0226900c1d
source: Default Value
es: Valor predeterminado
fr: Valeur par défaut
it: Valore predefinito
ja: 既定値
pt_br: Valor Padrão
ru: Значение по умолчанию

# ++CODE++9912ff507e2f48ad028b400bce2df6d1b4a673fe69fddcacf1cbfd3836275ab1
source: Define who can access this endpoint
it: Definire chi può accedere a questo endpoint
ru: Определите, кто может получить доступ к этой конечной точке

# ++CODE++9813fafb098c218090536790280a91ee70062a8490eb3615395ee731cdd40023
source: Definition
es: Definición
fr: Définition
it: Definizione
ru: Определение

# ++CODE++b6ca9a06ebcc8ea511648b46b103859960924b42fa98231c0ca4b69b84943687
source: DefinitionRequestCompleted
es: Solicitud de definición completada
it: Richiesta della definizione completata

# ++CODE++fe0ec38fb92c70d80fd5a36ff72c37cb3ed759bba91373c96a21bde631e03db3
source: DefinitionRequested
es: Definición requerida
it: Definizione richiesta

# ++CODE++e2d0a54968ead24efc0dffa6ac78fc606dceec34a0f586177a74a54cc2272cf8
source: Delete
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
pt_br: Excluir
ru: Удалить

# ++CODE++2860bf10bd8d01c604f713ea3f60ccea6ef028fd2e7074a400fac50c569aa45c
source: Delete Confirmation
es: Confirmar eliminación
fr: Confirmation de la suppression
it: Conferma eliminazione
ru: Подтверждение удаления

# ++CODE++129eabad7bcc761eb7966091c2bc01163b650ca0613f42c58db97eae5420a7bb
source: Delete Contents
es: Eliminar contenido
fr: Supprimer le contenu
it: Elimina contenuto
ru: Удалить содержимое

# ++CODE++43654c6556c7d0fca93516d81791b323c7746bb3becdcb8800aa9f31300fe30c
source: Delete Row
es: Eliminar fila
it: Elimina riga
ru: Удалить строку

# ++CODE++3e12474b79fc61d3695fc46a2588df801c380eccc6edc9cb20dd223f4e9ed76e
source: Delete backup and restore history
it: Eliminare la cronologia delle operazioni di backup e ripristino

# ++CODE++ce719226a83119822d8c5e6c1981ecfe801b8324890fce617664184849c24491
source: Delete saved connection
es: Eliminar conexión guardada
fr: Supprimer la connexion enregistrée
it: Elimina connessione salvata
pt_br: Excluir conexão salva
ru: Удалить сохраненное подключение

# ++CODE++b48ff39c2e0f5451b9b29b09c2a74d2760db230749ffd48a6e901cc91fef9a8d
source: Deleted
it: Eliminato

# ++CODE++9ca6b97465f4c8972f542c20c953a0d541166912d083694710d9cb1acc8b7e5d
source: Deleted column '{0}'
it: Colonna '{0}' eliminata

# ++CODE++1927927f4e169b240939c3ed252262deee4fe1099424c667f89b962549c01dd9
source: Deleted foreign key '{0}'
it: Chiave esterna '{0}' eliminata

# ++CODE++a5b956b22e4c5bb017d2718dae7b2f61356ba499722efe676ae4feb162cf49e9
source: Deleted table {0}
it: Tabella {0} eliminata
