Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++fd10453f63e5c663d4e640ea9cbe1adcc832b6fed0454e62686773ac486ce64d
source: is required.
es: es obligatorio.
fr: est obligatoire.
it: è obbligatorio.
ja: 必須です。
pt_br: é obrigatório.
ru: является обязательным.

# ++CODE++18b63db64aa0aff55a9f4784ad62abdc2b70cedb95b5e89d5551996cc9bd25ac
source: $(plug) Connect to MSSQL
es: $(plug) Conectar a MSSQL
fr: $(plug) Se connecter à MSSQL
it: $(plug) Connetti a MSSQL
ru: $(plug) Подключение к MSSQL

# ++CODE++44db9a12f4699cefd03940639b9675924d76fc9dc7faed967e044f5fbaf7bfb6
source: (0 rows affected)
es: (0 filas afectadas)
fr: (0 ligne affectée)
it: (0 righe interessate)
ru: (Затронуто 0 строк)

# ++CODE++666e175d7e3437548ba8bc1a84d083677a73792a61fa2184e8d6a6675eb8d030
source: (1 row affected)
es: (1 fila afectada)
fr: (1 ligne affectée)
it: (1 riga interessata)
ru: (Затронута 1 строка)

# ++CODE++e7784428bb0e21b36bb1248598086656cb640b0fdacf03835a1299416e507237
source: ({0} rows affected)
es: ({0} filas afectadas)
fr: ({0} lignes affectées)
it: ({0} righe interessate)
ru: (Затронуто строк: {0})

# ++CODE++58ce5122060a06a437de1d4c7d19886005ef98b2bae3c455c677baa4f30b7d71
source: + Add Azure Account
es: + Agregar cuenta de Azure
fr: + Ajouter un compte Azure
it: + Aggiungi account Azure
ru: + Добавить учетную запись Azure

# ++CODE++75aeb47c4c40ae9ea18e7b77776ff62be55ce308e85a64f870e49b056533d5cb
source: + Add Fabric Account
es: + Agregar cuenta de Fabric
it: + Aggiungi account Fabric
ru: + Добавить учетную запись Fabric

# ++CODE++dbfb6fb3f275d24e8e32113cbbabeffe9d78165e6bdaf5b82c0fede5881451b5
source: + Create Connection Group
es: + Crear grupo de conexiones
fr: Créer un groupe de connexion
it: + Crea gruppo di connessione
ru: + Создать группу подключений

# ++CODE++08fef8ce26bbc554c749504c8d169642c3039345674331079add345b808e96a7
source: A SQL editor must have focus before executing this command
es: Un editor de SQL debe tener el foco antes de ejecutar este comando.
fr: L’éditeur SQL doit avoir le focus pour exécuter cette commande
it: Prima di eseguire questo comando, è necessario spostare lo stato attivo in un editor SQL
ja: このコマンドを実行する前に、SQL エディターはフォーカスされている必要があります
pt_br: Um editor SQL deve ter foco antes de executar este comando
ru: Перед выполнением этой команды фокус должен находиться в редакторе SQL

# ++CODE++c8de997b7629be28d0a23b5051675226cd94e8dbce3b837e10491b7d60dc9903
source: A database with this name already exists on the server
es: Ya existe una base de datos con este nombre en el servidor
it: Un database con il nome specificato esiste già nel server
ru: База данных с таким именем уже существует на сервере

# ++CODE++6ab58ce9ca23e017bf594366b66b620458a5580640ddaf3aebf96f3c8fdf0977
source: A firewall rule is required to access this server.
es: Se requiere una regla de firewall para acceder a este servidor.
fr: Une règle de pare-feu est nécessaire pour accéder à ce serveur.
it: Per accedere a questo server è necessaria una regola del firewall.
pt_br: Uma regra de firewall é necessária para acessar este servidor.
ru: Для доступа к этому серверу требуется правило брандмауэра.

# ++CODE++6b262b5e3f3a492b857cb857bded5d039fa91cbc72a121ef398ef5676b2be947
source: A highly integrated, developer-ready transactional database that auto-scales, auto-tunes, and mirrors data to OneLake for analytics across Fabric services
es: Una base de datos transaccional altamente integrada y lista para desarrolladores que escala automáticamente, se ajusta de forma automática y refleja los datos en OneLake para realizar análisis en todos los servicios de Fabric
it: Un database transazionale, pronto per gli sviluppatori, altamente integrato che si ridimensiona e ottimizza automaticamente, e sincronizza i dati in OneLake per l'analisi tramite i servizi Fabric
ru: Высокоинтегрированная, готовая для разработчиков транзакционная база данных, которая автоматически масштабируется, автоматически настраивается и зеркально отображает данные в Одном озере для аналитики в службах Fabric

# ++CODE++880a0618dd92395efe1446e54fe5d50854c148586fdc14f5da8aecda61c827ae
source: A predefined global default value for the column or binding.
es: Valor predeterminado global y predefinido para la columna o enlace.
fr: Une valeur par défaut globale prédéfinie pour la colonne ou la liaison.
it: Valore predefinito globale per la colonna o l'associazione.
ja: 列またはバインドの定義済みのグローバルな既定値です。
pt_br: Um valor padrão global predefinido para a coluna ou associação.
ru: Предопределенное глобальное значение по умолчанию для столбца или привязки.

# ++CODE++0ead4aa08784fedbf2a89d6c0958d7704ede494d920130913de6de5e42fdca50
source: A query is already running for this editor session. Please cancel this query or wait for its completion.
es: Ya se está ejecutando una consulta para esta sesión del editor. Cancele la consulta o espere a que finalice.
fr: Une requête est déjà en cours d’exécution pour cette session d’éditeur. Annulez-la ou attendez qu’elle se termine.
it: È già in esecuzione una query per questa sessione dell'editor. Annullare questa query o attenderne il completamento.
ja: このエディター セッションのクエリは既に実行中です。このクエリをキャンセルするか、完了まで待ってください。
pt_br: Uma consulta está sendo executada para esta sessão do editor. Cancele esta consulta ou aguarde a conclusão.
ru: Запрос уже выполняется для этого сеанса редактора. Отмените запрос или дождитесь окончания его выполнения.

# ++CODE++72e7cc4c4f1c083b8607c0e8d0e5093cb5756df15336523ee5d00f194829168b
source: API Type
it: Tipo API
ru: Тип API

# ++CODE++9aa3df89bd0844fc7cab254d4e810af6cf12b5d9fa011b7675f45bbae8bcadf7
source: Accelerate schema evolution by autogenerating ORM migrations or T-SQL change scripts
es: Acelerar la evolución del esquema generando automáticamente migraciones ORM o scripts de cambio de T-SQL
it: Accelera l'evoluzione dello schema generando automaticamente migrazioni ORM o script di modifica T-SQL
ru: Ускоряйте развитие схемы, автоматически генерируя скрипты миграции ORM или изменений T-SQL

# ++CODE++89713b9c9c1b8f659c9f49db25e4a47886dd673fee248c3f650391f09a759cef
source: Accept
es: Aceptar
fr: Accepter
it: Accetta
ru: Принять

# ++CODE++e21e734aaaff27306eeaba840397aea3b25480cb0426c9c21386cbf141e56e34
source: Accept the SQL Server EULA to deploy a SQL Server Docker container
es: Aceptación del CLUF de SQL Server para implementar un contenedor Docker de SQL Server
fr: Accepter le CLUF SQL Server pour déployer un conteneur Docker SQL Server
it: Accettare il contratto di licenza di SQL Server per distribuire un contenitore Docker di SQL Server
ru: Примите условия лицензионного соглашения SQL Server, чтобы развернуть контейнер Docker с SQL Server

# ++CODE++fa0563b6f04578f7a2a7cff43aed611c4835bbb2f3a21dfed76a0601a1d63859
source: Access denied. Please ensure you have the necessary permissions to use this tool or model.
es: Acceso denegado. Asegúrese de tener los permisos necesarios para usar esta herramienta o modelo.
fr: L’accès est refusé. Veuillez vérifier que vous disposez des autorisations nécessaires pour utiliser cet outil ou ce modèle.
it: Accesso negato. Assicurarsi di disporre delle autorizzazioni necessarie per utilizzare questo strumento o modello.
ru: Отказано в доступе. Обеспечьте наличие у вас необходимых разрешений для использования этого инструмента или модели.

# ++CODE++ea9df7a87af305f04a7ca43d0ce60433e16504061c265ab11d0029cdf8cae372
source: Access token expired for connection {0} with uri {1}
es: El token de acceso expiró para el {0} de conexión con uri {1}
fr: Le jeton d’accès a expiré pour la connexion {0} avec l’URI {1}
it: Token di accesso scaduto per la connessione {0} con {1} URI
ja: URI {0} の接続 {1} のアクセス トークンの有効期限が切れました
pt_br: O token de acesso expirou para a conexão {0} com o URI {1}
ru: Истек срок действия маркера доступа для подключения {0} с URI {1}

# ++CODE++08a2ef94ef94039eed728a4a3ab703508a7bfe442d702183ecbd763d5852a232
source: Account not found
es: Cuenta no encontrada
fr: Compte introuvable
it: L'account non è stato trovato
ja: アカウントが見つかりません
pt_br: Conta não encontrada
ru: Учетная запись не найдена

# ++CODE++64cff1319d2fd2cbb7a1e84ccecf22c1cc07b24435cdb522f8c0aa525d6002a6
source: Action
es: Acción
it: Azione
pt_br: Ação
ru: Действие

# ++CODE++0fee17081211a1d4460499aa376fa2a12beb83c33a43e14f1832a72901f3ed1c
source: Actual Elapsed CPU Time
es: Tiempo real transcurrido en la CPU
fr: Temps processeur réel écoulé
it: Tempo trascorso effettivo della CPU
ja: 実際の経過時間 CPU 時間
pt_br: Tempo Real de CPU Decorrido
ru: Фактически затраченное время ЦП

# ++CODE++3a64334fae4e284bc2271562216edc298bd734ca4ec8512af9c53291173a7d2e
source: Actual Elapsed Time
es: Tiempo real transcurrido
fr: Temps réel écoulé
it: Tempo trascorso effettivo
ja: 実際の経過時間
pt_br: Tempo Real Decorrido
ru: Фактически затраченное время

# ++CODE++63d01a41e50ddec3d6edfabbbf3f1c34d09f581236beab50bf510ea11e9ef4c5
source: Actual Number of Rows For All Executions
es: Número real de filas para todas las ejecuciones
fr: Nombre réel de lignes pour toutes les exécutions
it: Numero effettivo di righe per tutte le esecuzioni
ja: すべての実行の実際の行数
pt_br: Número Real de Linhas De Todas as Execuções
ru: Фактическое число строк для всех выполнений

# ++CODE++9fd728c66c9a256b121472dabf32a34317aed01d8427d70ec830289cf23a7cc8
source: Add
es: Agregar
fr: Ajouter
it: Aggiungi
pt_br: Adicionar
ru: Добавить

# ++CODE++3d0d3f78acca7d0def0c881e924ececb285c1791711ab008ae5a0297e09a717a
source: Add Account
es: Agregar cuenta
fr: Ajouter un compte
it: Aggiungi account
ru: Добавить учетную запись

# ++CODE++c26c65459a782d2065f5a9cda97c098c2e49e5734d5d16c8a8c86d4c177373cc
source: Add Column
es: Agregar columna
fr: Ajouter une colonne
it: Aggiungi colonna
ja: 列の追加
pt_br: Adicionar Coluna
ru: Добавить столбец

# ++CODE++d72d67f0f765e5584e6db8bd1e591a84914d23ff29e9f5b20d8b39125091fca0
source: Add Connection
es: Agregar conexión
fr: Ajouter une connexion
it: Aggiungi connessione
ja: 接続の追加
pt_br: Adicionar Conexão
ru: Добавить подключение

# ++CODE++079cd7244ce7f3c0fe474c025b5ff8e58c3678fba1ed67f0120416ac0071df85
source: Add Firewall Rule
es: Agregar regla de firewall
fr: Ajouter une règle de pare-feu
it: Aggiungi regola del firewall
pt_br: Adicionar regra de firewall
ru: Добавить правило брандмауэра

# ++CODE++07d072b97d1e2346b3eed5778ffb9d979a83de20ca00ff8a5f8bfa99d41993a5
source: Add Firewall Rule to {0}
es: Agregar regla de firewall a {0}
fr: Ajouter une règle de pare-feu à {0}
it: Aggiungi regola del firewall a {0}
pt_br: Adicionar Regra de Firewall a {0}
ru: Добавить правило брандмауэра в {0}

# ++CODE++02a16a835f1e9c9cbe76a8cb9042d2f3861fc237036221e1f0c60383600f45f6
source: Add Row
es: Agregar fila
it: Aggiungi riga
ru: Добавить строку

# ++CODE++937a7b0b3cc8c58a787de5a63bfc07573789ee22a22918957f92651c0edb31f9
source: Add Server Connection
es: Agregar conexión de servidor
fr: Ajouter une Connexion au serveur
it: Aggiungi connessione server
ru: Добавить подключение к серверу

# ++CODE++cbc187e255409f8de0f011bbebfc96b04028928cce72ccb35ca8a088f156aba9
source: Add Table
es: Agregar tabla
fr: Ajouter une table
it: Aggiungi tabella
pt_br: Adicionar Tabela
ru: Добавить таблицу

# ++CODE++09857ad18f3cf066330f9fc08318e41f71ecb7b7d71f12bd1dd3b9d050db4ca0
source: Add a Microsoft Entra account...
es: Agregar una cuenta de Microsoft Entra...
fr: Ajouter un compte Microsoft Entra...
it: Aggiungere un account Microsoft Entra...
ja: Microsoft Entra アカウントを追加...
pt_br: Adicionar uma conta do Microsoft Entra...
ru: Добавьте учетную запись Microsoft Entra...

# ++CODE++ee7ee5830f091690030fed013c05a7073f6cb971891c3fc6f16e928bd6d69e61
source: Add account
es: Agregar cuenta
it: Aggiungi account
ru: Добавить учетную запись

# ++CODE++7c0d6c25e58caa429d8df44b1266a82eff13a7fe9f477b164863aea8a9acc658
source: Add my client IP ({0})
es: Agregar IP de cliente ({0})
fr: Ajouter mon adresse IP cliente ({0})
it: Aggiungi IP client personale ({0})
pt_br: Adicionar meu IP do cliente ({0})
ru: Добавить мой клиентский IP-адрес ({0})

# ++CODE++cf502b3a94444bf574bf8c1ca17b7ba9f954543af389a62e0eeca0ec3faa08f3
source: Add new column
es: Agregar nueva columna
fr: Ajouter une nouvelle colonne
it: Aggiungi nuova colonna
pt_br: Adicionar nova coluna
ru: Добавить новый столбец

# ++CODE++18ef399051716731a65e9412dca68fc9d35b38850e7dff905d9771fe15bde438
source: Add new foreign key
es: Agregar nueva clave externa
fr: Ajouter une nouvelle clé étrangère
it: Aggiungi nuova chiave esterna
pt_br: Adicionar nova chave estrangeira
ru: Добавить новый внешний ключ

# ++CODE++6b02e0d363a4af1c95eef50364bb0202c8b250aa05a48a69e68fd7787b4b0632
source: Added
it: Aggiunto

# ++CODE++bc6eb3b452e596a92b620948e6858d0f740a07cec116ff572cf7202785894cbf
source: Added column '{0}'
it: Colonna '{0}' aggiunta

# ++CODE++f1488f38e72433af73c22c2016b43e97e5d652e4cdd8ee0baa86d2ddd19e4447
source: Added foreign key '{0}'
it: Chiave esterna '{0}' aggiunta

# ++CODE++69bcade64ab9094e6b5fd3b235f0dcc9e723977c25283af0fa746bd154fc386e
source: Additional parameters
es: Parámetros adicionales
fr: Paramètres supplémentaires
it: Parametri aggiuntivi
ja: 追加のパラメーター
pt_br: Parâmetros adicionais
ru: Дополнительные параметры

# ++CODE++9f088dbebd6c3c70a5ddbc2c943b11e4ca9acea5757b0b4f2b32479f0dbb747e
source: Advanced
es: Configuración avanzada
fr: Avancé
it: Avanzate
ja: 詳細設定
pt_br: Avançado
ru: Расширенный

# ++CODE++d2cab259e6e6da600d35907f2b627f8bf69c49ab40f8f129b9d9f206f149a8f9
source: Advanced Connection Settings
es: Configuración avanzada de las conexiones
fr: Paramètres de connexion avancés
it: Impostazioni di connessione avanzate
ja: 高度な接続設定
pt_br: Configurações Avançadas de Conexão
ru: Дополнительные параметры подключения

# ++CODE++59b9bc625f3deaf53650dfb541e848b7452cc3ede80793c43fd3ca68351c7c9d
source: Advanced Entity Configuration
it: Configurazione avanzata dell'entità
ru: Расширенная конфигурация сущности

# ++CODE++dfa2817fb2221c8b89c47c4fe8326d07c119b7c32e89e509d1061fc596fdf801
source: Advanced Options
es: Opciones avanzadas
fr: Options avancées
it: Opzioni avanzate
pt_br: Opções Avançadas
ru: Дополнительные параметры

# ++CODE++fe80d12c71bbc300158260094cf676c1a9f3546b792f027c84e7a91d9fc75b20
source: Advanced Publish Options
es: Opciones avanzadas de publicación
it: Opzioni di pubblicazione avanzate
ru: Дополнительные параметры публикации

# ++CODE++d68cd3ac31f638a528ae24f963d817f9112ed35137574a948e1201a7f154a20e
source: Al-assisted SQL development with schema-aware query generation, ORM support, and natural language chat with @mssql in Ask or Agent Mode.
it: Sviluppo SQL assistito da intelligenza artificiale con generazione di query con riconoscimento dello schema, supporto ORM e chat in linguaggio naturale con @mssql in modalità Ask o modalità agente.
ru: Разработка SQL при помощи ИИ с генерацией запросов с учетом схемы, поддержка ORM и чат на естественном языке с @mssql в режиме вопросов или режиме агента.

# ++CODE++a52ace420f2175d08b1577a1bea5445e36801229c074ef9ed6c55a73401fd9c2
source: All
it: Tutto

# ++CODE++00cf214a7dfb7d94c1e2ff944723bb21250ac45fa4fbf9add906bd3532c56563
source: All Schemas
it: Tutti gli schemi
ru: Все схемы

# ++CODE++08d0861fba87c9910b6c76342c1783be7d5504ff5248fbacd869963a7322992d
source: All permissions for extensions to access your connections have been cleared.
es: Se han eliminado todos los permisos para que las extensiones accedan a sus conexiones.
fr: Toutes les autorisations d’accès à vos connexions pour les extensions ont été effacées.
it: Tutte le autorizzazioni per consentire alle estensioni di accedere alle tue connessioni sono state cancellate.
ru: Все разрешения для расширений на доступ к вашим подключениям очищены.

# ++CODE++b339f58d00ef993ac62d6cdf1341fd6dd3351e51031e9e04da27b34d4bb793ce
source: All selected
es: Todos seleccionados
it: Tutti selezionati
ru: Все выбранные

# ++CODE++4d33c136b843b3ddc449137e1c655e000f830c7ce36da8d6645e9a76633d035f
source: Allow Null
es: Permitir NULL
fr: Autoriser une valeur Null
it: Consenti Null
pt_br: Permitir Nulo
ru: Разрешить значение NULL

# ++CODE++ab4db1a876378f718e4073baa75897c34c0e7d2608d68cda6461e01de42fa962
source: Allow Nulls
es: Permitir NULL
fr: Autoriser les valeurs nulles
it: Consenti valori Null
ja: Null を許容
pt_br: Permitir Nulos
ru: Разрешить значения NULL

# ++CODE++5823192e37f38baf2e14f1fba3486615cbfa097b26c05b2a13a6c3473ce11c74
source: Allow this extension to access your connections
es: Permitir que esta extensión acceda a sus conexiones
fr: Autoriser cette extension à accéder à vos connexions
it: Consentire a questa estensione di accedere alle tue connessioni
ru: Разрешить этому расширению доступ к вашим подключениям

# ++CODE++a49d631f8c6cf6fb1660fb5229dfa0c08b55727549c0e48cc0cef1f7770ba0e2
source: Alphabetical
es: Alfabético
fr: Ordre alphabétique
it: In ordine alfabetico
ja: アルファベット順
pt_br: Alfabético
ru: В алфавитном порядке

# ++CODE++482b98e1609bd828db30a1c85f78a5e6e6ee55dcfb01db094432c1db2c1ae168
source: Alter
es: Alterar
fr: Modifier
it: Modifica
ru: Изменение

# ++CODE++1888bd4ce917e9c8cecde43608d69624f56668f86f1bbe4331494db33fb52578
source: Always show in new tab
es: Mostrar siempre en la nueva pestaña
fr: Toujours afficher dans un nouvel onglet
it: Mostra sempre nella nuova scheda
pt_br: Sempre mostrar em uma nova guia
ru: Всегда показывать в новой вкладке

# ++CODE++df50fadac20ad5c3b190a9af94532fd84c01e0787f15b55212fa2f41de09a091
source: An active connection is required for GitHub Copilot to understand your database schema and proceed. Select "{0}" to establish a connection.
es: Se requiere una conexión activa para que GitHub Copilot entienda el esquema de la base de datos y continúe. Seleccione "{0}" para establecer una conexión.
it: Per GitHub Copilot è necessaria una connessione attiva per comprendere lo schema del database e procedere. Seleziona "{0}" per stabilire una connessione.
ru: Чтобы GitHub Copilot понял схему вашей базы данных и продолжил работу, требуется активное подключение. Выберите "{0}", чтобы установить подключение.

# ++CODE++d4fd4b3da177dfc06dbcde0a7f62d637dbf3d90298fdc9b6aeba4f9230441e1f
source: An error occurred refreshing nodes. See the MSSQL output channel for more details.
es: Error al actualizar los nodos. Consulte el canal de salida de MSSQL para obtener más detalles.
fr: Une erreur s’est produite lors de l’actualisation des nœuds. Pour plus d’informations, consultez le canal de sortie MSSQL.
it: Errore durante l'aggiornamento dei nodi. Per altri dettagli, vedere il canale di output MSSQL.
ja: ノードの更新中にエラーが発生しました。詳細については、MSSQL 出力チャネルを参照してください。
pt_br: Ocorreu um erro ao atualizar os nós. Consulte o canal de saída do MSSQL para obter mais detalhes.
ru: Произошла ошибка при обновлении узлов. Подробнее см. в канале вывода MSSQL.

# ++CODE++0e0aa36ee32c59d59231919e47412a12d29c1f3459800637634bb73fb949f541
source: An error occurred while copying results: {0}
es: Error al copiar los resultados: {0}
it: Errore durante la copia dei risultati: {0}
ru: Произошла ошибка при копировании результатов: {0}

# ++CODE++b80f19578e3d6cc4f8693e307caf7f4fc739be0f2eb550a9f78a0874ae0205e5
source: An error occurred while processing your request.
es: Error al procesar la solicitud.
fr: Une erreur s'est produite lors du traitement de votre demande.
it: Si è verificato un errore durante l'elaborazione della richiesta.
ru: При обработке запроса произошла ошибка.

# ++CODE++8cf147a84fa5b378df2fb1c8d2001b12404768f0de0871a152ed488136a3b350
source: An error occurred while removing Microsoft Entra account: {0}
es: Error al quitar la cuenta de Microsoft Entra: {0}
fr: Une erreur s’est produite lors de la suppression du compte Microsoft Entra : {0}
it: Si è verificato un errore durante la rimozione dell'account Microsoft Entra: {0}
ja: Microsoft Entra アカウントの削除中にエラーが発生しました: {0}
pt_br: Ocorreu um erro ao remover a conta do Microsoft Entra: {0}
ru: Произошла ошибка при удалении учетной записи Microsoft Entra: {0}

# ++CODE++381d558ea8ee3e00d772e070932d5a334e7743c399dda1ddd675e1962d6e32bc
source: An error occurred while retrieving rows: {0}
es: Error al recuperar filas: {0}
it: Si è verificato un errore durante il recupero delle righe: {0}
ru: Ошибка при получении строк: {0}

# ++CODE++6bda942fdd68d287fb0f1659be0f2011ad842f9295aa230d763f3cec6db5b000
source: An error occurred while searching database objects
es: Error al buscar objetos de base de datos
it: Si è verificato un errore durante la ricerca di oggetti di database
ru: Произошла ошибка при поиске объектов базы данных

# ++CODE++fe01cd2e56483272d8d46be5c77c37d6be1aba49dfbe2fa79f68b4740723b758
source: An error occurred while searching database objects: {0}
es: Error al buscar objetos de base de datos: {0}
it: Si è verificato un errore durante la ricerca di oggetti di database: {0}
ru: Произошла ошибка при поиске объектов базы данных: {0}

# ++CODE++56f99fbd59570e105fca5070d135f8f86c67f48168d43f8020b70523f06b21bb
source: An error occurred: {0}
es: Error: {0}
fr: Une erreur s'est produite : {0}
it: Si è verificato un errore: {0}
ru: Произошла ошибка: {0}

# ++CODE++6615bf1c8fddf2fbb0970f969c21c5d919d912608bd1cceb93855780bec3123d
source: An unexpected error occurred
es: Se produjo un error inesperado
it: Si è verificato un errore imprevisto
ru: Произошла неожиданная ошибка

# ++CODE++8b8fe298945f010c0411318ce29f36e4d4da70cdd0d28299dc0b64e7c8866e74
source: An unexpected error occurred with the language model. Please try again.
es: Se produjo un error inesperado con el modelo de lenguaje. Vuelva a intentarlo.
fr: Une erreur inattendue s’est produite avec le modèle de langage. Veuillez réessayer.
it: Si è verificato un errore imprevisto con il modello linguistico. Riprovare.
ru: В языковой модели возникла непредвиденная ошибка. Попробуйте еще раз.

# ++CODE++82fcdad573baa3443513b5c61196ed142a07d6b967afc2778c8932549a5ad455
source: An unknown error occurred. Please try again.
es: Se produjo un error desconocido. Vuelva a intentarlo.
fr: Une erreur inconnue s’est produite. Veuillez réessayer.
it: Si è verificato un errore sconosciuto. Riprovare.
ru: Возникла неизвестная ошибка. Попробуйте еще раз.

# ++CODE++6ca0797fa56ecdc7f5f08c99504d70d93a42ccbe0e904e273144c6fd9efdc21c
source: Analytics-ready by default
es: Listo para análisis de manera predeterminada
it: Pronto per l'analisi per impostazione predefinita
ru: Готово к аналитике по умолчанию

# ++CODE++0f67514b901da8b9c613167848294cb0010b3c0e696732aa1a0c9737e5be69b1
source: And
es: Y
fr: Et
it: E
ja: かつ
pt_br: E
ru: И

# ++CODE++e7a8aa2df7e5d0b233da615af4e7fef148bec39aef1709da0a80391ad0316563
source: Anonymous
it: Anonimo
ru: Анонимно

# ++CODE++f548fb847184961d59c59fd5b4ff10720726475e1768037348dec8e7c6bd6468
source: Application Intent
es: Intención de aplicaciones
it: Finalità applicazione
ru: Намерение приложения

# ++CODE++e9865ab4cac1f8559837db62fe175d0784978b075680404a655ce2a6182ff532
source: Application Name
es: Nombre de aplicación
it: Nome applicazione
ru: Имя приложения

# ++CODE++a187c7382f4026c938df224dd7484977538cd582c67e94b62861499fe68c68a4
source: Application Version
es: Versión de la aplicación
it: Versione applicazione
ru: Версия приложения

# ++CODE++3bce900ec4939301dbcf9f9199be4416b9c310a90af78e6a083fcbb7c517696e
source: Application version must be in format n.n.n or n.n.n.n where n is a number (e.g., 1.0.0.0)
es: La versión de la aplicación debe tener el formato n.n.n o n.n.n.n, donde n es un número (por ejemplo, 1.0.0.0)
it: La versione dell'applicazione deve essere nel formato n n.n.n o n.n.n.n dove n è un numero (ad esempio, 1.0.0.0)
ru: Версия приложения должна иметь формат n.n.n или n.n.n.n, где n — число (например, 1.0.0.0)
