Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++0d1cea3ad10431de23b65a45a897f8a04520ae0353bb863064c38d0c6b7fa7aa
source: Column '{0}' cannot be null because it is a primary key
es: La columna "{0}" no puede ser null porque es una clave principal
fr: La colonne « {0} » ne peut pas être nulle, car c’est une clé primaire
it: La colonna '{0}' non può essere null perché è una chiave primaria
pt_br: A coluna '{0}' não pode ser nula porque é uma chave primária
ru: Столбец "{0}" не может быть равен null, потому что он является первичным ключом

# ++CODE++8d00d9665207fcb4d435b78c5be1719cbc6d078437f523910b3e8bd9e95e67aa
source: Column '{0}' is an identity column and cannot have a cascading foreign key
es: La columna "{0}" es una columna de identidad y no puede tener una clave externa en cascada
fr: La colonne '{0}' est une colonne d'identité et ne peut pas avoir de clé étrangère en cascade
it: La colonna '{0}' è una colonna di identità e non può avere una chiave esterna a cascata
pt_br: Coluna '{0}' é uma coluna de identidade e não pode ter uma chave estrangeira em cascata
ru: Столбец "{0}" является столбцом удостоверения и не может использовать каскадный внешний ключ

# ++CODE++c360b9bc22466a897cd5a6398646517f1bc0236d4bd579846b258d267dfd859c
source: Column '{0}' must be a primary key
es: La columna "{0}" debe ser una clave principal
fr: La colonne « {0} » doit être une clé primaire
it: La colonna '{0}' deve essere una chiave primaria
pt_br: A coluna ''{0}'' deve ser uma chave primária
ru: Столбец "{0}" должен быть первичным ключом

# ++CODE++d93bc428789daab792bbefccefbef350850821d750aff6d09f87b4a77d9fe66a
source: Column '{0}' not found
es: No se encontró la columna "{0}"
fr: Colonne « {0} » introuvable
it: Colonna '{0}' non trovata
pt_br: Coluna ''{0}'' não encontrada
ru: Столбец "{0}" не найден

# ++CODE++186b1f01ef876a3c1fd8101430b6e3f0b83c8960f32e74b36ebe6015c4b15a25
source: Column Name
es: Nombre de la columna
fr: Nom de la colonne
it: Nome colonna
pt_br: Nome da Coluna
ru: Имя столбца

# ++CODE++acc8a3fcd4b7b62165cfa6e4b832566d25a6c172b6c1ec229a59b4eb7eb655a5
source: Column max length cannot be empty
es: La longitud máxima de columna no puede estar vacía
fr: La longueur maximale de la colonne ne peut être vide
it: La lunghezza massima della colonna non può essere vuota
pt_br: O comprimento máximo da coluna não pode estar vazio
ru: Максимальная длина столбца не может быть пустой

# ++CODE++bb7bef87d3a1f764c39c6df670038039c136d360153a1ced5c633afa9590fd36
source: Column name cannot be empty
es: El nombre de la columna no puede estar vacío.
fr: Le nom de colonne ne peut pas être vide
it: Il nome della colonna non può essere vuoto
pt_br: O nome da coluna não pode estar vazio
ru: Имя столбца не может быть пустым.

# ++CODE++5c56d46cc10135f393e52c47f8001e6235ecadc91f6ced732185c1679055aa79
source: Column resize by content
es: Cambio de tamaño de columna por contenido
it: Ridimensiona colonna in base al contenuto
ru: Изменение размера столбца по содержимому

# ++CODE++79304c2a3f7dd799711c04e0513ca9fce1762fbdbf0e8dbd378987d42e35fee5
source: Column width must be at least {0} pixels.
es: El ancho de columna debe ser de al menos {0} píxeles.
it: La larghezza della colonna deve essere di almeno {0} pixel.
ru: Ширина столбца должна быть не менее {0} пикселей.

# ++CODE++53aade77cd69a77bbb51bf8ca4e7ea8b282db75edce8883775e47042478d35b5
source: Columns
es: Columnas
fr: Colonnes
it: Colonne
ja: 列
pt_br: Colunas
ru: Столбцы

# ++CODE++9504ef48c5eab40c3e3a086cbbdc3d70b44e607552db6adfbdd7c278ddabe357
source: Columns in the primary key.
es: Columnas de la clave principal.
fr: Colonnes dans la clé primaire.
it: Colonne nella chiave primaria.
ja: 主キーの列。
pt_br: Colunas na chave primária.
ru: Столбцы в первичном ключе.

# ++CODE++e665046133e22f0d3599a6c5de916445ed88c82a997a625a04af1827c42d790b
source: Command Timeout
es: Tiempo de espera de comando
it: Timeout comando
ru: Время ожидания команды

# ++CODE++b269dc4e81a528a4d42e9e74101923514a626f55f8dd76b1461e0690e72d041a
source: Commands
es: Comandos
it: Comandi
ru: Команды

# ++CODE++e888155d8c7d2e3c3f9eb1bf57e8d81ba1a3c182b5e94b01e09de2cb2cca81f9
source: Compare
es: Comparar
fr: Comparer
it: Confronta
pt_br: Comparar
ru: Сравнить

# ++CODE++c76e4efa9bdedc294be4e0c0a7e42040e5c921d0b30a36e1c6249893b941b662
source: Compare SQL Server editions
es: Comparar ediciones SQL Server
fr: Comparer les éditions de SQL Server
it: Confronta le edizioni di SQL Server
ru: Сравнение выпусков SQL Server

# ++CODE++887138e7ec0b3791877650b8e43bd012cf8d0abd298cbacf5c99ff8c3709c126
source: Compare database schemas across databases, DACPAC files, or SQL projects. Review differences and apply changes or generate deployment scripts to keep schemas in sync.
it: Confrontare gli schemi di database tra database, file DACPAC o progetti SQL. Esaminare le differenze e applicare le modifiche o generare script di distribuzione per mantenere sincronizzati gli schemi.
ru: Сравнивайте схемы баз данных между базами данных, файлами DACPAC или проектами SQL. Анализируйте различия и применяйте изменения или создавайте сценарии развертывания для синхронизации схем.

# ++CODE++5b79ce1b6eead3275d92572d5997ed876b99fe9d47141f8b785abf94a4ff52c0
source: Comparison Details
es: Detalles de comparación
fr: Détails de la comparaison
it: Dettagli del confronto
pt_br: Detalhes da Comparação
ru: Сведения о сравнении

# ++CODE++0891b63d1c799ce3a1d712cee42286cac8db64e6a57701839b06d7937855b14e
source: Compatibility Level
it: Livello di compatibilità

# ++CODE++b3841aead42fd5bf681d290d2fef9df816aa53c2b9a1da6c21f42b11ccc2c9dd
source: Configure Linux containers
es: Configuración de contenedores de Linux
fr: Configurer des conteneurs Linux
it: Configura contenitori Linux
ru: Настройка контейнеров с Linux

# ++CODE++73b680fbf34c02acc61629ac870cb10a5f382c5379516f9dd96777d75a3086fe
source: Configure Rosetta in Docker Desktop
es: Configurar Rosetta en Docker Desktop
fr: Configurer Rosetta dans Docker Desktop
it: Configura Rosetta in Docker Desktop
ru: Настройка Rosetta в Docker Desktop

# ++CODE++33e3ae10b101f647412be0f940cfc04d7d17e7c6f8027b42ae6697852588d1fe
source: Configure and customize SQL Server containers
es: Configuración y personalización de contenedores de SQL Server
fr: Configurer et personnaliser les conteneurs SQL Server
it: Configurare e personalizzare i contenitori di SQL Server
ru: Настройка контейнеров с SQL Server

# ++CODE++c292210c44167923a75b092a008f9d2b194fb08631a6aa43d753ed7931ad4d5e
source: Confirm Password
es: Confirmar contraseña
it: Conferma password
ru: Подтвердить пароль

# ++CODE++73dd96f4085ccfca56f43ca281a29ab8d195fe5fc79b4cb45be11d7830230d63
source: Confirm SQL Server admin password
es: Confirmar contraseña de administrador de SQL Server
it: Confermare la password amministratore del server SQL
ru: Подтвердите пароль администратора SQL Server

# ++CODE++bf000421aeb39493cf8044ec73846d7da8ca97b7166208c0d1172a17ba23a388
source: Confirm new password
es: Confirmar contraseña nueva
it: Conferma nuova password
ru: Подтвердить новый пароль

# ++CODE++eb83f1820ce359dc5c9aa6ca4d08fad60256a9808c58ad93f89db3c182908364
source: Confirm to clear recent connections list
es: Confirmar para borrar la lista de conexiones recientes
fr: Confirmer pour effacer la liste des connexions récentes
it: Confermare per cancellare l'elenco delle connessioni recenti
ja: 最近の接続履歴のクリアを確認
pt_br: Confirme para limpar a lista de conexões recentes
ru: Подтвердите очистку списка недавних подключений

# ++CODE++99fb39ba4e498877a20049303aa3318b2004884dab008c65a3b5dd48f47cdd04
source: Confirm to remove this profile.
es: Confirme para quitar este perfil.
fr: Confirmez pour supprimer ce profil.
it: Confermare per rimuovere questo profilo.
ja: このプロファイルを削除することを確認します。
pt_br: Confirme para remover este perfil.
ru: Подтвердите удаление этого профиля.

# ++CODE++1a2303ede07493acc7caaa7c737f3c52bcc9cf04372be19ed1b0af6b9f2c791e
source: Connect
es: Conectar
fr: Connecter
it: Connetti
ja: 接続
pt_br: Conectar
ru: Подключить

# ++CODE++150851f09acf7f6f4d53e35fb619389c38558ea5b98d3a13efaf84b3eda50422
source: Connect to Database
es: Conectar a base de datos
fr: Connexion à une base de données
it: Connettiti al database
pt_br: Conectar ao Banco de Dados
ru: Подключение к базе данных

# ++CODE++4559fb568a70152599e0f4c5aeae4ca533de114086a7fbd57f5281732c9db33b
source: Connect to MSSQL
es: Conexión a MSSQL
fr: Se connecter à MSSQL
it: Effettua connessione a MSSQL
ru: Подключение к MSSQL

# ++CODE++62de0ed6dbc2218844092662823ae95ac4a9b3cfa6568aeb9913bd4c96512c54
source: Connect to Server
es: Conectar al servidor
fr: Se connecter au serveur
it: Connetti al server
ru: Подключение к серверу

# ++CODE++b34d1cdc1ec3705ae1fac0b6b10b411a0d5f271dfc967f647c99784ba9a323bb
source: Connect to a database
es: Establecer conexión con una base de datos
it: Connessione al database
ru: Подключение к базе данных

# ++CODE++b2c490a777ddf796ff31f0e2a230e002b1329f808ec37cf885ad1bfcd7696ca3
source: Connect to server {0} and database {1}?
es: ¿Conectar con el servidor {0} y la base de datos {1}?
fr: Voulez-vous vous connecter au serveur {0} et à la base de données {1} ?
it: Eseguire la connessione al server {0} e al database {1}?
ru: Установить подключение к серверу {0} и к базе данных {1}?

# ++CODE++c629f4154b93588541a43212104dda942f74b6b1c384f17ed00ccd062e649fb4
source: Connect to server {0}?
es: ¿Conectar al servidor {0}?
fr: Voulez-vous vous connecter au serveur {0} ?
it: Connettersi al server {0}?
ru: Установить подключение к серверу {0}?

# ++CODE++ea9acac28e2644caf0dd7884eec71c1a92d541701276abf4acd5de8d04aa8af9
source: Connect to {0}
es: Conectarse a {0}
fr: Se connecter à {0}
it: Connetti a {0}
ru: Подключение к {0}

# ++CODE++6f00f15723c8b6718a4b05d9bb29188131a2a38b58f11c451e6522a7762c5ad5
source: Connect using profile {0}?
es: ¿Conectar con el perfil {0}?
fr: Voulez-vous vous connecter à l’aide du profil {0} ?
it: Connettersi usando il profilo {0}?
ru: Установить подключение с помощью профиля {0}?

# ++CODE++28d29898bc769fd6df013da142af60f451953946e641fc2a2bee0e49b235a623
source: Connected successfully
es: Conexión correcta
it: Connessione completata
ru: Подключение установлено

# ++CODE++b6c3dc8ba33b3a93b9060f81da8fa7d496f07487cec7a12353257242b2ea9e24
source: Connected to server "{0}" on document "{1}". Server information: {2}
es: Se conectó al servidor "{0}" en el documento "{1}". Información del servidor: {2}
fr: Connecté au serveur « {0} » sur le document « {1} ». Informations du serveur : {2}
it: Connessione al server "{0}" nel documento "{1}". Informazioni sul server: {2}
ja: ドキュメント "{0}" でサーバー "{1}" に接続しました。サーバー情報: {2}
pt_br: Conectado ao servidor "{0}" no documento "{1}". Informações do Servidor: {2}
ru: Выполнено подключение к серверу "{0}" в документе "{1}". Сведения о сервере:{2}

# ++CODE++00aaa2ec4a2146b807cc64a6f59880630adc5d451cd1a68a80e2d2ccf2d21bbc
source: Connected to:
es: Conectado a:
fr: Connecté à :
it: Connesso a:
ru: Подключено к:

# ++CODE++d403c686f6a1048014bdd230f59963271b0123ea48245754fc9f264b962a2182
source: Connecting
es: Conectando
fr: Connexion
it: Connessione in corso
ja: 接続中
pt_br: Conectando
ru: Подключение

# ++CODE++fc83034782062ce727014f496892adc8087186e29e686533f40d6064c70e7c7c
source: Connecting to Container
es: Conectar el contenedor
fr: Connexion au conteneur
it: Connessione al contenitore
ru: Подключение к контейнеру

# ++CODE++bd02214c7799ec6a69018761f76fed82a6516c170ddbc3fdbf6f0c2a7b566d9f
source: Connecting to Database
es: Conectando con la base de datos
it: Connessione al database
ru: Подключение к базе данных

# ++CODE++4f7403da68117c9595b82a6c264837910b1421a60537bcfa77a004a58b0a4c7a
source: Connecting to server "{0}" on document "{1}".
es: Conectando con el servidor "{0}" en el documento "{1}".
fr: Connexion au serveur « {0} » sur le document « {1} ».
it: Connessione al server "{0}" nel documento "{1}".
ja: ドキュメント "{0}" でサーバー "{1}" に接続中です。
pt_br: Conectando-se ao servidor "{0}" no documento "{1}".
ru: Производится подключение к серверу "{0}" в документе "{1}".

# ++CODE++cdfa68f01c8258a3933e2cc436e46a47425d2c5cde4ad327b70a59615b4a4892
source: Connecting to server {0}
es: Conectando con el servidor {0}
fr: Connexion au serveur {0}
it: Connessione al server {0}
ru: Подключение к серверу {0}

# ++CODE++d568f5700106a3d28657010405b5ef04ac5e6f31499216360661ba4f19256e15
source: Connecting to server {0} and database {1}
es: Conexión con el servidor {0} y la base de datos {1}
fr: Se connecter au serveur {0} et à la base de données {1}
it: Connessione al server {0} e al database {1}
ru: Подключение к серверу {0} и к базе данных {1}

# ++CODE++b613d48f906e133dadf56bfc9a00ef15bc7209a24e679f5d5e38df28270ef4f9
source: Connecting to server...
es: Conectando con el servidor...
it: Connessione al server in corso...
ru: Подключение к серверу...

# ++CODE++03cdf40907b9e95ff338fe3d4fd451910410c1dbddd93e543b590a40755e6744
source: Connecting to your SQL Server Docker container
es: Conexión al contenedor Docker de SQL Server
fr: Connexion à votre conteneur Docker SQL Server
it: Connessione al contenitore Docker di SQL Server
ru: Подключение к контейнеру Docker с SQL Server

# ++CODE++9b8df2904fd9e25473fed50a3df04dc0629dec82daa72d6085cab8d1c63e4f65
source: Connecting to {0}...
es: Conectando con {0}...
it: Connessione a {0}in corso...
ru: Подключение к {0}...

# ++CODE++031d95e24e24622c128716284eb67a80331c825272813bf720f2c35a0b18f96c
source: Connecting to:
es: Conexión con:
fr: Connexion à :
it: Connessione a:
ja: 次の場所に接続します:
pt_br: Conectando-se a:
ru: Производится подключение к:

# ++CODE++efb70e946b81dee71e5439537f7160292d511bb79830c8edd338f32e232cf183
source: Connecting using profile {0}
es: Conexión mediante el perfil {0}
fr: Connexion à l’aide du profil {0}
it: Connessione tramite il profilo {0}
ru: Подключение с помощью профиля {0}

# ++CODE++5f04ae9ed6a865bb382c66ef4bd4e57df4ce19d4142b8c87ac40d65ae54d278f
source: Connecting...
es: Conectando...
fr: Connexion en cours... Merci de patienter.
it: Connessione...
ru: Подключение...

# ++CODE++6c916d6a3ffb6e0c85ad115ae2e1f277af1bc76f11a7267fd818b798a796b26a
source: Connection Authentication
es: Autenticación de conexión
it: Autenticazione della connessione
ru: Проверка подлинности подключения

# ++CODE++880cac6e9612c7672ce73c666f54c5f789e7b1ed1b9f0b7f1431fe84a2e59bce
source: Connection Details
es: Detalles de conexión
it: Dettagli connessione
ru: Сведения о подключении

# ++CODE++dba530f818587a0d79d7bb8f59e07d372d10691f49c560e3e4c3d42d105fe9e7
source: Connection Dialog
es: Cuadro de diálogo de conexión
fr: Boîte de dialogue Connexion
it: Finestra di dialogo Connessione
ja: 接続ダイアログ
ru: Диалоговое окно соединения

# ++CODE++ddb621f87c5c0baf1158d527d62ad1bf9752e53483d2540591ce3ae35e06fd6b
source: Connection Error
es: Error de conexión
fr: Erreur de connexion
it: Errore durante la connessione
pt_br: Erro de Conexão
ru: Ошибка подключения

# ++CODE++42aa4e7bc5d2c21a58bb8444c81129c26ccb652e805a73266e8737c55981a6a3
source: Connection Failed
es: Error de conexión
it: Connessione non riuscita
ru: Сбой подключения

# ++CODE++fea70af0cad96e7c97f889724e5dfe0e2d28cbf958e905f5e51ba2584c3d9458
source: Connection Group
es: Grupo de conexiones
fr: Groupe de connexion
it: Gruppo di connessione
ru: Группа подключений

# ++CODE++e98d4b850ce65853ef4019c9a3faa89e9df536698224a7de85bfd83a4dbf35b7
source: Connection Import Warning
it: Avviso importazione connessione
ru: Предупреждение об импорте подключения

# ++CODE++d913a8ab7732ff7d26c8afceb2e2706c5c991762df193b236fd839bd3a616cb6
source: Connection Profile could not be updated. Please modify the connection details manually in settings.json and try again.
es: No se pudo actualizar el perfil de conexión. Modifique los detalles de la conexión manualmente en settings.json e inténtelo de nuevo.
fr: Impossible de mettre à jour le profil de connexion. Modifiez les détails de la connexion manuellement dans settings.json, puis réessayez.
it: Impossibile aggiornare il profilo di connessione. Modificare manualmente i dettagli della connessione in settings.json e riprovare.
ja: 接続プロファイルを更新できませんでした。settings.json で接続の詳細を手動で変更してから、もう一度お試しください。
pt_br: Não foi possível atualizar o Perfil de Conexão. Modifique os detalhes da conexão manualmente em settings.json e tente novamente.
ru: Не удалось обновить профиль подключения. Измените детали подключения вручную в файле settings.json и повторите попытку.

# ++CODE++a2caae6025f30a0976030ae3ea92ab948f6b580d5f50272514ba36e31c8d1d09
source: Connection String
es: Cadena de conexión
fr: Chaîne de connexion
it: Stringa di connessione
ja: 接続文字列
pt_br: Cadeia de Conexão
ru: Строка подключения

# ++CODE++e4ce453aa184d4cd0a2051dfb91ab491ba8b19c756bd9f113b7a1ce1e807b02e
source: Connection Timeout
es: Tiempo de espera de la conexión
it: Timeout connessione
ru: Время ожидания подключения

# ++CODE++8d137af9c64fba09bbb003aba93f0b029898fe19e7927cd696f4c3e2b69f538d
source: Connection error
es: Error de conexión
fr: Erreur de connexion
it: Errore di connessione
ja: 接続エラー
pt_br: Erro de conexão
ru: Ошибка подключения

# ++CODE++b6ab038b215e73e2ef60b1b4afc9ef7cd9d76c67a2e266eec2d806e53701ca2d
source: Connection failed: {0}
es: Error de conexión: {0}
it: Connessione non riuscita: {0}
ru: Сбой подключения: {0}

# ++CODE++4af9562e151d82d6647b49a0ebb192051f470999bc80f52dfe8fa8d23aa3ff95
source: Connection group with the same ID is already imported: {0} (ID: {1})
it: Il gruppo di connessioni con lo stesso ID è già stato importato: {0} (ID: {1})
ru: Группа подключений с таким идентификатором уже импортирована: {0} (ИД: {1})

# ++CODE++7c0b4997ad257dfe10892180163f8656c4d2d663589677ba6690790f54fb519e
source: Connection groups to import
it: Gruppi di connessione da importare
ru: Группы подключений для импорта

# ++CODE++fb6d70b252967b1a424bfa1f8be6c56eb3359e0a7f86d477837002be7af317f3
source: Connection is not active. Please establish a connection before performing this action.
es: La conexión no está activa. Establezca una conexión antes de realizar esta acción.
it: La connessione non è attiva. Stabilire una connessione prima di eseguire questa azione.
ru: Подключение не активно. Установите подключение перед выполнением этого действия.

# ++CODE++28512f31201abdd26ae93d0caaba3b8a3c77113b9665059a9e1d2ba4e47de64d
source: Connection not found for uri "{0}".
es: No se encontró la conexión para el URI "{0}".
fr: Connexion introuvable pour l’URI « {0} »
it: Impossibile trovare la connessione per l'URI "{0}".
ja: URI "{0}" の接続が見つかりません。
pt_br: Conexão não encontrada para o URI “{0}”.
ru: Подключение не найдено для URI "{0}".

# ++CODE++392f78e8df5a591be501949632cd689e0fd59c4e0233c8b002a2dce8518ad4e4
source: Connection profile '{0}' not found.
es: No se encontró el perfil de conexión ''{0}".
fr: Profil de connexion « {0} » introuvable.
it: Profilo di connessione '{0}' non trovato.
ru: Профиль подключения "{0}" не найден.

# ++CODE++d7ab7c0f4c608ef31b73519723a5e437bde717796c5946c33d68cfd96501e3f8
source: Connection sharing permission denied for extension: '{0}'. Use the permission management commands to change this.
es: Permiso de uso compartido de conexiones denegado para la extensión: '{0}'. Use los comandos de administración de permisos para cambiar esto.
it: Autorizzazione per la condivisione della connessione negata per l'estensione: '{0}'. Usare i comandi di gestione delle autorizzazioni per modificare questa impostazione.
ru: Отказано в разрешении на совместное использование подключения для расширения: "{0}". Используйте команды управления разрешениями, чтобы изменить это.

# ++CODE++6fc14523d003cf70290f0110eeafa850232518f52a0d26436b18c1e838cf1c27
source: Connection sharing permission is required for extension: '{0}'
es: Se requiere el permiso de uso compartido de conexiones para la extensión: '{0}'
it: È necessaria l'autorizzazione per la condivisione della connessione per l'estensione: '{0}'
ru: Требуется разрешение на совместное использование подключения для расширения: "{0}"

# ++CODE++83035e9200f6fdd69864139d77f16bd50bd19373c53fc216611778d70a865e2a
source: Connection string copied to clipboard
es: La cadena de conexión se ha copiado en el portapapeles
it: Stringa di connessione copiata negli appunti
ru: Строка подключения скопирована в буфер обмена

# ++CODE++e0626fd341a12763ec4285d858397c3d4ba2507c9ef567f1284c658bde195cd2
source: Connection string is required
es: La cadena de conexión es obligatoria
fr: La chaîne de connexion est requise
it: È necessario specificare la stringa di connessione
ja: 接続文字列が必要です
pt_br: A cadeia de conexão é obrigatória
ru: Требуется указать строку подключения

# ++CODE++6ae8947e98979cbbaeb55a8af448297f63002580ddebd9731fd40ec3ddcdc849
source: Connection with ID "{0}" not found. Please verify the connection ID exists.
es: No se encontró la conexión con el id. "{0}". Compruebe que el identificador de conexión existe.
it: Connessione con ID "{0}" non trovata. Verificare che l'ID connessione esista.
ru: Подключение с идентификатором "{0}" не найдено. Убедитесь, что идентификатор подключения существует.

# ++CODE++2f3daf0cd0f2a34f9d404145647a7a71178161552fe7dc9acba74d5b8d14cc49
source: Connection with the same ID is already imported: {0} (ID: {1})
it: La connessione con lo stesso ID è già stata importata: {0} (ID: {1})
ru: Подключение с таким идентификатором уже импортировано: {0} (ИД: {1})

# ++CODE++b08ee8f8534ee808b03d2a6534a0f3988a149469b487454af076faf4a3b98a3d
source: Connections in groups that are not selected will be moved under the root.
it: Le connessioni presenti in gruppi non selezionati verranno spostate in corrispondenza della radice.
ru: Подключения из групп, которые не выбраны, будут перемещены в корень.

# ++CODE++1a801115b9a0d4c2fd181f8d8e7daaccd3defe421a8b586592134cf4c1c47c94
source: Connections to import
it: Connessioni da importare
ru: Подключения для импорта

# ++CODE++917801babf61b34ef1c1d96e3219bc6ba28693c81f2c5af5cc00a31d0793a317
source: Consider adding a name for this foreign key
es: Considere la posibilidad de agregar un nombre para esta clave externa
fr: Envisager d’ajouter un nom pour cette clé étrangère
it: Considera di aggiungere un nome per questa chiave esterna
pt_br: Considere adicionar um nome para esta chave estrangeira
ru: Рассмотрите возможность добавить имя для этого внешнего ключа

# ++CODE++ca0fa7ee8e0d9d4e742094db2e8d59b963dce003cc884c8573d64d59fcfe16dd
source: Container Name
es: Nombre del contenedor
fr: Nom du conteneur
it: Nome contenitore
ru: Имя контейнера

# ++CODE++06659b52e63599b06c4386ad5423c3dc67b010f0dbbd03cba2f48b68ed1b62f5
source: Container does not exist. Would you like to remove the connection?
es: El contenedor no existe. ¿Desea quitar la conexión?
fr: Le conteneur n'existe pas. Voulez-vous supprimer la connexion ?
it: Il contenitore non esiste. Rimuovere la connessione?
ru: Контейнер не существует. Удалить подключение?

# ++CODE++8ad8440f3fcfd714e6310b217eaae7d43f1100a0730348dff4116c3aa3f08fcd
source: Container failed to start within the timeout period. Please wait a few minutes and try again.
es: El contenedor no se pudo iniciar dentro del período de tiempo de expiración. Espere unos minutos e inténtelo de nuevo.
fr: Échec du démarrage du conteneur dans le délai imparti. Veuillez patienter quelques minutes et réessayer.
it: Non è possibile avviare il contenitore entro il periodo di timeout. Attendere qualche minuto e riprovare.
ru: Не удалось запустить контейнер в течение времени ожидания. Подождите несколько минут, затем повторите попытку.

# ++CODE++e846628c8d11bbf73a6ca39eb691f5f7802ba88cf1fb0c482997d928b1504fcb
source: Containment Type
it: Tipo di indipendenza

# ++CODE++2eaecb3d0cf1282f01fc09568b63dc633753a0dbf337365d929d9c28df3d6ca4
source: Contains
es: Contiene
fr: Contient
it: Contiene
ja: 含む
pt_br: Contém
ru: Содержит
