Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++db8916a9e121c88e488cc019e97f752538fe362701a492cbf905fa8e1cddf4d1
source: Enter application name
es: Escriba el nombre de la aplicación
it: Immettere nome dell'applicazione
ru: Введите имя приложения

# ++CODE++cad17aa68a83418367684821ea4734c877707d1f340846dc7b17b04a8a04c1c0
source: Enter connection group name
es: Escriba el nombre del grupo de conexiones
fr: Entrez le nom du groupe de connexion
it: Immettere il nome del gruppo di connessione
ru: Введите имя группы подключений

# ++CODE++524763fd6773ea93d76fa32d9e5974e1667748b114b90fba93f6a4948b0e5c20
source: Enter container name
es: Escriba el nombre del contenedor
fr: Entrer le nom du conteneur
it: Immetti il nome contenitore
ru: Введите имя контейнера

# ++CODE++0d3a147293b3df0c28fee2dbdba17e22f2eee2b014ae708c0d11339146f9f8be
source: Enter database name
es: Escriba el nombre de la base de datos
it: Immetti nome del database
ru: Введите имя базы данных

# ++CODE++91cf329b31a4b1a6c0bdec6de797b6a90ab9309490bd62ec38f98f2d0f6db423
source: Enter description (optional)
es: Escriba la descripción (opcional)
fr: Entrez une description (facultatif)
it: Immettere la descrizione (facoltativo)
ru: Введите описание (необязательно)

# ++CODE++657e6ba252bef59f38c0dbaab7e8e25d55503ba3a41d6ce527f92c88baea3576
source: Enter desired column width in pixels
es: Escriba el ancho de columna deseado en píxeles
it: Immettere la larghezza di colonna desiderata in pixel
ru: Введите желаемое значение ширины столбца в пикселях

# ++CODE++caaac8aa0d0641aea8406e7f1011aaeab33423fdd4ee9b3354ee88cc1487b0bf
source: Enter hostname
es: Escriba el nombre de host
fr: Entrer un nom d'hôte
it: Immetti il nome host
ru: Введите имя узла

# ++CODE++b35ebaaf32f469f2fa86b0b2fb67e6f51fae3fb8e6ceaeaea97c2696321a8ee4
source: Enter new column width
es: Escribir nuevo ancho de columna
fr: Saisissez une nouvelle largeur de colonne
it: Specificare la larghezza della nuova colonna
ja: 新しい列幅を入力する
pt_br: Inserir nova largura da coluna
ru: Введите новую ширину столбца

# ++CODE++15f691f800a4b76afbf264547e3718c96fbb46fc076005b8f12575eac2f1f136
source: Enter new password
es: Escribir nueva contraseña
it: Immetti la nuova password
ru: Введите новый пароль

# ++CODE++03c72a0dd31428f797eaadef0452b218e6d7cfbfc8b66e7f47e404818a53cda0
source: Enter part of an object name to search for
es: Escriba parte de un nombre de objeto para buscar
it: Immettere parte del nome di un oggetto da cercare
ru: Введите часть имени объекта для поиска

# ++CODE++7014aff13517c4071a9de8a8d338ac3ca12ae8ecf6589941d84170aa47cdcac3
source: Enter password
es: Escribir contraseña
fr: Entrer le mot de passe
it: Immetti la password
ru: Введите пароль

# ++CODE++6aa7783e2e2dbd69be673f5f534fa04a7d36683475767069e8030c958e318d47
source: Enter port
es: Escriba el puerto
fr: Entrer un port
it: Immetti la porta
ru: Введите порт

# ++CODE++0a6b9ae24f863f5d06e0151c62f16b9327fdac6783807dc163e953559aa8287f
source: Enter profile name
es: Escriba el nombre del perfil
fr: Entrer le nom du profil
it: Immetti il nome profilo
ru: Введите имя профиля

# ++CODE++e8ebf41062c66e03ca98f0459c1a1084a419d525efb3b86b92f01f25edfebbde
source: Enter the SQL Login password for user '{0}'.
it: Immettere la password di accesso SQL per l'utente '{0}'.
ru: Введите пароль для входа в SQL для пользователя {0}.

# ++CODE++493f89b5d0c917509476602a7ad84ca70dd6bba7558fa30416f54c5c0458e15c
source: Enter the new database name
it: Immettere il nome del nuovo database

# ++CODE++41058600ed8ab3d197264132f1b22ed25b7b2d9fa6afdffd559fc08bca9e6075
source: Enter the path for the output file
es: Introduzca la ruta del archivo de salida
it: Inserire il percorso del file di output
ru: Введите путь к выходному файлу

# ++CODE++f889729267bd3b6e2a0a503ad9228cced8a1d16ad04a3384dc6df5dc89d6ba4c
source: Entity Endpoints
it: Endpoint entità
ru: Конечные точки сущности

# ++CODE++1a7d4ddcb0e36ec5b7122b03dcf1a9b7d02395011c7daf2e7591c4f71b638702
source: Entity Name
it: Nome entità
ru: Имя сущности

# ++CODE++b1d3adb989e3b895976094fd8242c98ab0d88c5e2dcd929bd6d76a8b52ce3f4c
source: Entity name used in API routes
it: Nome di entità usato nelle route API
ru: Имя сущности, используемое в маршрутах API

# ++CODE++d59e5e8f8a4bb3b14eb8af194553158e5dffd648ad462eeafb2f03589da5a8eb
source: Entra token cache cleared successfully.
es: La caché de tokens de Entra se ha borrado correctamente.
it: La cancellazione della cache dei token di Entra è stata completata.
ru: Кэш токенов Entra очищен.

# ++CODE++6a26ff8ea94b68652cba40696c6b1f68207e110027a0862a3a5e030c2d103eb1
source: Equal to
es: Igual a
it: Uguale a
ru: Равно

# ++CODE++f939ae3d30c69e332a36892f70d401d457e6993f056b8d0af3fe3d736821f5a1
source: Equals
es: Es igual a
fr: Est égal à
it: Uguale a
ja: 等しい
pt_br: Igual a
ru: Равно

# ++CODE++54a0e8c17ebb21a11f8a25b8042786ef7efe52441e6cc87e92c67e0c4c0c6e78
source: Error
fr: Erreur
it: Errore
pt_br: Erro
ru: Ошибка

# ++CODE++f251a7b2d632de7a4122dafe6fd4a9e984d632ffe0c1e71591e5e253ea9fda11
source: Error Message:
es: Mensaje de error:
fr: Message d’erreur :
it: Messaggio di errore:
ja: エラー メッセージ:
pt_br: Mensagem de Erro:
ru: Сообщение об ошибке:

# ++CODE++d0778b9c6b80f4a1e5c99227f273ca819714dbc51f673a92c354874eaa4a3f7c
source: Error code:
es: Código de error:
fr: Code d’erreur :
it: Codice errore:
ja: エラー コード:
pt_br: Código de erro:
ru: Код ошибки:

# ++CODE++609a5b573e17dee5039d1039c26a1601bb44dd596695c7767c81877925759cd7
source: Error connecting to server "{0}". Details: {1}
es: Error al conectar con el servidor "{0}". Detalles: {1}
fr: Erreur de connexion au serveur « {0} ». Détails : {1}
it: Errore di connessione al server "{0}". Dettagli: {1}
ja: サーバー "{0}" への接続中にエラーが発生しました。詳細: {1}
pt_br: Erro ao conectar-se ao servidor "{0}". Detalhes: {1}
ru: При подключении к серверу "{0}" возникла ошибка. Подробности: {1}

# ++CODE++480311d3f925f85184b69381dc5f05bb2607e6beb8d354ffe58276a0cd1dd5d9
source: Error connecting to:
es: Error de conexión con:
fr: Erreur de connexion à :
it: Errore di connessione a:
ja: 次の場所への接続エラー:
pt_br: Erro ao conectar-se a:
ru: Ошибка при подключении к:

# ++CODE++268604d30ba8caf436360709d0933805fb33fe3c3bb87a0782ce8c393ecf7da4
source: Error creating firewall rule {0}. Check your Azure account settings and try again. Error: {1}
es: Error al crear la regla de firewall {0}. Compruebe la configuración de la cuenta de Azure y vuelva a intentarlo. Error: {1}
fr: Erreur lors de la création de la règle de pare-feu {0}. Vérifiez les paramètres de votre compte Azure et réessayez. Erreur : {1}
it: Errore durante la creazione della regola del firewall {0}. Controllare le impostazioni dell'account Azure e riprovare. Errore: {1}
pt_br: Erro ao criar regra de firewall {0}. Verifique as configurações da sua conta do Azure e tente novamente. Erro: {1}
ru: Ошибка при создании правила брандмауэра {0}. Проверьте параметры учетной записи Azure и повторите попытку. Ошибка: {1}

# ++CODE++60cc09ec4655851867d21c226d2f49026746cd374b1822a2b46264601219b206
source: Error generating text view. Please try switching back to grid view.
es: Error al generar la vista de texto. Intente volver a la vista de cuadrícula.
fr: Erreur de génération de la vue de texte. Veuillez essayer de revenir à l’affichage en grille.
it: Errore durante la generazione della visualizzazione Testo. Prova a tornare alla visualizzazione Griglia.
ru: Ошибка при создании текстового представления. Попробуйте переключиться на представление сетки.

# ++CODE++8f53a6df59ae589cf0996134e10ad383f8914500648095194f2d16cc2427954b
source: Error loading Azure account information for tenant ID '{0}'
es: Error al cargar la información de la cuenta de Azure para el id. de inquilino '{0}'
fr: Erreur lors du chargement des informations de compte Azure pour l’ID de locataire '{0}'
it: Si è verificato un errore durante il caricamento delle informazioni sull'account Azure per l'ID tenant '{0}'
pt_br: Erro ao carregar as informações da conta do Azure para a ID do locatário '{0}'
ru: Ошибка при загрузке сведений об учетной записи Azure для идентификатора '{0}'

# ++CODE++5a50d3034b36e62aa3eaca3fc11e55b184039c652bfdfe1ffb032321677bd530
source: Error loading Azure databases for subscription {0} ({1}). Confirm that you have permission.
es: Error al cargar las bases de datos de Azure para la suscripción {0} ({1}). Confirme que tiene permiso.
fr: Erreur lors du chargement des bases de données Azure pour l'abonnement {0} ({1}). Confirmez que vous avez la permission.
it: Si è verificato un errore durante il caricamento dei database di Azure per la sottoscrizione {0} ({1}). Confermare di disporre dell'autorizzazione.
pt_br: Erro ao carregar bancos de dados do Azure para assinatura {0} ({1}). Confirme se você tem permissão.
ru: Ошибка при загрузке баз данных Azure для подписки {0} ({1}). Подтвердите, что у вас есть разрешение.

# ++CODE++4eca430ed6ea02cdcd0e956ce27d238e2659997f15a4f580b0fd3385cfd815a0
source: Error loading Azure databases.
es: Error al cargar las bases de datos de Azure.
fr: Erreur lors du chargement des bases de données Azure.
it: Errore durante il caricamento dei database di Azure.
pt_br: Erro ao carregar bancos de dados do Azure.
ru: Ошибка при загрузке баз данных Azure.

# ++CODE++5b149b9da8f7cd0bdae05ad12cd9e4f650db61436fb31c868a6568695dce21f2
source: Error loading Azure subscriptions.
es: Error al cargar las suscripciones de Azure.
fr: Désolé, erreur lors du chargement des abonnements Azure.
it: Errore durante il caricamento delle sottoscrizioni di Azure.
pt_br: Erro ao carregar assinaturas do Azure.
ru: Ошибка при загрузке подписок Azure.

# ++CODE++28ec099944dfbabd99dd35f89ef90d8d7e06ee1707d429fb19c164673eadb4d7
source: Error loading Schema Designer
es: Error al cargar el Diseñador de esquemas
it: Errore durante il caricamento di Progettazione schemi
ru: Ошибка загрузки конструктора схем

# ++CODE++a132cfddde2248d0fb1ee8faf8bf85c14bd878f0c814c9cdfdd4bc28092b37b0
source: Error loading Table Designer
es: Error al cargar Diseñador de tablas
it: Errore durante il caricamento di Progettazione tabelle
ru: Ошибка загрузки конструктора таблиц

# ++CODE++42ae158b81fa6835d984f032a4850d9242fc9551860b90117a5f78c9a76d30a7
source: Error loading databases
es: Error al cargar las bases de datos
it: Errore durante il caricamento dei database
ru: Ошибка при загрузке баз данных

# ++CODE++6d89c16c7cf3f832b29fe1d181d420d4a583f93bb02e63fdfa266c33b6b3fcaf
source: Error loading preview
es: Error al cargar la vista previa
fr: Erreur lors du chargement de l'aperçu
it: Errore durante il caricamento dell'anteprima
ja: プレビューの読み込みエラー
pt_br: Erro ao carregar a exibição
ru: Ошибка при загрузке предварительного просмотра

# ++CODE++fa8002fe1d41e09812880f2bfb97ef0849885d8a4de95a67b26294b7e83e912f
source: Error loading summary
es: Error al cargar el resumen
it: Errore durante il caricamento del riepilogo
ru: Ошибка при загрузке сводки

# ++CODE++8108929d06fb4fe87c58e7407990ec8d46dc422dfa3ee467d2f5f622abd9840d
source: Error loading summary: {0}
es: Error al cargar el resumen: {0}
it: Errore durante il caricamento del riepilogo: {0}
ru: Ошибка при загрузке сводки: {0}

# ++CODE++3ba789024640c6f231695bdf0d82e6845483cf65f092b3c3646910e60c638761
source: Error loading workspaces
es: Error al cargar las áreas de trabajo
it: Errore durante il caricamento delle aree di lavoro
ru: Ошибка при загрузке рабочих областей

# ++CODE++b154b77abde300c955ebf8ac540930618d871899cd631bf8a90e9efb66a9323e
source: Error loading workspaces. Please try choosing a different account or tenant.
es: Error al cargar las áreas de trabajo. Pruebe a elegir otra cuenta o inquilino.
it: Errore durante il caricamento delle aree di lavoro. Provare a scegliere un account o un tenant diverso.
ru: Ошибка при загрузке рабочих областей. Попробуйте выбрать другую учетную запись или клиент.

# ++CODE++2b850d590d607436d4cbf751406a7626e01d0e5c775f26c880ab4fd21e70bb66
source: Error loading; refresh to try again
es: Error al cargar; actualizar para volver a intentarlo
fr: Erreur lors du chargement, actualisez pour réessayer
it: Errore durante il caricamento; aggiornare per riprovare
pt_br: Erro ao carregar; atualizar para tentar novamente
ru: Ошибка загрузки. Обновите, чтобы повторить попытку

# ++CODE++1991a10d051f3811602fc80483727c19b7b89172132fd03d816a064cfd3a87ac
source: Error migrating connection ID {0} to new format. Please recreate this connection to use it. Error: {1}
es: Error al migrar el identificador de {0} conexión al nuevo formato. Vuelva a crear esta conexión para usarla. Error: {1}
fr: Une erreur s’est produite lors de la migration de l’ID de connexion {0} au nouveau format. Veuillez recréer cette connexion pour l’utiliser. Erreur : {1}
it: Si è verificato un errore durante la migrazione dell'ID connessione {0} al nuovo formato. Ricreare questa connessione per utilizzarla. Errore: {1}
ru: Ошибка при переносе идентификатора подключения {0} в новый формат. Повторно создайте это подключение, чтобы использовать его. Ошибка: {1}

# ++CODE++619d1a6dc49f043552f7b8d14e6483de4a2caf1c8270d6168a642c8eccc3a752
source: Error occurred opening content in editor.
es: Error al abrir contenido en el editor.
fr: Une erreur s’est produite lors de l’ouverture du contenu dans l’éditeur.
it: Si è verificato un errore durante l'apertura del contenuto nell'editor.
ja: エディターでコンテンツを開くときにエラーが発生しました。
pt_br: Erro ao abrir o conteúdo no editor.
ru: При открытии документа в редакторе произошла ошибка.

# ++CODE++7ce810c92d5881cd4638f73772ee57317b503d0f04dbc5cd2f281f77ac1d697d
source: Error retrieving server list: {0}
es: Error al recuperar la lista de servicio: {0}
it: Errore durante il recupero dell'elenco server: {0}
ru: Ошибка при получении списка серверов:{0}

# ++CODE++2982897442ab8ee74ad10f968e801f2979c59ecc19ae9d2041eeedec219fd8f1
source: Error running Docker commands. Please make sure Docker is running.
es: Error al ejecutar comandos de Docker. Asegúrese de que Docker se está ejecutando.
fr: Erreur lors de l'exécution des commandes Docker. Veuillez vérifier que Docker est en cours d’exécution.
it: Errore durante l'esecuzione dei comandi Docker. Assicurarsi che Docker sia in esecuzione.
ru: Ошибка при выполнении команд Docker. Убедитесь, что средство Docker запущено.

# ++CODE++7c03518af7ea8058b9f5444011cc402ee48c86c765dfd6ba8e5ce09ed8d836ca
source: Error signing into Azure: {0}
es: Error al iniciar sesión en Azure: {0}
fr: Erreur de connexion à Azure : {0}
it: Errore durante l'accesso ad Azure: {0}
ru: Ошибка при входе в Azure: {0}

# ++CODE++e3bd07d6d5ddff1c7aefd27f1d3af9d23b97fc19d29d732816ea80fddb08f4dc
source: Error when refreshing token
es: Error al actualizar el token
fr: Erreur lors de l’actualisation du jeton
it: Errore durante l'aggiornamento del token
ja: トークンの更新中にエラーが発生しました
pt_br: Erro ao atualizar o token
ru: Ошибка при обновлении маркера

# ++CODE++126ac0f6a36d10138034e44aae3e764f15c8eabba9192445716609b37d21bda9
source: Error {0}: {1}
fr: Erreur {0} : {1}
it: Errore {0}: {1}
ja: エラー {0}: {1}
pt_br: Erro {0}: {1}
ru: Ошибка {0}: {1}

# ++CODE++ff26e86bb0cdcae6cd4f1dcfbf7c61047f96a2ae5cdbd9fe0111ed6bd95b2193
source: Error {0}: {1} Please login as a different user and change the password using ALTER LOGIN.
es: Error {0}: {1}. Inicie sesión como un usuario diferente y cambie la contraseña mediante ALTER LOGIN.
fr: Erreur {0} : {1} Connectez-vous avec un utilisateur différent et changez le mot de passe à l’aide d’ALTER LOGIN.
it: Errore {0}: {1}. Eseguire l'accesso con un altro utente e cambiare la password usando ALTER LOGIN.
ja: エラー {0}: {1} 別のユーザーとしてログインし、ALTER LOGIN を使用してパスワードを変更してください。
pt_br: Erro {0}: {1}. Faça logon como um usuário diferente e altere a senha usando ALTER LOGIN.
ru: Ошибка {0}: {1}. Попробуйте войти с учетной записью другого пользователя и измените пароль с помощью инструкции ALTER LOGIN.

# ++CODE++8eecdde079a9092758e271d5a21f28eadbeedb35716353e07cfeb33f52e8005c
source: Error:
fr: Erreur :
it: Errore:
ja: エラー:
pt_br: Erro:
ru: Ошибка:

# ++CODE++6c1ebcf47761be137441b5293902752b802776fa5edd4ebf0193950f1adff0e8
source: Error: Login failed. Retry using different credentials?
es: Error: no se pudo iniciar sesión. ¿Quiere volver a intentarlo con otras credenciales?
fr: Erreur : échec de la connexion. Réessayer en utilisant d’autres informations d’identification ?
it: Errore: accesso non riuscito. Riprovare con credenziali diverse?
ja: エラー: ログインに失敗しました。別の資格情報を使用して再試行しますか?
pt_br: Erro: falha no logon. Deseja tentar novamente usando credenciais diferentes?
ru: Ошибка: не удалось войти в систему. Хотите повторить попытку с другими учетными данными?

# ++CODE++9d8c40f184be0169233d713fa64128ca200db300743a2adbb700912c74b5620d
source: Error: Unable to connect using the connection information provided. Retry profile creation?
es: Error: No puede conectarse con la información de conexión proporcionada. ¿Reintentar la creación del perfil?
fr: Erreur : impossible de se connecter en utilisant les informations de connexion fournies. Réessayer la création du profil ?
it: Errore: non è possibile connettersi usando le informazioni di connessione fornite. Ripetere la creazione del profilo?
ja: エラー: 指定した接続情報を使用して接続できません。プロファイルの作成を再試行しますか?
pt_br: Erro: não é possível conectar usando as informações de conexão fornecidas. Tentar novamente a criação de perfil?
ru: Ошибка: не удается подключиться с использованием предоставленных деталей подключения. Хотите повторить попытку создания профиля?

# ++CODE++01ae099f23b8fe85d27a9e26613eb2624bd76e11505385e3493f316afde824c2
source: Exclude Object Types
es: Excluir tipos de objeto
it: Escludi i tipi di oggetto
ru: Исключить типы объектов

# ++CODE++e3a67d9540e9a204f7dc4aa9d44a0ec652856cfa932a21196bf9df23aa0e4cd1
source: Execute
es: Ejecutar
fr: Exécuter
it: Esegui
ru: Выполнить

# ++CODE++0a716f1cfed3e0da68a8eee920bd5ca51a470c790800d878429da7ab9ecf0d56
source: Executing query...
es: Ejecutando consulta...
fr: Exécution de la requête...
it: Esecuzione della query in corso...
ja: クエリを実行しています...
pt_br: Executando consulta...
ru: Выполняем запрос...

# ++CODE++bd705ebabe1919a636a0e09b2ee27d43a5aba05d645cc0339451e54b37f42bd6
source: Execution Plan
es: Plan de ejecución
fr: Plan d’exécution
it: Piano di esecuzione
ja: 実行プラン
pt_br: Plano de Execução
ru: План выполнения

# ++CODE++e6f85bab1a8295e091b4d2324b0e37eeacee571d5d3d7cd29827be17e7a0aa52
source: Existing Database
es: Base de datos existente
it: Database esistente
ru: Существующая база данных

# ++CODE++07548c2c6511d4d1780564de8a237a1966cf9c99a97cf5c8a185e6c2aeacff09
source: Expand
es: Expandir
fr: Développer
it: Espandi
pt_br: Expandir
ru: Развернуть

# ++CODE++9f5b023a413a7d0771cc3fb51b103dc0aaaafe8f7b7c88c7258d43e3bc5b243d
source: Expand All
es: Expandir todo
fr: Développer tout
it: Espandi tutto
ja: すべて展開
pt_br: Expandir Tudo
ru: Развернуть все

# ++CODE++48ad32aba89e3b0bbab4397b56bd23794212fe69606e0b644ff3b543035a048d
source: Expand Workspace Explorer
es: Expandir explorador del área de trabajo
it: Espandi Esplora aree di lavoro
ru: Развернуть проводник по рабочим областям

# ++CODE++d2fc073e6098215896ebf6c1a31f09b47f966e3c1280eec921d00fb2fbdea336
source: Expand all groups
es: Expandir todos los grupos
it: Espandi tutti i gruppi
ru: Развернуть все группы

# ++CODE++de60696021738b970e35e0ce59d441a5dc7eadd336ac90d3db9de15a6e4318a2
source: Expand connection groups
it: Espandere i gruppi di connessione
ru: Развернуть группы подключений

# ++CODE++a278c1ed2486fecd0d324085d0a85dc6b97cb2444cd15978e2ccbea319157b62
source: Expand connections
it: Espandere connessioni
ru: Развернуть подключения

# ++CODE++d9c008a5e0915c79e82398085c2cd4b029fe53d96880ed8b874bf0bf0d52fb5b
source: Expand properties pane
es: Expandir panel de propiedades
it: Espandere riquadro proprietà
ru: Развернуть панель свойств

# ++CODE++a0c63383db5f8661b595463ea3a315d20546235fa0124096696606ebccb73c0c
source: Explore tutorials, docs, and what's coming next.
it: Esplora esercitazioni, documenti e novità.
ru: Изучите руководства, документацию и планы на будущее.

# ++CODE++94138882fa79d94e5c8eb6335f75a2e88f4f1cffbe0ea7b598dd0c9fad748470
source: Explore, design, and evolve database schemas using intelligent, code-first or data-first guidance
es: Explorar, diseñar y evolucionar esquemas de base de datos con una guía inteligente basada en código primero o datos primero
it: Esplora, progetta ed evolvi gli schemi di database con indicazioni intelligenti, code-first e data-first
ru: Изучайте, проектируйте и развивайте схемы баз данных с помощью интеллектуальных рекомендаций для кода или данных

# ++CODE++3664895579f0a7e68c4aa09c91316e20239bc74499010e6423ece40cad7c28f7
source: Export
es: Exportar
fr: Exporter
it: Esporta
pt_br: Exportar
ru: Экспорт

# ++CODE++59be81f2f62e6ced348ccc806b1a50d9370c0f19a8bb5f7fbf8a801d4c93bdca
source: Export BACPAC
es: Exportar BACPAC
it: Esporta BACPAC
ru: Экспорт BACPAC

# ++CODE++db58c9165373339af3f704ec69490c93458bb6a0c870a7dca79c243948cc02e1
source: Export the schema and data from a SQL database to a .bacpac file
es: Exportar el esquema y los datos de una base de datos SQL a un archivo .bacpac
it: Esportare lo schema e i dati da un database SQL in un file con estensione bacpac
ru: Экспорт схемы и данных из базы данных SQL в файл BACPAC

# ++CODE++73194761249a0ab480df4f1fa38f32ed5b3adcd3a41c304c9aae9cd4e8661a05
source: Export to CSV
es: Exportar a CSV
it: Esporta in CSV
ru: Экспортировать в CSV

# ++CODE++8b4b9f7cd9a3ba50b51932300eb1556cac2635bca03b77058950aa0345d66bbf
source: Export to Excel
es: Exportar a Excel
it: Esporta in Excel
ru: Экспорт в Excel

# ++CODE++b9a5f7a679be3491c633f828f30741103a02f65654b87470f4a17a23a7838fc3
source: Export to JSON
es: Exportar a JSON
it: Esporta in JSON
ru: Экспорт в JSON

# ++CODE++6d674141a1f7fa066558d560d375dacfcac4d3cc49647fd80b0c0008fdfd54d5
source: Export to tab delimited
es: Exportar a delimitado por tabulaciones
it: Esporta in una file con valori delimitati da tabulazioni
ru: Экспорт в формат, разделенный табуляциями

# ++CODE++afcbbda58db9bb6a697a0d5558541c82d1f956426fcad621e37feb68d3b35fbb
source: Export to text format
es: Exportar al formato de texto
it: Esporta in formato testo
ru: Экспорт в текстовый формат

# ++CODE++de5cd90f5341f8bb2ebe10270705fa436ac43f8c5ff653358b9eee3a56323ec4
source: Exporting BACPAC...
es: Exportando BACPAC...
it: Esportazione di BACPAC in corso...
ru: Экспорт BACPAC...

# ++CODE++c67415bcff328a59fd399e2a7ca9691e0044192fb7480ae501644339965d046d
source: Expression
es: Expresión
it: Espressione
ja: 式
pt_br: Expressão
ru: Выражение

# ++CODE++09fb0b40c52653920efa7d90c989b0455616a837458b1690dd908a961ae768dc
source: Extract DACPAC
es: Extraer DACPAC
it: Estrai pacchetto di applicazione livello dati
ru: Извлечь DACPAC

# ++CODE++ae978d30fd899796154f535e3b3c547d46b2bd0c5e738928c553ce1e1e426fc8
source: Extract the schema from a SQL database to a .dacpac file
es: Extraer el esquema de una base de datos SQL a un archivo .dacpac
it: Estrarre lo schema da un database SQL in un file con estensione dacpac
ru: Извлечь схему из базы данных SQL в файл DACPAC

# ++CODE++e4c61f0d341293c441bab44693218614d6045d574d51221cd6a65d43ec0e04d4
source: Extracting DACPAC...
es: Extrayendo DACPAC...
it: Estrazione di pacchetto di applicazione livello dati in corso...
ru: Извлечение DACPAC...

# ++CODE++0556bfb755c73e8c60da1230c38f26ce0eaf79dc7bd5f5368371d561e5eab52f
source: Extremely likely
es: Muy probable
fr: Extrêmement probable
it: Molto probabile
pt_br: Extremamente provável
ru: Весьма вероятно

# ++CODE++ce973c12f6c3371202fc82770629424f5dff2aeaf8fda4b6a5e2f91156c13af3
source: Fabric API error occurred ({0}): {1}
es: Se ha producido un error en la API de Fabric ({0}): {1}
it: Si è verificato un errore dell'API di Fabric ({0}): {1}
ru: Произошла ошибка API Fabric ({0}): {1}

# ++CODE++2669635517c6f110f77148287c814fbb91a8ee9fb366d1113794cf21f767d9a9
source: Fabric Account
es: Cuenta de Fabric
it: Account Fabric
ru: Учетная запись Fabric
