Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++f3181e292580fea40c15bf9a85615f13c8133a2f1ac88fc2067181c933b07177
source: You are seeing this message because you updated the MSSQL extension to version {0}.
es: Está viendo este mensaje porque ha actualizado la extensión de MSSQL a la versión {0}.
it: Si riceve questo messaggio perché è stata aggiornata l'estensione MSSQL alla versione {0}.
ru: Вы видите это сообщение, так как обновили расширение MSSQL до версии {0}.

# ++CODE++097471b0cd0d44493ae5b1f66494581a1b7847b2293eb7d71f0dee6cf6c53a54
source: You must accept the license
es: Debe aceptar la licencia
it: È necessario accettare la licenza
ru: Необходимо принять лицензию

# ++CODE++437f6eb2a46a074059cbbd924d82e7b72146b3bbb13c028906a45bbffdf69e3f
source: You must be signed into Azure in order to browse SQL databases.
es: Debe iniciar sesión en Azure para poder explorar las bases de datos SQL.
fr: Vous devez être connecté à Azure pour parcourir des bases de données SQL.
it: Devi aver effettuato l'accesso ad Azure per esplorare i database SQL.
ru: Для просмотра баз данных SQL необходимо войти в Azure.

# ++CODE++bb5b6644dc612a69a27fc4eb9b11f3e54901055b75fe7fb9bb754f28693a574f
source: You must be signed into Fabric in order to browse SQL databases.
es: Debe iniciar sesión en Azure para poder explorar las bases de datos SQL.
it: Per esplorare i database SQL è necessario aver eseguito l'accesso a Fabric.
ru: Для просмотра баз данных SQL необходимо войти в Fabric.

# ++CODE++72f5c8fcf386f50a0af8057b25cbd6d2cbfe99d41c859934b12e7592b60b2690
source: You must review and accept the terms to proceed
es: Debe revisar y aceptar los términos para continuar.
fr: Vous devez lire et accepter les conditions pour continuer
it: Per continuare, è necessario rivedere e accettare le condizioni
pt_br: Você deve revisar e aceitar os termos para prosseguir
ru: Чтобы продолжить, необходимо просмотреть и принять условия

# ++CODE++fd7b1bde88541fa18fcf29098d6ac35bf9b6e18c9e393c1762bc119ff95a47fe
source: Your Docker Engine currently runs Windows containers. SQL Server only supports Linux containers. Would you like to switch to Linux containers?
es: El motor de Docker ejecuta actualmente contenedores de Windows. SQL Server solo admite contenedores de Linux. ¿Desea cambiar a contenedores de Linux?
fr: Votre moteur Docker exécute actuellement des conteneurs Windows. SQL Server prend uniquement en charge les conteneurs Linux. Voulez-vous basculer vers des conteneurs Linux ?
it: Il motore Docker esegue attualmente contenitori Windows. SQL Server supporta solo contenitori Linux. Passare ai contenitori Linux?
ru: В настоящее время подсистема Docker выполняет контейнеры с Windows. SQL Server поддерживает только контейнеры с Linux. Переключиться на контейнеры с Linux?

# ++CODE++4d665ff14f7810a8d97b139336a650d9bf37854683886f2df4679232ec55bae4
source: Your account needs re-authentication to access {0} resources. Press Open to start the authentication process.
es: La cuenta debe volver a autenticarse para acceder a {0} recursos. Presione Abrir para iniciar el proceso de autenticación.
fr: Votre compte doit s’authentifier à nouveau pour accéder aux ressources {0}. Appuyez sur Ouvrir pour démarrer le processus d’authentification.
it: Per accedere alle risorse {0}, è necessario ripetere l'autenticazione dell'account. Premere Apri per avviare il processo di autenticazione.
ja: {0} リソースにアクセスするには、アカウントに再認証が必要です。[開く] を押して認証プロセスを開始します。
pt_br: Sua conta precisa de nova autenticação para acessar os recursos {0}. Pressione Abrir para iniciar o processo de autenticação.
ru: Для доступа к ресурсам {0} вашей учетной записи необходимо заново пройти проверку подлинности. Нажмите кнопку "Открыть", чтобы начать процесс проверки подлинности.

# ++CODE++cae61ae576cc3d82cec2579b9ac71b72196f7ff3f543408342b416c4877cce4e
source: Your client IP Address '{0}' does not have access to the server '{1}' you're attempting to connect to. Would you like to create new firewall rule?
es: La dirección IP del cliente ''{0}'' no tiene acceso al servidor ''{1}'' al que está intentando conectarse. ¿Desea crear una nueva regla de firewall?
fr: L’adresse IP de votre client « {0} » n’a pas accès au serveur « {1} » auquel vous tentez de vous connecter. Voulez-vous créer une règle de pare-feu ?
it: L'indirizzo IP client '{0}' non ha accesso al server '{1}' a cui l'utente sta tentando di connettersi. Creare una nuova regola del firewall?
ja: お使いのクライアント IP アドレス '{0}' では、接続しようとしているサーバー '{1}' にアクセスできません。新しいファイアウォール規則を作成しますか?
pt_br: O endereço IP do seu cliente "{0}" não tem acesso ao servidor "{1}" ao qual você está tentando se conectar. Gostaria de criar uma nova regra de firewall?
ru: У клиентского IP-адреса "{0}" нет доступа к серверу "{1}", к которому вы пытаетесь подключиться. Создать правило брандмауэра?

# ++CODE++a687a5a3cf1800c09d10d73ae6c128de7b617482ef262db645470c6f4ae9d54d
source: Your client IP address does not have access to the server. Add a Microsoft Entra account and create a new firewall rule to enable access.
es: La dirección IP del cliente no tiene acceso al servidor. Agregue una cuenta de Microsoft Entra y cree una nueva regla de firewall para habilitar el acceso.
fr: L’adresse IP de votre client n’a pas accès au serveur. Ajoutez un compte Microsoft Entra et créez une nouvelle règle de pare-feu pour activer l’accès.
it: L'indirizzo IP client non ha accesso al server. Aggiungere un account Microsoft Entra e creare una nuova regola del firewall per abilitare l'accesso.
ja: クライアント IP アドレスにサーバーへのアクセス権がありません。アクセスを有効にするには、Microsoft Entra アカウントを追加し、新しいファイアウォール規則を作成してください。
pt_br: O endereço IP do cliente não tem acesso ao servidor. Adicione uma conta do Microsoft Entra e crie uma nova regra de firewall para permitir o acesso.
ru: У IP-адреса вашего клиента нет доступа к этому серверу. Добавьте учетную запись Microsoft Entra, а затем создайте новое правило брандмауэра, чтобы предоставить доступ.

# ++CODE++e22a8e55997a44b12ff4f976b12df9cf1fd9b41a7521198b72b15a3cb9952ed0
source: Your password must contain characters from at least three of the following categories: uppercase letters, lowercase letters, numbers (0-9), and special characters (!, $, #, %, etc.).
es: Su contraseña debe contener caracteres de al menos tres de las siguientes categorías: letras mayúsculas, letras minúsculas, números (0-9) y caracteres especiales (!, $, #, %, etc.).
fr: Votre mot de passe doit contenir des caractères appartenant au moins à trois des catégories suivantes – lettres majuscules, minuscules, chiffres (0-9) et caractères spéciaux (!, $, #, %, etc.).
it: La password deve contenere caratteri appartenenti ad almeno tre delle categorie seguenti: lettere maiuscole, lettere minuscole, numeri (0-9) e caratteri speciali (!, $, #, % ecc.).
ru: Пароль должен содержать символы по крайней мере из трех следующих категорий: заглавные буквы, строчные буквы, числа (0–9) и специальные символы (!, $, #, % и т. д.).

# ++CODE++5dc504d43e14657bd7f0298bc51688ba1bb0b809a8060f3b9106ca9411db9cd4
source: Your tenant '{0} ({1})' requires you to re-authenticate again to access {2} resources. Press Open to start the authentication process.
es: El inquilino "{0} ({1})" requiere que vuelva a autenticarse para acceder a {2} recursos. Presione Abrir para iniciar el proceso de autenticación.
fr: Votre locataire « {0} ({1}) » exige une nouvelle authentification pour accéder aux ressources {2}. Appuyez sur Ouvrir pour démarrer le processus d’authentification.
it: Il tenant '{0} ({1})' richiede una nuova autenticazione per accedere alle risorse {2}. Premere Apri per avviare il processo di autenticazione.
ja: テナント '{0} ({1})' では、{2}リソースにアクセスするために、もう一度再認証する必要があります。[開く] を押して認証プロセスを開始します。
pt_br: O locatário "{0} ({1})" requer que você se autentique novamente para acessar os recursos de {2}. Pressione Abrir para iniciar o processo de autenticação.
ru: Клиент "{0} ({1})" требует повторной проверки подлинности для доступа к ресурсам {2}. Нажмите кнопку "Открыть", чтобы начать процесс проверки подлинности.

# ++CODE++5a982cf9dc11b4ec88b6151a75c4b45e269a5694c941c3c4c96689bed0c7d312
source: Zoom In
es: Acercar
fr: Zoom avant
it: Zoom avanti
ja: 拡大
pt_br: Ampliar
ru: Увеличить масштаб

# ++CODE++24649ee0c7a92fd868db079f46ef6b58509081e8b0e8b9ed929606f33c62831d
source: Zoom Out
es: Alejar
fr: Zoom arrière
it: Zoom indietro
ja: 縮小
pt_br: Reduzir
ru: Уменьшить масштаб

# ++CODE++dc81206350e3da642fed43285f8b5a1dc00e0d91b4b81b6bffe3181d0e261d2e
source: Zoom to Fit
es: Zoom para ajustar
fr: Zoom pour ajuster
it: Adatta alla finestra
ja: 拡大して合わせる
pt_br: Aplicar zoom para ajustar
ru: Масштабировать по размеру

# ++CODE++aab103babf210fd60bfbe41ecd5ab24d36cb423ec956f0d0215c6161359e01ee
source: [Optional] Database to connect (press Enter to connect to <default> database)
es: [Opcional] Base de datos a la que conectarse (presione Entrar para conectarse a la base de datos <default>).
fr: [Facultatif] Base de données à laquelle se connecter (appuyez sur Entrée pour vous connecter à la base de données <par défaut>)
it: [Facoltativo] Database a cui connettersi (premere INVIO per connettersi al database <default>)
pt_br: [Opcional] Banco de dados ao qual se conectar (pressione Enter para conectar-se ao banco de dados <default>)
ru: [Необязательно] База данных для подключения (нажмите клавишу ВВОД для подключения к базе данных <по умолчанию>)

# ++CODE++48a9c1333b8297748a7cf4f38e479f6d1722302a0ce72f8516d8a749fe49d752
source: [Optional] Enter a display name for this connection profile
es: [Opcional] Especificar un nombre para mostrar de este perfil de conexión
fr: [Facultatif] Entrer un nom d’affichage pour ce profil de connexion
it: [Facoltativo] Immettere un nome visualizzato per questo profilo di connessione
ja: [省略可能] この接続プロファイルの表示名を入力してください。
pt_br: [Opcional] Insira um nome de exibição para este perfil de conexão
ru: [Необязательно] Укажите отображаемое имя для этого профиля подключения

# ++CODE++43daebc3c05a210cb50000c5c10686b90656dcdf1cae4ebd4914b1f0c98f9b03
source: delete the saved connection: {0}?
es: eliminar la conexión guardada: {0}?
fr: supprimer la connexion enregistrée : {0} ?
it: eliminare la connessione salvata: {0}?
pt_br: excluir a conexão salva: {0}?
ru: удалить сохраненное подключение: {0}?

# ++CODE++c6072170d758e5358d717360829bd1f9b1603b355b5f7fe375d1aabdca7a20de
source: encrypt
es: cifrar
fr: chiffrer
it: crittografa
ja: 暗号化
pt_br: criptografar
ru: шифровать

# ++CODE++0895e3ea3d207f413c6e9c0870ef6824c14f2142a3f719d7dabf315b55a20792
source: for more information.
es: para obtener más información.
it: per altre informazioni.
ru: для получения дополнительных сведений.

# ++CODE++20e10f43f47b1e36c004e81cbec22591b794b0154ca893825d723624a57be8ae
source: hostname\instance or <server>.database.windows.net or ADO.NET connection string
es: nombreDeHost\instancia o <servidor>.database.windows.net o cadena de conexión de ADO.NET
fr: hostname\instance or <server>.database.windows.net ou chaîne de connexion ADO.NET
it: nomehost\instanza o <server>.database.windows.net o stringa di connessione ADO.NET
ja: hostname\instance または <server>.database.windows.net または ADO.NET 接続文字列
pt_br: hostname\instance ou <server>.database.windows.net ou cadeia de conexão do ADO.NET
ru: имя_узла\экземпляр, или <сервер>.database.windows.net, или строка подключения ADO.NET

# ++CODE++075b0e112ce5f3585bf21875b678fb678865a30c79d482cd01098957e6497c28
source: intelliSenseUpdated
it: IntelliSense aggiornato

# ++CODE++5f3c4f8580d392e422e7c2f6802674ac27966c98d95c39696e4b2490168e5488
source: items
es: elementos
it: elementi
ru: элементы

# ++CODE++adabe6ca43999091b4cfc23c5eabb9f829e4cef26a5a4d0fd95674a97b948b4f
source: items per page
es: elementos por página
it: Elementi per pagina
ru: Элементов на странице

# ++CODE++053647276061b7d42afcaab6e846a76c03cf9c3c023ec3d982e296bb30dd6094
source: items selected
es: elementos seleccionados
it: elementi selezionati
ru: выбрано элементов

# ++CODE++e6eaea18e885e1078829b56df34896be5ab51439e8f0ba00cb1624b2c572c10e
source: location
es: ubicación
fr: emplacement
it: posizione
pt_br: localização
ru: расположение

# ++CODE++eb69f53f51eaef9887d5c3f3cbd0993b208e962fed51bdd572b0816eb75c1d10
source: macOS Sierra or newer is required to use this feature.
es: Para usar esta función se requiere macOS Sierra o versiones posteriores.
fr: La version macOS Sierra ou ultérieure est obligatoire pour utiliser cette fonctionnalité.
it: Per usare questa funzionalità, è necessario macOS Sierra o versioni successive.
ja: この機能を使用するには、macOS Sierra 以降が必要です。
pt_br: Para usar este recurso é necessário o macOS Sierra ou mais recente.
ru: Для использования этой функции требуется macOS Sierra или более новая версия.

# ++CODE++28391d3bc64ec15cbb090426b04aa6b7649c3cc85f11230bb0105e02d15e3624
source: of
es: de
it: di
ru: из

# ++CODE++35a1031e991d85c2d12e5768b98c031dcc6394f3ccfb766314b8a3d0ab2242db
source: resource group
es: grupo de recursos
fr: groupe de ressources
it: gruppo di risorse
pt_br: grupo de recursos
ru: группа ресурсов

# ++CODE++a8fa7fd60893411a49907b5545ccf9c47ed8073cc38e2ac3b79c4f6156cd7755
source: subscription
es: suscripción
fr: abonnement
it: sottoscrizione
pt_br: assinatura
ru: подписка

# ++CODE++0c98b4c52b0d7946a1b33eda22dea80446afbd3e387a03295bb55f9f0424dc73
source: the documentation
es: la documentación
it: la documentazione
ru: документация

# ++CODE++eb045d78d273107348b0300c01d29b7552d622abbc6faf81b3ec55359aa9950c
source: undefined
it: non definito

# ++CODE++630c74b2de45669259227b267211f2cbc1b0d85d38728a506258a9e8bdf42acc
source: untitled
es: sin título
fr: sans titre
it: senza nome
ja: 無題
pt_br: sem título
ru: без названия

# ++CODE++f39d8207a23b19fa52f06809909505464af2764c6b3ade40db823f0a46b33487
source: updatingIntelliSense
it: Aggiornamento di IntelliSense

# ++CODE++a48f10647cec7ba3f44b4b4623080abee3b5f7ffee7929db6581a2eee9b4f136
source: x of y selected
es: x de y seleccionado
it: x di y selezionati
ru: Выбрано x из y

# ++CODE++068d20844c66d21c588a335a78293216df5e76501471a4f175eb5758c3372fe4
source: {0} (Current Account)
es: {0} (cuenta actual)
fr: {0} (compte actuel)
it: {0} (Account corrente)
ru: {0} (текущая учетная запись)

# ++CODE++fdd1e66955c2307ddc64a5e81697afacea8973b913e99714f2d5579ddecf0c2a
source: {0} (Preview)
es: {0} (Versión preliminar)
it: {0} (anteprima)
ru: {0} (предварительная версия)

# ++CODE++d4781f8681d947d6d8eb589d9a93c7bd093110ab1b826da373b7e1e6b6cf080f
source: {0} (filtered)
es: {0} (con filtro)
fr: {0} (filtré)
it: {0} (filtro applicato)
ja: {0} (フィルター処理済み)
pt_br: {0} (filtrado)
ru: {0} (применен фильтр)

# ++CODE++d26e21ebdede152a58db3c9ae1c87fd29a87b97da434181f5617921d2ba4a284
source: {0} accounts
es: {0} cuentas
fr: {0} comptes
it: {0} account
ru: Учетных записей: {0}

# ++CODE++4f044358b3c661463f0d081556f19d4015b61fa2a493069920dcddeca01a410c
source: {0} change(s)
it: {0} modifiche

# ++CODE++150b51443c0b62043c983238adcc405fe66b3fe237a6a5dc21758c5f47b52f17
source: {0} changed from '{1}' to '{2}'
it: {0} modificato da '{1}' a '{2}'

# ++CODE++8887985831fb848ca521c8d789f91e3040f1528fbc97d1f20b199bf9dcd2d555
source: {0} color swatch ({1})
it: Campioni colore {0} ({1})
ru: Палитра цветов {0} ({1})

# ++CODE++682728640d4b8510d70b847b61ea921db8626fc0e0682e33d1f72e59a9d52315
source: {0} column data
es: Datos de {0} columna
fr: Données de {0} colonnes
it: Dati della colonna {0}
pt_br: {0} dados da coluna
ru: Данные столбцов ({0})

# ++CODE++0362d3ecbb7ec63592961e75fdb3b9cce59a91db85f4b99e2ba5106d1bf167ed
source: {0} deleted successfully.
es: {0} se eliminó correctamente.
fr: La suppression de {0} a correctement réussi.
it: L'eliminazione di {0} è riuscita.
ru: {0}: успешно удалено.

# ++CODE++5c1afaa0e5ec640786450559a23d287ff17a8b5ffd18db119012de352e431731
source: {0} errors
es: {0} errores
fr: {0} erreurs
it: {0} errori
pt_br: {0} erros
ru: Ошибок: {0}

# ++CODE++16885df9a4767fe04d26b997deabc5a36f96f34bf58bbed4b4a87d029f25209b
source: {0} has been closed. Would you like to restore it?
es: {0} se ha cerrado. ¿Desea restaurarla?
fr: {0} a été fermé. Voulez-vous le restaurer ?
it: {0} è stato chiuso. Ripristinarlo?
pt_br: {0} foi fechado. Você gostaria de restaurá-lo?
ru: {0} закрыт. Вы хотите восстановить его?

# ++CODE++dde734013704b68f0d2d57a1385773d7e4bfbae374a67c150f3f06d8abb95f9d
source: {0} invalid Entra accounts have been removed; you may need to run `MS SQL: Clear Microsoft Entra account token cache` and log in again.
es: Se han eliminado {0} cuentas de Microsoft Entra no válidas; puede que necesite ejecutar "MS SQL: borrar la caché de tokens de cuenta de Microsoft Entra" e iniciar sesión de nuevo.
fr: {0} comptes Entra invalides ont été supprimés; vous devrez peut-être exécuter « MS SQL : Effacer le cache de jetons de compte Microsoft Entra » et vous reconnecter.
it: {0} account Entra non validi sono stati rimossi; potrebbe essere necessario eseguire 'MS SQL: Clear Microsoft Entra account token cache' e accedere nuovamente.
ru: Удалено несколько ({0}) недопустимых учетных записей Microsoft Entra; возможно, потребуется запустить команду "MS SQL: Clear Microsoft Entra account token cache" и повторить вход.

# ++CODE++e3620e8a37371c6057d768faed05a7608c6e5ee783372a58b137b047300e8b7a
source: {0} issue
es: {0} incidencia
fr: {0} problème
it: {0} problema
ja: {0} の問題
pt_br: Problema {0}
ru: {0} проблема

# ++CODE++4960928686dec57850ef0fde437021e4bec60d6d0fcc3e196448bb01c88d3920
source: {0} issues
es: {0} problemas
fr: {0} problèmes
it: {0} problemi
ja: {0} 件の問題
pt_br: Problemas {0}
ru: Проблем: {0}

# ++CODE++48f8bded11e525503381f9350e33b4f291585451934e4dfff2baed0e7a8959a3
source: {0} of {1}
es: {0} de {1}
fr: {0} sur {1}
it: {0} di {1}
pt_br: {0} de {1}
ru: {0} из {1}

# ++CODE++51e6bdbb52f5fe3271eb11b24de7b07440a59a88f0df6bfc9b620179db64c925
source: {0} of {1} connection groups selected.
it: {0} gruppi di connessione di {1} selezionati.
ru: Выбрано столько групп подключений: {0} из {1}.

# ++CODE++3ccee9fb40a58a704c946e7e55b257c5b2ed5ad5019d515454aa79160149b56e
source: {0} of {1} connections selected
it: {0} connessioni di {1} selezionate
ru: Выбрано столько подключений: {0} из {1}

# ++CODE++3ef00338ebd8d4ad962c1b804e194944c187eb4890f8ee839bf9586732068bdc
source: {0} of {1} enabled
it: {0} di {1} abilitati
ru: Включено {0} из {1}

# ++CODE++fd20691998de3c939ec5fca7c6823619440671dfbe0927a4cf15a4eb6b792dc7
source: {0} of {1} tenants
es: {0} de {1} inquilinos
it: {0} tenant di {1}
ru: {0} из {1} клиентов

# ++CODE++0a6a65ea9882252d0abde519b647d2bd091f9a3a4ad1ddd0b8f79de88c4173e6
source: {0} password doesn't match the confirmation password
es: La contraseña de {0} no coincide con la contraseña de confirmación.
it: La password {0} del SQL Server non corrisponde alla password di conferma
ru: Пароль {0} не совпадает с подтверждением

# ++CODE++a97848c89e7bbdc7d3064ed718beef4138a0b3e6fba815d496df332bbc3773ed
source: {0} properties
es: Propiedades de {0}
fr: {0} propriétés
it: Proprietà {0}
pt_br: {0} propriedades
ru: Свойства: {0}

# ++CODE++2bd22e3b4b0281a2ffa3bc8bdd3e1f2b49dedcdde97d4cc83fdf598d1208d103
source: {0} rows selected, click to load summary
es: {0} filas seleccionadas, haz clic para cargar el resumen
it: {0} righe selezionate, fai clic per caricare il riepilogo
ru: Выбраны строки ({0}), нажмите, чтобы загрузить сводку

# ++CODE++00e1f9b501086ed75248767b54cc5caa0b62853d91c148fa2da0b388be7a6388
source: {0} selected
es: {0} seleccionados
it: {0} selezionate
ru: Выбрано: {0}

# ++CODE++e92744f747f8adbd4eb748f272e3c3f3542a48f35b35134f2f2adf89758e2310
source: {0} started successfully.
es: {0} se ha iniciado correctamente.
fr: {0} a démarré correctement.
it: {0} avviato correttamente.
ru: {0}: успешно запущено.

# ++CODE++1bc61380dfa94d79a64b67b2a483332c51a6263dcf5379519cd36b691f6469e3
source: {0} stopped successfully.
es: {0} se detuvo correctamente.
fr: {0} s’est arrêté avec succès.
it: {0} è stato interrotto.
ru: {0}: успешно остановлено.

# ++CODE++c4777dc358a4dd9d44e2865392ea9fb6b761d10b718279ab38df4f72f5645fa7
source: {0} warnings
es: {0} advertencias
fr: {0} avertissements
it: {0} avvisi
pt_br: {0} avisos
ru: Предупреждений: {0}

# ++CODE++e29f55f346b08b76ddf9633f8d991e9cc16f8f201f837052b3e59e681ba2dbda
source: {0} {1} issue
es: {0} {1} incidencia
fr: {0} {1} problème
it: {0} {1} problema
ja: {0} {1} の問題
pt_br: Problema {0} {1}
ru: {0} {1} проблема

# ++CODE++b3a182c894c403e6b24bcc5dfc3ba0eeab9b2380519d82944789b5ffa76b1235
source: {0} {1} issues
es: {0} {1} problemas
fr: {0} {1} problèmes
it: {0} {1} problemi
ja: {0} {1} の問題
pt_br: Problemas {0} {1}
ru: {0} {1} проблем

# ++CODE++097beaf7cff8a2792062a02ba2078dcf76e2166c13dd935fbffcd530d655cdf6
source: ✅ Grant Access
es: ✅ Conceder acceso
fr: ✅ Octroyer l’accès
it: ✅ Concedi accesso
ru: ✅ Предоставить доступ

# ++CODE++56034cb01aa84b5c8abe9389abf03d1c9a91ecea712a8711d611abb0ddd1637c
source: ✅ Grant Access (Current)
es: ✅ Conceder acceso (actual)
fr: ✅ Octroyer l’accès (actuel)
it: ✅ Concedi accesso (corrente)
ru: ✅ Предоставить доступ (текущий)

# ++CODE++40609c19f7011fdd42630f286c30982b3d7a2d74640e310c4126b785a384149d
source: ❌ Deny Access
es: ❌ Denegar acceso
fr: ❌ Refuser l’accès
it: ❌ Nega accesso
ru: ❌ Запретить доступ

# ++CODE++4d765d766973242c68c5a2d3b20c7164beb22948ceaf7095ce44f901cc2f4052
source: ❌ Deny Access (Current)
es: ❌ Denegar acceso (actual)
fr: ❌ Refuser l’accès (actuel)
it: ❌ Nega accesso (corrente)
ru: ❌ Запретить доступ (текущий)

# ++CODE++786e414ca02e9f29012f60d724020a6925dc54275709eb8ac3b2aacbb7262945
source: 👋 I'm GitHub Copilot for MSSQL extension, your intelligent SQL development assistant in Visual Studio Code. I help you connect, explore, design, and evolve your SQL databases directly from VS Code.
es: 👋 Soy GitHub Copilot para la extensión MSSQL, su asistente inteligente de desarrollo de SQL en Visual Studio Code. Le ayudo a conectar, explorar, diseñar y evolucionar sus bases de datos de SQL directamente desde VS Code.
it: 👋 Sono GitHub Copilot per l'estensione MSSQL, il tuo assistente intelligente per lo sviluppo SQL in Visual Studio Code. Ti aiuto a connetterti, esplorare, progettare ed evolvere i database SQL direttamente da VS Code.
ru: 👋 Я — расширение GitHub Copilot для MSSQL, ваш интеллектуальный помощник по разработке SQL в Visual Studio Code. Я помогаю подключаться, исследовать, проектировать и развивать базы данных SQL прямо из VS Code.

# mssql.addObjectExplorer
source: Add Connection
es: Agregar conexión
fr: Ajouter une connexion
it: Aggiungi connessione
ja: 接続の追加
pt_br: Adicionar Conexão
ru: Добавить подключение

# mssql.connectionGroups.create
source: Add Connection Group
es: Agregar grupo de conexiones
fr: Ajouter un groupe de connexion
it: Aggiungi gruppo di connessione
ru: Добавить группу подключений

# mssql.addAadAccount
source: Add Microsoft Entra Account
es: Agregar cuenta de Microsoft Entra
fr: Ajouter un compte Microsoft Entra
it: Aggiungi account Microsoft Entra
ja: Microsoft Entra アカウントの追加
pt_br: Adicionar Conta do Microsoft Entra
ru: Добавить учетную запись Microsoft Entra

# mssql.deviceCode.description
source: Allows users to sign in to input-constrained devices.
es: Permite a los usuarios iniciar sesión en dispositivos con restricciones de entrada.
fr: Permet aux utilisateurs de se connecter à des appareils soumis à des contraintes d’entrée.
it: Consente agli utenti di accedere ai dispositivi con vincoli di input.
ja: ユーザーが入力制約付きのデバイスにサインインできるようになります。
pt_br: Permite que os usuários entrem em dispositivos com restrição de entrada.
ru: Позволяет пользователям входить на устройства с ограничением ввода.
