Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# mssql.copyIncludeHeaders
source: [Optional] Configuration options for copying results from the Results View
es: [Opcional] Opciones de configuración para copiar los resultados de la vista de resultados.
fr: [Facultatif] Options de configuration pour copier les résultats à partir de la vue Résultats
it: [Facoltativo] Opzioni di configurazione per copiare i risultati dalla Visualizzazione risultati
ja: [省略可能] 結果を結果ビューからコピーするための構成オプション
pt_br: [Opcional] Opções de configuração para copiar os resultados da Visualização dos Resultados
ru: [Необязательно] Параметры конфигурации для копирования результатов из представления результатов

# mssql.splitPaneSelection
source: [Optional] Configuration options for which column new result panes should open in
es: [Opcional] Opciones de configuración en las que deben abrirse los paneles de resultados nuevos de columna
fr: [Facultatif] Options de configuration pour définir la colonne dans laquelle les nouveaux volets de résultats doivent s’ouvrir
it: [Facoltativo] Opzioni di configurazione per determinare la colonna in cui aprire i nuovi riquadri dei risultati
ja: [省略可能] どの列を新しい結果ウィンドウで開く必要があるかについての設定オプション
pt_br: [Opcional] Opções de configuração para as quais a coluna Novos painéis de resultados deve ser aberta
ru: [Необязательно] Параметры конфигурации, определяющие, для какого столбца должны открываться новые области результатов

# mssql.connection.applicationIntent
source: [Optional] Declares the application workload type when connecting to SQL Server such as ReadWrite or ReadOnly. Refer to SQL Server AlwaysOn for more detail.
es: [Opcional] Declara el tipo de carga de trabajo de la aplicación al conectarse a SQL Server, como ReadWrite o ReadOnly. Para obtener más detalles, consulte SQL Server AlwaysOn.
fr: [Facultatif] Déclare le type de charge de travail d’application pour la connexion à SQL Server, par exemple, ReadWrite ou ReadOnly. Consultez SQL Server Always On pour plus de détails.
it: [Facoltativo] Dichiara il tipo di carico di lavoro dell'applicazione quando ci si connette a SQL Server, come ReadWrite o ReadOnly. Per maggiori dettagli, fare riferimento a SQL Server AlwaysOn.
ja: [省略可能] ReadWrite や ReadOnly のように、SQL Server へ接続する際のアプリケーション ワークロードの型を宣言します。詳細については、SQL Server AlwaysOn を参照してください。
pt_br: [Opcional] Declara o tipo de carga de trabalho do aplicativo ao se conectar ao SQL Server como ReadWrite ou ReadOnly. Consulte o SQL Server Always On para mais detalhes.
ru: [Необязательно] Объявляет тип рабочей нагрузки приложения при подключении к серверу SQL Server, например ReadWrite или ReadOnly. Подробнее см. в SQL Server AlwaysOn.

# mssql.saveAsCsv.delimiter
source: [Optional] Delimiter for separating data items when saving results as CSV. Choose from common separators like comma (,), tab (\t), semicolon (;), or pipe (|)
es: [Opcional] Delimitador para separar los elementos de datos al guardar los resultados como CSV. Elija entre separadores comunes, como coma (,), tabulación (\t), punto y coma (;) o barra vertical (|)
fr: [Facultatif] Délimiteur pour séparer les éléments de données pendant l’enregistrement des résultats au format CSV. Choisissez parmi les séparateurs courants tels que la virgule (,), la tabulation ( ), le point-virgule (;) ou le pipe (|)
it: [Facoltativo] Delimitatore per separare gli elementi di dati quando si salvano i risultati come CSV. Scegli tra separatori comuni come virgola (,), tabulazione (\t), punto e virgola (;) o pipe (|)
ru: [Необязательно] Разделитель элементов данных при сохранении результатов в формате CSV. Выберите один из распространенных разделителей. Например, можно использовать запятую (,), табуляцию (\t), точку с запятой (;) или вертикальную черту (|)

# mssql.ignorePlatformWarning
source: [Optional] Do not show unsupported platform warnings
es: [Opcional] No mostrar advertencias de plataformas no compatibles
fr: [Facultatif] Ne pas afficher les avertissements de plateforme non prise en charge
it: [Facoltativa] Non visualizzare avvisi su piattaforme non supportate
ja: [省略可能] サポートされていないプラットフォームの警告を表示しない
pt_br: [Opcional] Não mostrar os avisos de plataforma sem suporte
ru: [Необязательно] Не показывать предупреждения для неподдерживаемых платформ

# mssql.saveAsCsv.encoding
source: [Optional] File encoding used when saving results as CSV. Choose from UTF-8 (recommended), UTF-16, ASCII, or Latin-1 based on your target application compatibility
es: [Opcional] Codificación de archivo que se usa al guardar los resultados como CSV. Elija entre UTF-8 (recomendado), UTF-16, ASCII o Latin-1 en función de la compatibilidad de la aplicación de destino
fr: [Facultatif] Encodage de fichier utilisé pendant l’enregistrement des résultats au format CSV. Choisissez entre UTF-8 (recommandé), UTF-16, ASCII ou Latin-1 en fonction de la compatibilité de votre application cible
it: [Facoltativo] Codifica di file usata per il salvataggio dei risultati come CSV. Scegli tra UTF-8 (consigliato), UTF-16, ASCII o Latin-1 in base alla compatibilità dell'applicazione di destinazione
ru: [Необязательно] Кодировка файла, используемая при сохранении результатов в формате CSV. Можно выбрать UTF-8 (рекомендуется), UTF-16, ASCII или Latin-1 в зависимости от совместимости целевого приложения

# mssql.connection.currentLanguage
source: [Optional] Indicates the SQL Server language settings.
es: [Opcional] Indica la configuración de idioma de SQL Server.
fr: [Facultatif] Indique les paramètres de langage SQL Server.
it: [Facoltativo] Indica le impostazioni della lingua di SQL Server.
ja: [省略可能] SQL Server の言語設定を示します。
pt_br: [Opcional] Indica as configurações de linguagem do SQL Server.
ru: [Необязательно] Указывает параметры языка сервера SQL Server.

# mssql.connection.containerName
source: [Optional] Indicates the name of local docker container the connection is on
es: [Opcional] Indica el nombre del contenedor Docker local en el que se encuentra la conexión
fr: [Optionnel] Indique le nom du conteneur Docker local sur lequel la connexion est activée
it: [Facoltativo] Indica il nome del contenitore Docker locale in cui si trova la connessione
ru: [Необязательно] Указывает имя локального контейнера Docker, для которого установлено подключение

# mssql.connection.emptyPasswordInput
source: [Optional] Indicates whether this profile has an empty password explicitly set
es: [Opcional] Indica si este perfil tiene una contraseña vacía establecida explícitamente.
fr: [Facultatif] Indique si ce profil a un mot de passe vide défini explicitement
it: [Facoltativo] Indica se per questo profilo è disponibile una password vuota impostata in modo esplicito
ja: [省略可能] このプロファイルが、明示的に設定された空のパスワードを持つかどうかを示します
pt_br: [Opcional] Indica se este perfil tem uma senha vazia definida explicitamente
ru: [Необязательно] Указывает, задан ли явным образом пустой пароль для этого профиля

# mssql.connection.typeSystemVersion
source: [Optional] Indicates which server type the provider will expose through the DataReader.
es: [Opcional] Indica qué tipo de servidor expondrá el proveedor a través de DataReader.
fr: [Facultatif] Indique le type de serveur que le fournisseur expose par le biais de DataReader.
it: [Facoltativo] Indica il tipo di server che verrà esposto dal provider tramite l'oggetto DataReader.
ja: [省略可能] DataReader を通してプロバイダーが公開するサーバー タイプを示します。
pt_br: [Opcional] Indica qual tipo de servidor será exposto pelo provedor pelo DataReader.
ru: [Необязательно] Указывает, к какому типу сервера поставщик предоставит доступ через DataReader.

# mssql.logDebugInfo
source: [Optional] Log debug output to the VS Code console (Help -> Toggle Developer Tools)
es: [Opcional] Registre la salida de depuración en la consola de VS Code (Ayuda -> Alternar herramientas de desarrollo).
fr: [Facultatif] Journaliser la sortie de débogage dans la console VS Code (Aide -> Activer/désactiver les outils de développement)
it: [Facoltativo] Registra l'output di debug nella console di VS Code (Guida -> Attiva/Disattiva Strumenti di sviluppo)
ja: [省略可能] デバッグ出力を VS Code コンソールにログとして表示する (ヘルプ -> 開発者ツールの切り替え)
pt_br: [Opcional] Registre a saída de depuração no console do VS Code (Ajuda -> Ativar/Desativar Ferramentas para Desenvolvedores)
ru: [Необязательно] Выводить выходные данные отладки в консоль VS Code (Справка -> Переключить средства разработчика)

# mssql.tracingLevel
source: [Optional] Log level for backend services. Azure Data Studio generates a file name every time it starts and if the file already exists the logs entries are appended to that file. For cleanup of old log files see logRetentionMinutes and logFilesRemovalLimit settings. The default tracingLevel does not log much. Changing verbosity could lead to extensive logging and disk space requirements for the logs. Error includes Critical, Warning includes Error, Information includes Warning and Verbose includes Information
es: [Opcional] El nivel de registro para servicios back-end. Azure Data Studio genera un nombre de archivo cada vez que se inicia y, si el archivo ya existe, las entradas de registros se anexan a ese archivo. Para la limpieza de archivos de registro antiguos, consulte la configuración de logRetentionMinutes y logFilesRemovalLimit. El valor predeterminado tracingLevel no registra mucho. El cambio de detalle podría dar lugar a amplios requisitos de registro y espacio en disco para los registros. Error incluye Crítico, Advertencia incluye Error, Información incluye Advertencia y Detallado incluye Información.
fr: [Facultatif] Niveau de journalisation des services de back-end. Azure Data Studio génère un nom de fichier à chaque démarrage et, si le fichier existe déjà, ajoute les entrées de journal à ce fichier. Pour nettoyer les anciens fichiers journaux, consultez les paramètres logRetentionMinutes et logFilesRemovalLimit. Le niveau de suivi par défaut correspond à une faible journalisation. Si vous changez le niveau de détail, vous pouvez obtenir une journalisation massive nécessitant de l’espace disque pour les journaux. Le niveau Erreur inclut le niveau Critique, le niveau Avertissement inclut le niveau Erreur, le niveau Informations inclut le niveau Avertissement et le niveau Détail inclut le niveau Informations
it: [Facoltativa] Livello di registrazione per i servizi back-end. Azure Data Studio genera un nome file a ogni avvio e, se il file esiste già, le voci del log vengono accodate a tale file. Per la pulizia dei file di log meno recenti, vedere le impostazioni logRetentionMinutes e logFilesRemovalLimit. Con l'impostazione predefinita di tracingLevel, la quantità di dati registrata non è eccessiva. Se si cambia il livello di dettaglio, la registrazione potrebbe diventare eccessiva e richiedere un notevole spazio su disco per i log. Il livello Error include quello Critical, il livello Warning include quello Error, il livello Information include quello Warning e il livello Verbose include quello Information
ja: [省略可能] バックエンド サービスのログ レベル。Azure Data Studio は開始のたびにファイル名を生成し、そのファイルが既に存在する場合にはログ エントリが対象ファイルに追加されます。古いログ ファイルのクリーンアップについては、logRetentionMinutes と logFilesRemovalLimit の設定を参照してください。既定の tracingLevel では、ログに記録される数は多くありません。詳細レベルを変更すると、詳細なログが記録され、ログのためのディスク容量が必要になる場合があります。エラーには重大が含まれ、警告にはエラーが含まれ、情報には警告が含まれ、詳細には情報が含まれます
pt_br: [Opcional] Nível de log para serviços de back-end. O Azure Data Studio gera um nome de arquivo sempre que é iniciado e, quando o arquivo já existe, as entradas de logs são acrescentadas a esse arquivo. Para a limpeza de arquivos de log antigos, confira as configurações logRetentionMinutes e logFilesRemovalLimit. O tracingLevel padrão não registra uma grande quantidade de log. A alteração de detalhamento pode levar ao aumento dos requisitos de registro em log e de espaço em disco para os logs. Erro inclui Crítico, Aviso inclui Erro, informações inclui Aviso e Detalhado inclui Informações
ru: [Необязательно] Уровень ведения журнала для серверных служб. Azure Data Studio создает имя файла при каждом запуске, а если такой файл уже существует, записи журналов добавляются в него. Для очистки старых файлов журналов см. описание параметров logRetentionMinutes и logFilesRemovalLimit. По умолчанию параметр tracingLevel заносит в журнал не слишком много информации. Изменение детализации может привести к тому, что журналы будут занимать слишком много места. Ошибка включает критический уровень, предупреждение включает ошибку, информационный уровень включает предупреждение, а подробный уровень включает информационный уровень.

# mssql.showBatchTime
source: [Optional] Should execution time be shown for individual batches
es: [Opcional] Indica si debe mostrarse el tiempo de ejecución para los lotes individuales.
fr: [Facultatif] Spécifie si la durée d’exécution doit être affichée pour les lots individuels
it: [Facoltativo] Consente di indicare se visualizzare il tempo di esecuzione per singoli batch
ja: [省略可能] 各バッチの実行時間を表示するかどうか
pt_br: [Opcional] O tempo de execução deve ser mostrado para lotes individuais?
ru: [Необязательно] Нужно ли показывать время выполнения для отдельных пакетов

# mssql.connection.profileName
source: [Optional] Specify a custom name for this connection profile to easily browse and search in the command palette of Visual Studio Code.
es: [Opcional] Especifique un nombre personalizado para este perfil de conexión a fin de navegar y buscar fácilmente en la paleta de comandos de Visual Studio Code.
fr: [Facultatif] Spécifiez un nom personnalisé pour ce profil de connexion afin de parcourir facilement la palette de commandes de Visual Studio Code et y faire des recherches.
it: [Facoltativo] Consente di specificare un nome personalizzato di questo profilo di connessione per facilitare l'esplorazione e la ricerca nel riquadro comandi di Visual Studio Code.
ja: [省略可能] Visual Studio Code のコマンドパレットで簡単に参照して探すことができるように、この接続プロファイルにカスタムの名前を指定します。
pt_br: [Opcional] Especifique um nome personalizado para este perfil de conexão para facilmente navegar e pesquisar na paleta de comandos do Visual Studio Code.
ru: [Необязательно] Укажите пользовательское имя для этого профиля подключения для простой навигации и поиска в палитре команд Visual Studio Code.

# mssql.connection.authenticationType
source: [Optional] Specify the SQL Server authentication type.
es: [Opcional] Especifique el tipo de autenticación de SQL Server.
fr: [Facultatif] Spécifiez le type d’authentification SQL Server.
it: [Facoltativo] Consente di specificare il tipo di autenticazione di SQL Server.
ja: [省略可能] SQL Server 認証の種類を指定します。
pt_br: [Opcional] Especifique o tipo de autenticação do SQL Server.
ru: [Необязательно] Укажите тип проверки подлинности для сервера SQL Server.

# mssql.connection.database
source: [Optional] Specify the database name to connect to. If database is not specified, the default user database setting is used, typically 'master'.
es: [Opcional] Especifique el nombre de la base de datos con la que se va a conectar. Si no se especifica la base de datos, se usa la configuración de base de datos de usuario predeterminada, que suele ser "maestra".
fr: [Facultatif] Spécifiez le nom de base de données à laquelle se connecter. Si la base de données n’est pas spécifiée, le paramètre de la base de données utilisateur par défaut est utilisé, généralement « master ».
it: [Facoltativo] Consente di specificare il nome del database a cui connettersi. Se il database non è specificato, verrà usata l'impostazione predefinita del database utente, in genere 'master'.
ja: [省略可能] 接続するデータベース名を指定します。データベースを指定しない場合、ユーザー データベースの既定の設定 (通常は 'master’) が使用されます。
pt_br: [Opcional] Especifique o nome do banco de dados ao qual se conectar. Se o banco de dados não for especificado, a configuração do banco de dados de usuário padrão será usada; normalmente o banco de dados "mestre".
ru: [Необязательно] Укажите имя базы данных, к которой необходимо подключиться. Если база данных не указана, будет использована база данных пользователя по умолчанию, обычно "master".

# mssql.connection.connectRetryInterval
source: [Optional] Specify the delay between attempts to restore connection.
es: [Opcional] Especifique el retraso entre intentos para restaurar la conexión.
fr: [Facultatif] Spécifiez le délai entre les tentatives de restauration de la connexion.
it: [Facoltativo] Consente di specificare il ritardo tra i tentativi di ripristino della connessione.
ja: [省略可能] 接続の復元を再試行する間隔を指定します。
pt_br: [Opcional] Especifique o atraso entre as tentativas de restabelecer a conexão.
ru: [Необязательно] Укажите задержку между попытками восстановления подключения.

# mssql.connection.commandTimeout
source: [Optional] Specify the length of time in seconds to wait for a command to execute before terminating the attempt and generating an error. The default value is 30 seconds.
es: [Opcional] Especifique el tiempo en segundos que se esperará a que se ejecute un comando antes de finalizar el intento y generar un error. El valor predeterminado es 30 segundos.
fr: [Facultatif] Spécifiez la durée en secondes d’attente de l’exécution d’une commande avant de mettre fin à la tentative et de générer une erreur. La valeur par défaut est de 30 secondes.
it: [Facoltativo] Specificare il tempo di attesa in secondi per l'esecuzione di un comando prima di terminare il tentativo e generare un errore. Il valore predefinito è 30 secondi.
ja: [省略可能] 試行を終了してエラーを生成する前にコマンドの実行を待機するまでの時間を秒単位で指定します。既定値は 30 秒です。
pt_br: [Opcional] Especifique o período de tempo em segundos para aguardar a execução de um comando antes de encerrar a tentativa e gerar um erro. O valor padrão é 30 segundos.
ru: [Необязательно] Укажите длительность (в секундах) ожидания выполнения команды, после чего попытка прекращается и выводится ошибка. Значение по умолчанию — 30 секунд.

# mssql.connection.connectTimeout
source: [Optional] Specify the length of time in seconds to wait for a connection to the server before terminating connection attempt and generating an error. The default value is 30 seconds.
es: [Opcional] Especifique el tiempo en segundos que se debe esperar para establecer una conexión con el servidor antes de finalizar el intento de conexión y generar un error. El valor predeterminado es 30 segundos.
fr: [Facultatif] Spécifiez la durée en secondes d’attente d’une connexion au serveur avant de mettre fin à la tentative de connexion et de générer une erreur. La valeur par défaut est de 30 secondes.
it: [Facoltativo] Specifica la durata in secondi dell'attesa di una connessione al server prima di terminare il tentativo di connessione e generare un errore. Il valore predefinito è 30 secondi.
pt_br: [Opcional] Especifique o período de tempo em segundos para aguardar uma conexão com o servidor antes de encerrar a tentativa de conexão e gerar um erro. O valor padrão é 30 segundos.
ru: [Необязательно] Укажите, сколько времени следует ждать подключения к серверу (в секундах), прежде чем попытки подключения прекратятся и будет выдана ошибка. Значение по умолчанию — 30 секунд.

# mssql.connection.maxPoolSize
source: [Optional] Specify the maximum number of connections allowed in the pool.
es: [Opcional] Especifique el número máximo de conexiones permitidas en el grupo.
fr: [Facultatif] Spécifiez le nombre maximal de connexions autorisées dans le pool.
it: [Facoltativo] Consente di specificare il numero massimo di connessioni consentite nel pool.
ja: [省略可能] プールで許可される最大接続数を指定します。
pt_br: [Opcional] Especifique o número máximo de conexões permitidas no pool.
ru: [Необязательно] Укажите максимальное количество подключений в пуле.

# mssql.connection.loadBalanceTimeout
source: [Optional] Specify the minimum amount of time in seconds for this connection to live in the pool before being removed/deleted.
es: [Opcional] Especifique la cantidad mínima de tiempo, en segundos, que esta conexión residirá en el grupo antes de quitarla o eliminarla.
fr: [Facultatif] Spécifiez la durée de vie minimale en secondes de cette connexion dans le pool avant suppression.
it: [Facoltativo] Consente di specificare la quantità minima di tempo in secondi in cui la connessione deve rimanere attiva nel pool prima che venga rimossa o eliminata.
ja: [省略可能] この接続を削除する前に、この接続がプールに存続する最小時間を秒単位で指定します。
pt_br: [Opcional] Especifique o tempo mínimo em segundos para a conexão ficar ativa no pool antes de ser removida/excluída.
ru: [Необязательно] Укажите минимальное количество времени в секундах, в течении которого это подключение будет находиться в пуле, прежде чем оно будет удалено.

# mssql.connection.minPoolSize
source: [Optional] Specify the minimum number of connections allowed in the pool.
es: [Opcional] Especifique el número mínimo de conexiones permitidas en el grupo.
fr: [Facultatif] Spécifiez le nombre minimal de connexions autorisées dans le pool.
it: [Facoltativo] Consente di specificare il numero minimo di connessioni consentite nel pool.
ja: [省略可能] プールで許可される最小接続数を指定します。
pt_br: [Opcional] Especifique o número mínimo de conexões permitidas no pool.
ru: [Необязательно] Укажите минимальное количество подключений, разрешенных в пуле.

# mssql.connection.applicationName
source: [Optional] Specify the name of the application used for SQL Server to log (default: 'vscode-mssql').
es: [Opcional] Especifique el nombre de la aplicación que se usa para el registro de SQL Server (valor predeterminado: "vscode-mssql").
fr: [Facultatif] Spécifiez le nom de l’application utilisée par SQL Server pour la journalisation (par défaut : « vscode-mssql »).
it: [Facoltativo] Consente di specificare il nome dell'applicazione usata da SQL Server da registrare (impostazione predefinita: 'vscode-mssql').
ja: [省略可能] SQL Server でログに記録されるアプリケーションの名前を指定します (既定値: 'vscode-mssql')。
pt_br: [Opcional] Especifique o nome do aplicativo usado pelo SQL Server para log (padrão: "vscode-mssql").
ru: [Необязательно] Укажите имя приложения, используемого для ведения журнала сервера SQL Server (значение по умолчанию: "vscode-mssql").

# mssql.connection.attachDbFilename
source: [Optional] Specify the name of the primary file, including the full path name, of an attachable database.
es: [Opcional] Especifique el nombre del archivo principal, incluido el nombre completo de la ruta de acceso, de una base de datos que se puede asociar.
fr: [Facultatif] Spécifiez le nom du fichier principal, y compris le nom du chemin complet, d’une base de données pouvant être attachée.
it: [Facoltativo] Consente di specificare il nome del file primario, incluso il nome di percorso completo, di un database collegabile.
ja: [省略可能] 完全なパス名を含む、接続可能なデータベースのプライマリ ファイル名を指定します。
pt_br: [Opcional] Especifique o nome do arquivo primário, incluindo o nome do caminho completo, de um banco de dados anexável.
ru: [Необязательно] Укажите полный путь к первичному файлу присоединяемой базы данных.

# mssql.connection.workstationId
source: [Optional] Specify the name of the workstation connecting to SQL Server.
es: [Opcional] Especifique el nombre de la estación de trabajo que se conecta a SQL Server.
fr: [Facultatif] Spécifiez le nom de la station de travail se connectant à SQL Server.
it: [Facoltativo] Consente di specificare il nome della workstation che si connette a SQL Server.
ja: [省略可能] SQL Server に接続するワークステーションの名前を指定します。
pt_br: [Opcional] Especifique o nome da estação de trabalho que está se conectando ao SQL Server.
ru: [Необязательно] Укажите имя рабочей станции, подключающейся к серверу SQL Server.
