Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# mssql.query.statisticsTime
source: Enable SET STATISTICS TIME option
es: Habilitar la opción SET STATISTICS TIME
fr: Activer l’option SET STATISTICS TIME
it: Abilita l'opzione SET STATISTICS TIME
ja: SET STATISTICS TIME オプションを有効にする
pt_br: Habilitar a opção SET STATISTICS TIME
ru: Установить параметр SET STATISTICS TIME

# mssql.query.transactionIsolationLevel
source: Enable SET TRANSACTION ISOLATION LEVEL option
es: Habilitar la opción SET TRANSACTION ISOLATION LEVEL
fr: Activer l’option SET TRANSACTION ISOLATION LEVEL
it: Abilita l'opzione SET TRANSACTION ISOLATION LEVEL
ja: SET TRANSACTION ISOLATION LEVEL オプションを有効にする
pt_br: Habilitar a opção SET TRANSACTION ISOLATION LEVEL
ru: Установить параметр SET TRANSACTION ISOLATION LEVEL

# mssql.query.xactAbortOn
source: Enable SET XACT_ABORT ON option
es: Habilitar la opción SET XACT_ABORT ON
fr: Activer l’option SET XACT_ABORT ON
it: Abilita l'opzione SET XACT_ABORT ON
ja: SET XACT_ABORT ON オプションを有効にする
pt_br: Habilitar a opção SET XACT_ABORT ON
ru: Установить параметр SET XACT_ABORT ON

# mssql.schemaDesigner.enableExpandCollapseButtons
source: Enable expand/collapse buttons in Schema Designer table nodes when tables have more than 10 columns
es: Habilitar botones de expandir o contraer en los nodos de la tabla del Diseñador de esquemas cuando las tablas tengan más de 10 columnas
fr: Activez les boutons d'expansion/réduction dans les nœuds de table du Schéma Designer lorsque les tables comportent plus de 10 colonnes
it: Abilitare i pulsanti espandi/comprimi nei nodi della tabella di Finestra di progettazione schema quando le tabelle contengono più di 10 colonne
ru: Включить кнопки развертывания и свертывания в узлах таблиц конструктора схем, если таблицы содержат более 10 столбцов

# mssql.walkthroughs.getStarted.enableModernFeatures.altText
source: Enable modern features in MSSQL
es: Habilitación de características modernas en MSSQL
fr: Activer les fonctionnalités modernes dans MSSQL
it: Abilita funzionalità moderne in MSSQL
pt_br: Habilitar recursos modernos no MSSQL
ru: Включить современные функции в MSSQL

# mssql.walkthroughs.getStarted.enableModernFeatures.description
source: Enable the new set of data development features that provide a modern way to work with your SQL database in VS Code. [Enable New Experiences](command:mssql.enableRichExperiences)
es: Habilite el nuevo conjunto de características de desarrollo de datos que proporcionan una forma moderna de trabajar con su base de datos SQL en VS Code. [Habilitar nuevas experiencias](command:mssql.enableRichExperiences)
fr: Activez le nouvel ensemble de fonctionnalités de développement de données qui proposent un moyen moderne pour travailler avec votre base de données SQL dans VS Code. [Activer les nouvelles expériences](command:mssql.enableRichExperiences)
it: Abilita il nuovo set di funzionalità di sviluppo dati che offre un modo moderno per lavorare con il database SQL in VS Code. [Abilita nuove esperienze](command:mssql.enableRichExperiences)
pt_br: Habilite o novo conjunto de recursos de desenvolvimento de dados que fornecem uma maneira moderna de trabalhar com seu banco de dados SQL no VS Code. [Habilitar Novas Experiências](command:mssql.enableRichExperiences)
ru: Включите новый набор функций разработки данных, предоставляющих современный способ работы с базой данных SQL в VS Code. [Включить новые возможности](command:mssql.enableRichExperiences)

# mssql.objectExplorer.Tooltip.enabledLabel
source: Enabled
es: Habilitado
it: Abilitato
ru: Включено

# mssql.enableRichExperiences.description
source: Enables UI-based features in the MSSQL extension for richer and more powerful features. Restart Visual Studio Code after changing this setting.
es: Habilita las características basadas en la interfaz de usuario de la extensión MSSQL para obtener características más completas y eficaces. Reinicie Visual Studio Code después de cambiar esta configuración.
fr: Permet d’activer les fonctionnalités basées sur l’interface utilisateur dans l’extension MSSQL pour des fonctionnalités enrichies et plus puissantes. Redémarrez Visual Studio Code après avoir modifié ce paramètre.
it: Abilita le funzionalità basate sull'interfaccia utente nell'estensione MSSQL per offrire funzionalità più avanzate e potenti. Riavviare Visual Studio Code dopo aver modificato questa impostazione.
pt_br: Habilita recursos baseados em interface do usuário na extensão MSSQL para recursos mais avançados e poderosos. Reinicie o Visual Studio Code após alterar essa configuração.
ru: Включает функции на основе пользовательского интерфейса в расширении MSSQL для более полнофункциональных и мощных функций. Перезапустите Visual Studio Code после изменения этого параметра.

# mssql.enableConnectionPooling
source: Enables connection pooling to improve overall connectivity performance. This setting is disabled by default. Visual Studio Code is required to be relaunched when the value is changed. To clear pooled connections, run the command: 'MS SQL: Clear Pooled Connections'. Note: May keep serverless databases active and prevent auto-pausing.
es: Habilita la agrupación de conexiones para mejorar el rendimiento general de la conectividad. Esta configuración está deshabilitada de forma predeterminada. Visual Studio Code es necesario volver a iniciar cuando se cambia el valor. Para borrar las conexiones agrupadas, ejecute el comando: "MS SQL: Borrar conexiones agrupadas". Nota: Puede mantener activas las bases de datos sin servidor y evitar la pausa automática.
fr: Permet le groupement des connexions pour améliorer le niveau de performance global de connectivité. Ce paramètre est désactivé par défaut. Visual Studio Code doit être relancé lorsque la valeur est modifiée. Pour effacer les connexions groupées, exécutez la commande : « MS SQL : effacer les connexions groupées ». Remarque : cela peut maintenir les bases de données serverless actives et empêcher la mise en pause automatique.
it: Consente il pool di connessioni per migliorare le prestazioni complessive della connettività. Questa opzione è disabilitata per impostazione predefinita. Visual Studio Code deve essere riavviato quando il valore viene modificato. Per cancellare le connessioni in pool, eseguire il comando: 'MS SQL: Cancella connessioni in pool'. Nota: potrebbe mantenere attivi i database serverless e impedire la sospensione automatica.
ru: Включение объединения подключений в пулы для повышения общей производительности сетевых подключений. Этот параметр по умолчанию отключен. При изменении этого значения необходимо перезапустить Visual Studio Code. Чтобы очистить подключения, объединенные в пулы, выполните команду "MS SQL: Clear Pooled Connections". Примечание. Может поддерживать бессерверные базы данных в активном состоянии и предотвращать автоматическую приостановку.

# mssql.enableExperimentalFeatures.description
source: Enables experimental features in the MSSQL extension. The features are not production-ready and may have bugs or issues. Restart Visual Studio Code after changing this setting.
es: Habilita características experimentales en la extensión MSSQL. Las características no están listas para producción y pueden tener errores o problemas. Reinicie Visual Studio Code después de cambiar esta configuración.
fr: Active les fonctionnalités expérimentales dans l’extension MSSQL. Les fonctionnalités ne sont pas prêtes pour la production et peuvent présenter des bogues ou des problèmes. Veuillez redémarrer Visual Studio Code après avoir modifié ce paramètre.
it: Abilita le funzionalità sperimentali nell'estensione MSSQL. Le funzionalità non sono pronte per la produzione e potrebbero presentare bug o problemi. Riavvia Visual Studio Code dopo aver modificato questa impostazione.
ja: MSSQL 拡張機能の試験的な機能を有効にします。機能は運用環境に対応していないため、バグや問題が発生する可能性があります。この設定を変更した後、Visual Studio Code を再起動します。
pt_br: Habilita recursos experimentais na extensão do MSSQL. Os recursos não estão prontos para produção e podem ter bugs ou problemas. Reinicie o Visual Studio Code após alterar essa configuração.
ru: Включает экспериментальные функции в расширении MSSQL. Компоненты не готовы к работе и могут содержать дефекты или проблемы. Перезапустите Visual Studio Code после изменения этого параметра.

# mssql.enableSqlAuthenticationProvider
source: Enables use of the Sql Authentication Provider for 'Microsoft Entra Id Interactive' authentication mode when user selects 'AzureMFA' authentication. This enables Server-side resource endpoint integration when fetching access tokens. This option is only supported for 'MSAL' Authentication Library. Please restart Visual Studio Code after changing this option.
es: Habilita el uso del proveedor de autenticación de SQL para el modo de autenticación "Microsoft Entra Id Interactive" cuando el usuario selecciona la autenticación "AzureMFA". Esto habilita la integración del punto de conexión de recursos del lado servidor al capturar tokens de acceso. Esta opción solo se admite para la biblioteca de autenticación "MSAL". Reinicie Visual Studio Code después de cambiar esta opción.
fr: Permet l’utilisation du fournisseur d’authentification SQL pour le mode d’authentification « Microsoft Entra Id Interactive » lorsque l’utilisateur sélectionne l’authentification « AzureMFA ». Cela permet l’intégration des points de terminaison de ressources côté serveur lors de la récupération des jetons d’accès. Cette option n’est prise en charge que pour la bibliothèque d’authentification « MSAL ». Veuillez redémarrer Visual Studio Code après avoir modifié cette option.
it: Abilita l'uso del provider di autenticazione Sql per la modalità di autenticazione 'Microsoft Entra ID Interactive' quando l'utente seleziona l'autenticazione 'AzureMFA'. Abilita l'integrazione dell'endpoint risorsa lato server durante il recupero dei token di accesso. Questa opzione è supportata solo per la libreria di autenticazione 'MSAL'. Riavvia Visual Studio Code dopo aver modificato questa opzione.
ja: ユーザーが 'AzureMFA' 認証を選択したときに、'Microsoft Entra Id Interactive' 認証モードで Sql 認証プロバイダーを使用できるようにします。これにより、アクセス トークンをフェッチするときに、サーバー側のリソース エンドポイントの統合が可能になります。このオプションは、'MSAL' 認証ライブラリでのみサポートされています。このオプションを変更した後、Visual Studio Code を再起動してください。
pt_br: Permite o uso do Provedor de Autenticação Sql para o modo de autenticação "Microsoft Entra ID Interactive" quando o usuário seleciona a autenticação "AzureMFA". Isso permite a integração de ponto de extremidade de recurso do lado do servidor ao buscar tokens de acesso. Essa opção só tem suporte para a Biblioteca de Autenticação ''MSAL''. Reinicie o Visual Studio Code após alterar essa opção.
ru: Разрешает использование поставщика проверки подлинности SQL для режима проверки подлинности "Microsoft Entra Id Interactive", когда пользователь выбирает проверку подлинности "AzureMFA". Это разрешает интеграцию конечной точки ресурсов на стороне сервера при получении маркеров доступа. Этот параметр поддерживается только для библиотеки проверки подлинности "MSAL". Перезапустите Visual Studio Code после изменения этого параметра.

# mssql.showEstimatedPlan
source: Estimated Plan
es: Plan estimado
it: Piano stimato
ru: Предполагаемый план

# mssql.runCurrentStatement
source: Execute Current Statement
es: Ejecutar la instrucción actual
fr: Exécuter l’instruction actuelle
it: Esegui istruzione corrente
ja: 現在のステートメントを実行
pt_br: Executar Instrução Atual
ru: Выполнить текущую инструкцию

# mssql.runQuery
source: Execute Query
es: Ejecutar la consulta
fr: Exécuter la requête
it: Esecuzione query
ja: クエリの実行
pt_br: Executar Consulta
ru: Выполнить запрос

# mssql.copilot.explainQuery
source: Explain Query
es: Explicar la consulta
it: Spiega query
ru: Объясните запрос

# mssql.dacpacDialog.export
source: Export BACPAC
es: Exportar BACPAC
it: Esporta BACPAC
ru: Экспорт BACPAC

# mssql.dacpacDialog.extract
source: Extract DACPAC
es: Extraer DACPAC
it: Estrai pacchetto di applicazione livello dati
ru: Извлечь DACPAC

# mssql.walkthroughs.nextSteps.description
source: Familiarize yourself with more features of the MSSQL extension that can help you be more productive.
es: Familiarícese con más características de la extensión MSSQL que pueden ayudarle a ser más productivo.
fr: Familiarisez-vous avec d’autres fonctionnalités de l’extension MSSQL qui peuvent vous permettre d’améliorer votre productivité.
it: Familiarizza con altre funzionalità dell'estensione MSSQL che possono aiutarti a essere più produttivo.
pt_br: Familiarize-se com mais recursos da extensão MSSQL que podem ajudar você a ser mais produtivo.
ru: Изучите другие функции расширения MSSQL, которые помогут вам работать более производительно.

# mssql.filterNode
source: Filter
es: Filtrar
fr: Filtre
it: Filtro
ja: フィルター
ru: Фильтр

# mssql.walkthroughs.nextSteps.objectExplorerFilters.title
source: Filter your Object Explorer Tree
es: Filtrado del árbol del Explorador de objetos
fr: Filtrer l’arborescence de votre Explorateur d’objets
it: Filtra l'albero Esplora oggetti
pt_br: Filtrar sua Árvore do Pesquisador de Objetos
ru: Фильтрация дерева обозревателя объектов

# mssql.walkthroughs.getStarted.title
source: Get Started with MSSQL for Visual Studio Code
es: Introducción a MSSQL para Visual Studio Code
fr: Prise en main de MSSQL pour Visual Studio Code
it: Inizia con MSSQL per Visual Studio Code
pt_br: Comece a usar o MSSQL para Visual Studio Code
ru: Начать работу с MSSQL для Visual Studio Code

# mssql.showGettingStarted
source: Getting Started Guide
es: Guía de introducción
fr: Guide de démarrage
it: Guida introduttiva
ja: はじめにガイド
pt_br: Guia de Introdução
ru: Руководство по началу работы

# mssql.dacpacDialog.import
source: Import BACPAC
es: Importar BACPAC
it: Importa BACPAC
ru: Импорт BACPAC

source: MSSQL configuration
es: Configuración de MSSQL
fr: Configuration MSSQL
it: Configurazione di MSSQL
ja: MSSQL 構成
pt_br: Configuração do MSSQL
ru: Конфигурация MSSQL

# mssql.walkthroughs.getStarted.connectToDatabase.description
source: Make a new connection to a SQL database, or edit existing connections with the connection dialog. You can connect to a database by entering your connection information, using a connection string, or browsing your Azure subscriptions. [Open Connection Dialog](command:mssql.addObjectExplorer)
es: Realice una nueva conexión a una base de datos SQL o edite las conexiones existentes con el cuadro de diálogo de conexión. Puede conectarse a una base de datos escribiendo su información de conexión, usando una cadena de conexión o navegando por sus suscripciones de Azure. [Abrir cuadro de diálogo de conexión](command:mssql.addObjectExplorer)
fr: Créez une connexion à une base de données SQL ou modifiez les connexions existantes à l’aide de la boîte de dialogue de connexion. Vous pouvez vous connecter à une base de données en entrant vos informations de connexion, en utilisant une chaîne de connexion ou en parcourant vos abonnements Azure. [Ouvrir la boîte de dialogue de connexion](command:mssql.addObjectExplorer)
it: Crea una nuova connessione a un database SQL o modifica le connessioni esistenti con la finestra di dialogo di connessione. Puoi connetterti a un database immettendo le informazioni di connessione, usando una stringa di connessione o esplorando le tue sottoscrizioni Azure. [Finestra di dialogo Apri connessione](command:mssql.addObjectExplorer)
pt_br: Crie uma nova conexão com um banco de dados SQL ou edite conexões existentes na caixa de diálogo de conexão. Você pode se conectar a um banco de dados inserindo suas informações de conexão, usando uma string de conexão ou navegando por suas assinaturas do Azure. [Abrir Caixa de Diálogo de Conexão](command:mssql.addObjectExplorer)
ru: Создайте новое подключение к базе данных SQL или измените существующие подключения в диалоговом окне подключения. Подключиться к базе данных можно, введя информацию для подключения, используя строку подключения или просматривая подписки Azure. [Открыть диалоговое окно подключения](command:mssql.addObjectExplorer)

# mssql.manageProfiles
source: Manage Connection Profiles
es: Administrar perfiles de conexión
fr: Gérer les profils de connexion
it: Gestisci profili di connessione
ja: 接続プロファイルの管理
pt_br: Gerenciar Perfis de Conexão
ru: Управление профилями подключения

# mssql.query.maxXmlCharsToStore
source: Maximum number of characters to store for each value in XML columns after running a query. Default value: 2,097,152. Valid value range: 1 to 2,147,483,647.
es: Número máximo de caracteres que se almacenarán para cada valor en columnas XML después de ejecutar una consulta. Valor predeterminado: 2 097 152. Intervalo de valores válido: de 1 a 2 147 483 647.
fr: Nombre maximal de caractères à stocker pour chaque valeur dans les colonnes XML après l’exécution d’une requête. Valeur par défaut : 2 097 152. Plage de valeurs valide : 1 à 2 147 483 647.
it: Numero massimo di caratteri da archiviare per ogni valore nelle colonne XML dopo l'esecuzione di una query. Valore predefinito: 2.097.152. Intervallo di valori valido: da 1 a 2.147.483.647.
ja: クエリの実行後に XML 列の各値に格納する最大文字数。既定値: 2,097,152。有効な値の範囲: 1 から 2,147,483,647。
pt_br: Número máximo de caracteres a serem armazenados em cada valor nas colunas XML depois de executar uma consulta. Valor padrão: 2.097.152. Intervalo de valor válido: 1 a 2.147.483.647.
ru: Максимальное сохраняемое количество символов для каждого значения в столбцах XML после выполнения запроса. Значение по умолчанию: 2 097 152. Допустимый диапазон значений: от 1 до 2 147 483 647.

# mssql.query.maxCharsToStore
source: Maximum number of characters/bytes to store for each value in character/binary columns after running a query. Default value: 65,535. Valid value range: 1 to 2,147,483,647.
es: Número máximo de caracteres/bytes que se almacenarán para cada valor en columnas de caracteres o binarios después de ejecutar una consulta. Valor predeterminado: 65 535. Intervalo de valores válido: de 1 a 2 147 483 647.
fr: Nombre maximal de caractères/octets à stocker pour chaque valeur dans les colonnes de caractères/binaires après l’exécution d’une requête. Valeur par défaut : 65 535. Plage de valeurs valides : 1 à 2 147 483 647.
it: Numero massimo di caratteri/byte da archiviare per ogni valore in colonne di tipo carattere/binario dopo l'esecuzione di una query. Valore predefinito: 65.535. Intervallo di valori valido: da 1 a 2.147.483.647.
ja: クエリの実行後に、文字/バイナリ列の各値に格納する最大文字数/バイト数。既定値: 65,535。有効な値の範囲: 1 から 2,147,483,647。
pt_br: Número máximo de caracteres/bytes a serem armazenados em cada valor nas colunas caractere/binário depois de executar uma consulta. Valor padrão: 65.535. Intervalo de valor válido: 1 a 2.147.483.647.
ru: Максимальное сохраняемое количество символов/байт для каждого значения в символьных/двоичных столбцах после выполнения запроса. Значение по умолчанию: 65 535. Допустимый диапазон значений: от 1 до 2 147 483 647.

# mssql.logFilesRemovalLimit
source: Maximum number of old files to remove upon startup that have expired mssql.logRetentionMinutes. Files that do not get cleaned up due to this limitation get cleaned up next time Azure Data Studio starts up.
es: Número máximo de archivos antiguos para quitarse en el inicio que tienen expirado el valor mssql.logRetentionMinutes. Los archivos que no se limpien debido a esta limitación se limpiarán la próxima vez que se inicie Azure Data Studio.
fr: Nombre maximal d’anciens fichiers ayant dépassé mssql.logRetentionMinutes à supprimer au démarrage. Les fichiers qui ne sont pas nettoyés du fait de cette limitation le sont au prochain démarrage d’Azure Data Studio.
it: Numero massimo di file meno recenti da rimuovere all'avvio per cui è scaduto il tempo impostato con mssql.logRetentionMinutes. I file che non vengono rimossi a causa di questa limitazione verranno rimossi al successivo avvio di Azure Data Studio.
ja: mssql.logRetentionMinutes の有効期限が切れた、起動時に削除する古いファイルの最大数。この制限のためにクリーンアップされないファイルは、Azure Data Studio の次回の起動時にクリーンアップされます。
pt_br: Número máximo de arquivos antigos a serem removidos na inicialização com mssql.logRetentionMinutes expirado. Os arquivos que não forem limpos devido a essa limitação serão limpos na próxima vez em que o Azure Data Studio for iniciado.
ru: Максимальное число старых файлов, удаляемых при запуске, с истекшим сроком mssql.logRetentionMinutes. Файлы, которые не были очищены из-за этого ограничения, очищаются при следующем запуске Azure Data Studio.

# mssql.query.setRowCount
source: Maximum number of rows to return before the server stops processing your query.
es: Número máximo de filas para devolver antes de que el servidor deje de procesar la consulta.
fr: Nombre maximal de lignes à retourner avant que le serveur arrête le traitement de votre requête.
it: Numero massimo di righe da restituire prima che il server arresti l'elaborazione della query.
ja: サーバーがクエリの処理を停止する前に返す行の最大数。
pt_br: O número máximo de linhas a serem retornadas antes que o servidor pare de processar sua consulta.
ru: Максимальное число строк, которые будут возвращены перед тем, как сервер перестанет обрабатывать ваш запрос.

# mssql.query.textSize
source: Maximum size of text and ntext data returned from a SELECT statement
es: Tamaño máximo del texto y datos de ntext devueltos por una instrucción SELECT
fr: Taille maximale des données text et ntext retournées par une instruction SELECT
it: Dimensioni massime dei dati di tipo text e ntext restituiti da un'istruzione SELECT
ja: SELECT ステートメントから返されるテキストおよび ntext データの最大サイズ
pt_br: O tamanho máximo de dados text e ntext retornados de uma instrução SELECT
ru: Максимальный размер данных типа text и ntext, возвращаемых инструкцией SELECT

# mssql.openAzureDataStudioMigration
source: Migrate from Azure Data Studio
it: Effettuare la migrazione da Azure Data Studio
ru: Миграция из Azure Data Studio

# mssql.editTable
source: Modify Table
es: Modificar tabla
it: Modifica tabella
ru: Изменить таблицу

# mssql.newDeployment
source: New Deployment
es: Implementación nueva
it: Nuova distribuzione
ru: Новое развертывание

# mssql.objectExplorerNewQuery
source: New Query
es: Nueva consulta
fr: Nouvelle requête
it: Nuova query
ja: 新しいクエリ
pt_br: Nova Consulta
ru: Создать запрос

# mssql.newQuery
source: New Query
es: Nueva consulta
fr: Nouvelle requête
it: Nuova query
ja: 新しいクエリ
pt_br: Nova Consulta
ru: Создать запрос

# mssql.newTable
source: New Table
es: Nueva tabla
fr: Nouvelle table
it: Nuova tabella
ja: 新しいテーブル
pt_br: Nova Tabela
ru: Создать таблицу

# mssql.walkthroughs.nextSteps.title
source: Next Steps with MSSQL for Visual Studio Code
es: Pasos siguientes con MSSQL para Visual Studio Code
fr: Étapes suivantes avec MSSQL pour Visual Studio Code
it: Fasi successive con MSSQL per Visual Studio Code
pt_br: Próximas etapas com MSSQL para o Visual Studio Code
ru: Дальнейшие действия с MSSQL для Visual Studio Code

# mssql.logRetentionMinutes
source: Number of minutes to retain log files for backend services. Default is 1 week.
es: Número de minutos para conservar los archivos de registro para los servicios back-end. El valor predeterminado es 1 semana.
fr: Nombre de minutes de conservation des fichiers journaux pour les services de back-end. La durée par défaut est 1 semaine.
it: Numero di minuti per la conservazione dei file di log per i servizi di back-end. L'impostazione predefinita è 1 settimana.
ja: バックエンド サービスのログ ファイルを保持する分単位の時間。既定値は 1 週間です。
pt_br: O número de minutos para reter os arquivos de log dos serviços de back-end. O padrão é uma semana.
ru: Срок хранения файлов журналов (в минутах) для серверных служб. По умолчанию задана 1 неделя.
