Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++78caadaa3d12c39131d70d9b85b2aa5b4fdc874138c7fa884349a843312e02c7
source: Cannot connect due to expired tokens. Please re-authenticate and try again.
es: No se puede conectar debido a que los tokens han expirado. Vuelva a autenticar e inténtelo de nuevo.
fr: Impossible de se connecter en raison de jetons expirés. Veuillez vous authentifier à nouveau, puis réessayez.
it: Non è possibile connettersi a causa di token scaduti. Ripetere l'autenticazione e riprovare.
ja: トークンの有効期限が切れているため、接続できません。再認証して、もう一度お試しください。
pt_br: Não é possível conectar devido aos tokens expirados. Reautentique-se e tente novamente.
ru: Не удается подключиться из-за токенов с истекшим сроком действия. Выполните проверку подлинности заново и повторите попытку.

# ++CODE++7c2b8feda9e74131c46fcd8892b9661d32e0dcfc3d10d9f4d4d948540ea4bb87
source: Cannot create foreign key
es: No se puede crear la clave externa
fr: Impossible de créer la clé étrangère
it: Non è possibile creare la chiave esterna
pt_br: Não é possível criar chave estrangeira
ru: Не удается создать внешний ключ

# ++CODE++5bf30206188ff92ec48bba56b2bf99fcb46ba9c20a05460485cf684b81a9c54b
source: Cannot exclude {0}. Included dependents exist
es: No se pueden excluir {0}. Existen dependientes incluidos
fr: Impossible d’exclure {0}. Il existe des dépendants inclus
it: Non è possibile escludere {0}. Esistono dipendenti inclusi
pt_br: Não é possível excluir {0}. Existem dependentes incluídos
ru: Невозможно исключить {0}. Существуют включенные зависимости

# ++CODE++14c454076816c0b275e2257bbf79446718f442983b537c0c96d0c69451924452
source: Cannot exclude {0}. Included dependents exist, such as {1}
es: No se puede excluir {0}. Existen dependientes incluidos, como {1}
fr: Impossible d’exclure {0}. Les dépendants inclus existent, tels que {1}
it: Non è possibile escludere {0}. Esistono dipendenti inclusi, ad esempio {1}
pt_br: Não é possível excluir {0}. Existem dependentes incluídos, como {1}
ru: Невозможно исключить {0}. Существуют включенные зависимости, например {1}

# ++CODE++01adf8aae81a6ef23bd48a183bc221def8cebdf0dc5490668df49f07e3eb3615
source: Cannot include {0}. Excluded dependents exist
es: No se puede incluir {0}. Existen dependientes excluidos
fr: Ne peut pas inclure {0}. Il existe des dépendants exclus
it: Non è possibile includere {0}. Esistono dipendenti esclusi
pt_br: Não é possível incluir {0}. Existem dependentes excluídos
ru: Невозможно включить {0}. Существуют исключенные зависимости

# ++CODE++9e3eef26ce324ceb6b5c6f2cb1d94e3961f1bc4915d314c3324c6cd5d6b12710
source: Cannot include {0}. Excluded dependents exist, such as {1}
es: No se puede incluir {0}. Existen dependientes excluidos, como {1}
fr: Ne peut pas inclure {0}. Il existe des dépendants exclus, tels que {1}
it: Non è possibile includere {0}. Esistono dipendenti esclusi, ad esempio {1}
pt_br: Não é possível incluir {0}. Existem dependentes excluídos, como {1}
ru: Невозможно включить {0}. Существуют исключенные зависимости, например {1}

# ++CODE++6911a1b423a04fe5c7be67cef3b8f03bd45b8ef5c986041317322d8131df5edf
source: Cannot revert: The column is part of a foreign key that references a deleted table
it: Non è possibile eseguire il ripristino: la colonna fa parte di una chiave esterna che fa riferimento a una tabella eliminata

# ++CODE++cb0415b7eba8d09fece0299cef934d73da69c94720cfc5583914aca2a16fcac2
source: Cannot revert: The referenced table or column has been deleted
it: Non è possibile eseguire il ripristino: la tabella o la colonna di riferimento è stata eliminata

# ++CODE++9527fb2b3d5ccb62606c88f7604ddb16febed19faead67b1edf263f6e0c8fe0b
source: Cascade
es: Cascada
it: Propaga a cascata
pt_br: Cascata
ru: Каскад

# ++CODE++292c06f0045a45d044be282b132b7055ae224e18e02b523a451d8ea96fadfd24
source: Category
it: Categoria

# ++CODE++c0bf75bd78bf9572596720d596bd5a20a5b9145cde0fe50dec1e783cb184d69b
source: Change
es: Cambiar
fr: Modifier
it: Modifica
pt_br: Alterar
ru: Изменить

# ++CODE++6bd09f9171ad9aa3824a8e54ea5edf59d28c768124be9dc7f9d2c5c7eee6780b
source: Change Database
es: Cambiar base de datos
fr: Modifier la base de données
it: Modifica database
ru: Изменить базу данных

# ++CODE++a949f46230748d3f7496809b82cec6daa6ec8a671d17ac1ca03a17173cbcb2d6
source: Change Password
es: Cambiar contraseña
it: Cambia password
ru: Изменить пароль

# ++CODE++7cd8625322b19db450bf5b5df61bd30ef4b1905e112753ea458faf1881b2ff01
source: Change database to '{2}' for connection '{0}' (ID: {1})?
es: ¿Desea cambiar la base de datos a "{2}" para la conexión "{0}" (id.: {1})?
it: Modificare il database in "{2}" per la connessione "{0}" (ID: {1})?
ru: Изменить базу данных на "{2}" для подключения "{0}" (ИД: {1})?

# ++CODE++aa115b472e9ca1287d8404ed9c69fb8612db771dfcb9ec5f560662fd0a7d653b
source: Changed Tables
es: Tablas modificadas
fr: Tables modifiées
it: Tabelle modificate
pt_br: Tabelas Alteradas
ru: Измененные таблицы

# ++CODE++6ba2dfc2755e1d829986d3bf36cdea9fc88fa8c16d079b7d0f6a6309e8e67a6a
source: Changed database context to "{0}" for document "{1}"
es: El contexto de base de datos se ha cambiado a "{0}" para el documento "{1}".
fr: Contexte de base de données remplacé par « {0} » pour le document « {1} »
it: Il contesto del database è stato cambiato in "{0}" per il documento "{1}"
ja: ドキュメント "{0}" のデータベース コンテキストが "{1}" に変更されました
pt_br: Contexto do banco de dados alterado para "{0}" para o documento "{1}"
ru: Контекст базы данных изменен на "{0}" для документа "{1}"

# ++CODE++88dcff06d01faeaf2253a502d07b9358b907ef3497a0f69c2f6546ffdc06b7b7
source: Changed database context to "{0}" on server "{1}" on document "{2}".
es: El contexto de la base de datos se cambió a "{0}" en el servidor "{1}" en el documento "{2}".
fr: Contexte de base de données remplacé par « {0} » sur le serveur « {1} » et le document « {2} ».
it: Il contesto del database in "{0}" nel server "{1}" nel documento "{2}" è stato modificato.
ja: ドキュメント "{0}" でサーバー "{1}" のデータベース コンテキストを "{2}"に変更しました。
pt_br: Contexto do banco de dados alterado para "{0}" no servidor "{1}" no documento "{2}".
ru: Контекст базы данных изменен на "{0}" на сервере "{1}" в документе "{2}".

# ++CODE++720013ab95347611fa0f2918e0e719accc806e30e5f0cb349c8594b2a0e46dc2
source: Changes ({0})
it: Modifiche ({0})

# ++CODE++cf51bd8ae1e56e8e81b07f1e7f35e10d580788d9e0892a8a4896c2378227f4f0
source: Changes published successfully
es: Cambios publicados correctamente
fr: Modifications publiées avec succès
it: Le modifiche sono state pubblicate
ja: 変更が正常に公開されました
pt_br: Alterações publicadas com sucesso
ru: Изменения успешно опубликованы

# ++CODE++35c09389e41adb1bb2bf8991c39e3927981a271ab80a41ec216995e909344c23
source: Changes saved successfully.
es: Se guardaron los cambios correctamente.
it: Salvataggio delle modifiche completato.
ru: Изменения сохранены.

# ++CODE++37b6d72a119e5ec53d1dc71ba94cbed9566519488230f6a4e40ae82bfc8bc79f
source: Changing database context to "{0}" on server "{1}" on document "{2}".
es: Cambiando el contexto de la base de datos a "{0}" en el servidor "{1}" en el documento "{2}".
fr: Remplacement du contexte de base de données par « {0} » sur le serveur « {1} » et sur le document « {2} ».
it: Modifica del contesto del database in "{0}" nel server "{1}" nel documento "{2}".
ja: ドキュメント "{0}" でサーバー "{1}" のデータベース コンテキストを "{2}" に変更中です。
pt_br: Alterando o contexto do banco de dados para "{0}" no servidor "{1}" no documento "{2}".
ru: Контекст базы данных заменяется на "{0}" на сервере "{1}" в документе "{2}".

# ++CODE++05f3d402836232769e679102361ab60a576dc268c9a53003baac88f0b742157d
source: Changing database to '{2}' for connection '{0}' (ID: {1})
es: Cambiando la base de datos a "{2}" para la conexión "{0}" (Id.: {1})
it: Modifica del database in "{2}" per la connessione "{0}" (ID: {1})
ru: Изменение базы данных на "{2}" для подключения "{0}" (ИД: {1})

# ++CODE++6822b8489308b650f2e36cb439297b0c4a43859fe39e164aea3ad453f4bd14d7
source: Chat command not available in this VS Code version
es: El comando de chat no está disponible en esta versión de VS Code
it: Comando chat non disponibile in questa versione VS Code
ru: Команда чата недоступна в этой версии VS Code

# ++CODE++c8cabf4a998e678eb3213d46a3e9e80217b7839fb5f3537ee550a65e3b2202c9
source: Check Constraint
es: Restricción CHECK
fr: Contrainte de validation
it: Vincolo CHECK
ja: CHECK 制約
pt_br: Restrição CHECK
ru: Проверочное ограничение

# ++CODE++4a41af1285aa71f4e677bc3fa729070b3c3c0af177cb4e9f12e34f1e21045894
source: Check Constraints
es: Comprobar restricciones
fr: Vérifier les contraintes
it: Vincoli CHECK
ja: CHECK 制約
pt_br: Restrições CHECK
ru: Проверочные ограничения

# ++CODE++43034967e711bc54bfe87c71c74ca2a19a39ca0d6e18c5d495cd90634d25eea0
source: Checking Docker Engine Configuration
es: Comprobando la configuración del motor de Docker
fr: Vérification de la configuration du moteur Docker
it: Verifica della configurazione del motore Docker
ru: Проверка конфигурации подсистемы Docker

# ++CODE++75fa3318f66944d01336b10cbb1e3c08afc6e230d849ee6fff4f4dba7f19489c
source: Checking Docker prerequisites...
es: Comprobando los requisitos previos de Docker...
it: Controllo dei prerequisiti di Docker in corso...
ru: Проверяются предварительные условия Docker...

# ++CODE++469663d6e6c1f487f123cf95220bce4d9ac1c98f2cd06e373ccb0baa14c343d4
source: Checking if Docker is installed
es: Comprobar si Docker está instalado
fr: Vérification de l’installation de Docker
it: Verifica dell'installazione di Docker
ru: Проверка установки Docker

# ++CODE++75053118ac86a00be268a5a2a66b8b40a5249559ce3fc76bb45463dcc532782d
source: Checking if Docker is installed on your machine
es: Comprobar si Docker está instalado en la máquina
fr: Vérification de l’installation de Docker sur votre machine
it: Verifica dell'installazione di Docker nel computer
ru: Проверяется, установлено ли средство Docker на компьютере

# ++CODE++2341d1c3197fc3205cd4550c118259316a51c665389e9a3c74db361c6e11d83a
source: Checking if Docker is running on your machine. If not, we'll start it for you.
es: Comprobando si Docker se está ejecutando en la máquina. Si no es así, lo iniciaremos por usted.
fr: Vérification de l’exécution de Docker sur votre machine. Si ce n’est pas le cas, nous le démarrerons pour vous.
it: È in corso un controllo per verificare se Docker è in esecuzione nel computer. In caso contrario, verrà avviato.
ru: Проверяется, запущено ли средство Docker на компьютере. Если нет, мы запустим его.

# ++CODE++6be7e803f4291ec5e83f38d2789fd4ea6c31923cdf1eedfa48564e33708cc5d3
source: Checking if Docker is started
es: Comprobando si Docker se ha iniciado
fr: Vérification de l’installation de Docker
it: Verifica dell'avvio di Docker
ru: Проверяется, запущено ли средство Docker

# ++CODE++741262e58e1274cef3f38a5aa8042fcf05db92d4ca8e9c9e573acd0e2242ba97
source: Checking if the Docker Engine is configured correctly on your machine.
es: Comprobando si el motor de Docker está configurado correctamente en la máquina.
fr: Vérification de la configuration du moteur Docker sur votre machine.
it: È in corso un controllo per verificare se il motore Docker è configurato correttamente nel computer.
ru: Проверка правильности настройки подсистемы Docker на компьютере.

# ++CODE++38ccc9db5b300e54116d6f6e8b8ee1420fea7792e8483c7368fdd964b6ecef0a
source: Checking pre-requisites
es: Comprobación de los requisitos previos
fr: Vérification de la configuration requise
it: Verifica dei prerequisiti
ru: Проверка предварительных требований

# ++CODE++de88f00e461bb1cd413f9c556b06e1b903006bb3c0123f2e75fdff92532034af
source: Choose An Action
es: Elegir una acción
fr: Choisir une action
it: Scegliere un'azione
ja: アクションの選択
pt_br: Escolher uma Ação
ru: Выберите действие.

# ++CODE++61f2371ac2547488417f83422706e0e6c12b3c12f5f3595e90da91cbb167c174
source: Choose Query History
es: Elegir historial de consultas
fr: Choisir l’historique des requêtes
it: Scegliere la cronologia delle query
ja: Query History の選択
pt_br: Escolher o Histórico de Consultas
ru: Выбрать журнал запросов

# ++CODE++a1578b6089ec41921bc4a70b05ca1b1171199d5d5fea6ac6c345cba9b29a83ef
source: Choose SQL Language
es: Elegir el lenguaje de SQL
fr: Choisir le langage SQL
it: Scegli linguaggio SQL
ja: SQL 言語の選択
pt_br: Escolher linguagem SQL
ru: Выберите язык SQL

# ++CODE++dcee789e6048807617a646e20bfba75832b8e459fdd8a9e41c08665ee4d8d36a
source: Choose a Microsoft Entra account
es: Elegir una cuenta de Microsoft Entra
fr: Choisissez un compte Microsoft Entra
it: Scegliere un account Microsoft Entra
ja: Microsoft Entra アカウントを選択する
pt_br: Escolha uma conta do Microsoft Entra
ru: Выберите учетную запись Microsoft Entra

# ++CODE++a89bad7e873f85fc6867185da8c42b2743f3264bf2df68800c16c23a20e1a9cf
source: Choose a Microsoft Entra tenant
es: Elegir un inquilino de Microsoft Entra
fr: Choisissez un locataire Microsoft Entra
it: Scegliere un tenant di Microsoft Entra
ja: Microsoft Entra テナントを選択する
pt_br: Escolha um locatário do Microsoft Entra
ru: Выберите клиент Microsoft Entra

# ++CODE++b05ab4483a5949bf2effb49592a7bb9dceafedb9a3c6aae12a32341025fc1511
source: Choose a connection profile from the list below
es: Elegir un perfil de conexión de la lista siguiente
fr: Choisir un profil de connexion dans la liste ci-dessous
it: Scegliere un profilo di connessione dall'elenco seguente
ja: 下の一覧から、接続プロファイルを選択します
pt_br: Escolha um perfil de conexão da lista abaixo
ru: Выберите профиль подключения из расположенного ниже списка

# ++CODE++3b961516b68d49db85d3ded5bc5c1129e02be1a647845d77b1eb2ab5260284cb
source: Choose a database from the list below
es: Elegir una base de datos de la lista siguiente
fr: Choisir une base de données dans la liste ci-dessous
it: Scegliere un database dall'elenco seguente
ja: 下の一覧からデータベースを選択してください
pt_br: Escolha um banco de dados na lista abaixo
ru: Выберите базу данных из приведенного ниже списка

# ++CODE++f374a2978746011d60b5e1785696b4f2c1fe9165edc4f876767d2f1282240cb2
source: Choose a hostname for the container
es: Elección de un nombre de host para el contenedor
fr: Choisissez un nom d’hôte pour le conteneur
it: Scegliere un nome host per il contenitore
ru: Выберите имя узла для контейнера

# ++CODE++3152aa1eecc4ae815f286d840683f8a27d00ed17af850886caef1ff5e3d9e122
source: Choose a name for the SQL Server Docker Container
es: Elija un nombre para el contenedor Docker de SQL Server
fr: Choisir un nom pour le conteneur Docker SQL Server
it: Scegliere un nome per il contenitore Docker di SQL Server
ru: Выберите имя для контейнера Docker с SQL Server

# ++CODE++2191d6b3f382356ffd46db277fcd0896e4b5f73a62989e0af8754832ed84c319
source: Choose a port to host the SQL Server Docker Container
es: Elija un puerto para hospedar el contenedor Docker de SQL Server
fr: Choisissez un port pour héberger le conteneur Docker SQL Server
it: Scegliere una porta per ospitare il contenitore Docker di SQL Server
ru: Выберите порт для размещения контейнера Docker с SQL Server

# ++CODE++8dc22bcccf1fa2165bc27bcd3af9d5979985733f54896c185307a1ccd0e0d134
source: Choose an option to provision a database
es: Elija una opción para aprovisionar una base de datos
it: Scegliere un'opzione per effettuare il provisioning di un database
ru: Выберите вариант для подготовки базы данных

# ++CODE++ac64b397d6dc32aa86e749583723d12ec51ada87e971cfe6c41de1454f7131b0
source: Choose color
es: Elija el color
fr: Choisissez une couleur
it: Scegliere un colore
ru: Выберите цвет

# ++CODE++4e42da2b0c2533c1a0dfa98e9f4ec67fbaf07a0da192dafa93aaf98bc07fd959
source: Choose the Right Version
es: Elegir la versión correcta
fr: Choisir la bonne version
it: Scegliere la versione corretta
ru: Выберите подходящую версию

# ++CODE++be798452e0ca7a38f6487ecb9115f26ba148e2d4475608bdc4277d34d41be0a7
source: Circular reference detected: '{0}' → '{1}' creates a cycle
es: Referencia circular detectada: "{0}" → "{1}" crea un ciclo
fr: Référence circulaire détectée : « {0} » → « {1} » crée un cycle
it: Rilevato riferimento circolare: '{0}' → '{1}' crea un ciclo
pt_br: Referência circular detectada: ''{0}'' → ''{1}'' cria um ciclo
ru: Обнаружена циклическая ссылка: "{0}" → "{1}" создает замкнутый цикл

# ++CODE++83b12c2216efb4fdc924e1deb5182e905e4926ed0c1c324d467107f46d5a26a9
source: Clear
es: Borrar
fr: Effacer
it: Cancella
ja: クリア
pt_br: Limpar
ru: Прозрачный

# ++CODE++ddceb7adfdb8816e4747bc48a2221702e830340e5596a701dc0993766eba5e60
source: Clear All
es: Borrar todo
fr: Effacer tout
it: Deseleziona tutto
ja: すべてクリア
pt_br: Limpar Tudo
ru: Очистить все

# ++CODE++08e2c4e53c4b3b6008b7bc4d82eb29ab933d3b6c08b34eda0637fbf148fb1529
source: Clear Recent Connections List
es: Borrar la lista de conexiones recientes
fr: Effacer la liste des connexions récentes
it: Cancella elenco delle connessioni recenti
ja: 最近の接続履歴をクリア
pt_br: Limpar Lista de Conexões Recentes
ru: Очистить список недавних подключений

# ++CODE++c52ff5ea803d577544a8224d1404ecefa836b803f029d87cd7450af6c18a70ef
source: Clear Selection
es: Borrar selección
fr: Effacer la sélection
it: Cancella selezione
pt_br: Limpar Seleção
ru: Очистить выделение

# ++CODE++8046678782bb5feaf7131b03db70b9f5f66007fcc8b0c670c186db149edeb041
source: Clear Sort
es: Borrar ordenación
fr: Effacer le tri
it: Cancella ordinamento
ru: Очистить сортировку

# ++CODE++29a390f9237e3c84e5641785eca25199620e53f7b6f4b9d843b23dcb5c12904f
source: Clear all
it: Cancella tutto

# ++CODE++de22447d91bbb54edb718c661ff961ca832ff4260ec61ea538be1fed4e688cd8
source: Clear all filters
es: Borrar todos los filtros
it: Cancella tutti i filtri
ru: Очистить все фильтры

# ++CODE++2c41036cefbc864e021ed1f12d45fe960a9ac85b8586d9338a1e3f9a2dcd65a1
source: Clear all grouping
es: Borrar todas las agrupaciones
it: Cancella tutti i raggruppamenti
ru: Очистить все группировки

# ++CODE++64b1f96ecb4f24b2df07eb570a31246b394e2b09d4d19d942ed0f815c1c5c6be
source: Clear all sorting
es: Borrar toda la ordenación
it: Cancella tutti gli ordinamenti
ru: Очистить все сортировки

# ++CODE++bb7638a0d8b3b374d81381caaf50ea1e5639135dd6ec1df7bc2dae0f344b72ec
source: Clear cache and refresh token
es: Borrar la memoria caché y el token de actualización
fr: Effacer le cache et actualiser le jeton
it: Cancella la cache e aggiorna il token
ru: Очистить кэш и обновить токен

# ++CODE++21f5ea19572773c428e8375b3d63058ad4f04aea83df347deb633f9ddad9a643
source: Clear permissions for all extensions to access your connections
es: Borrar permisos para que todas las extensiones accedan a las conexiones
fr: Effacer les autorisations d’accès à vos connexions pour toutes les extensions
it: Cancellare le autorizzazioni per consentire a tutte le estensioni di accedere alle tue connessioni
ru: Очистить разрешения для всех расширений на доступ к вашим подключениям

# ++CODE++524ed5b794acd857648e76bead9db5ba131ebcb17f3a92d98ece51db61e65dbf
source: Clear token cache
es: Borrar caché de tokens
it: Cancella la cache dei token
ru: Очистить кэш токенов

# ++CODE++4e0d71f8a0b3fdc5cdaba4028072ad8cf788bac47864232a1988ac9453453a36
source: Click to cancel loading summary
es: Haz clic para cancelar el resumen de carga
it: Fai clic per annullare il caricamento del riepilogo
ru: Нажмите, чтобы отменить загрузку сводки

# ++CODE++6bca6724e27bd109d1b946c1684e16c2c4a5d71731a9ffe5f666bdd9d9846b1e
source: Click to connect to a database
es: Hacer clic para conectarse a una base de datos
fr: Cliquez pour vous connecter à une base de données
it: Fare clic per connettersi a un database
ja: クリックすると、データベースに接続します
pt_br: Clique para se conectar a um banco de dados
ru: Щелкните здесь, чтобы подключиться к базе данных

# ++CODE++66abaeec0367ba4920e21447dfa2dafb94c7f38dc262dfb91e76799022a436d5
source: Click to load summary
es: Haz clic para cargar el resumen
it: Fai clic per caricare il riepilogo
ru: Нажмите, чтобы загрузить сводку

# ++CODE++88af7d4ffbbad0f31d9dd918e49ceb713036db12524cbdc4b93e8922b0655429
source: Click to sign into an Azure account
es: Haga clic para iniciar sesión en una cuenta de Azure
fr: Cliquer pour vous connecter à un compte Azure
it: Fare clic per accedere a un account Azure
ru: Щелкните, чтобы войти в учетную запись Azure

# ++CODE++7d9eb7acb13e24625c404401d8e88b2350e32162455885f18276cf802f7701ed
source: Close
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
pt_br: Fechar
ru: Закрыть

# ++CODE++a9d0b49f48a51a21c93552032bd3ac0b356430187424536e274c84b493cac48e
source: Close Designer
es: Cerrar Designer
fr: Fermer le concepteur
it: Chiudi finestra di progettazione
ja: Designer を閉じる
pt_br: Fechar o Designer
ru: Закрыть конструктор

# ++CODE++4c7dd73e4af7d97c296dc01ab37edd119e5ef22592cb6a302bd9dc9a55264873
source: Close Find
es: Cerrar búsqueda
fr: Fermer la recherche
it: Chiudi Trova
pt_br: Fechar pesquisa
ru: Закрыть поиск

# ++CODE++643a90a6bde33b562cd0de040386daa285bf033a5027344e98ad12c8d2cac56a
source: Close Script Pane
es: Cerrar panel de scripts
it: Riquadro Chiudi script
ru: Закрыть область скрипта

# ++CODE++3bd5ea966485fd0a628d3dc7d499e2551a0381dcb8b4237bfdbb08aaf6b88468
source: Close properties pane
es: Cerrar panel de propiedades
it: Chiudere riquadro proprietà
ru: Закрыть панель свойств

# ++CODE++548e8cc0e8c2423c61f30c6e8b75a1a40c995e3be119df6272b280ab6c15a011
source: Close the current connection
es: Cierra la conexión actual.
fr: Fermer la connexion actuelle
it: Chiude la connessione corrente
ja: 現在の接続を閉じる
pt_br: Fechar a conexão atual
ru: Закрыть текущее подключение

# ++CODE++be6eb1fc3b05bf9dceebad2eac7841d1b2f40bda9aa2da34df8ca22af02bc3ed
source: Collapse
es: Contraer
fr: Réduire
it: Comprimi
pt_br: Recolher
ru: Свернуть

# ++CODE++55988e28a4e8720a588c5c53fd47616d929a404d3d2af7e6f8ba313dce6dc3e4
source: Collapse All
es: Contraer todo
fr: Réduire tout
it: Comprimi tutto
ja: すべて折りたたむ
pt_br: Recolher Tudo
ru: Свернуть все

# ++CODE++73bdb3fe57af851db2313c3716cc6e6d8584314063030d5262237ad2fa9f8201
source: Collapse Workspace Explorer
es: Contraer explorador del área de trabajo
it: Comprimi Esplora aree di lavoro
ru: Свернуть проводник по рабочим областям

# ++CODE++bbeecf3d3d08d6b405f2fce7ea90dd90c7d438d7a926329a86bffb5c8de96c55
source: Collapse all groups
es: Contraer todos los grupos
it: Comprimi tutti i gruppi
ru: Свернуть все группы

# ++CODE++a85ebf45b79818fe0f9459bd61eb48e03ea0b9668381e94448c7c100b1e25d8d
source: Collapse connection groups
it: Comprimere gruppi di connessione
ru: Свернуть группы подключений

# ++CODE++3c9c88307ac2637ebf206d18b530363f5b9a09fb9d44a6817d8da20da0b4f7d1
source: Collapse connections
it: Comprimere connessioni
ru: Свернуть подключения

# ++CODE++2a741bf60e87cb92c5850d89286135aaed0b73927b901114af28ad88fe82951f
source: Collation
it: Regole di confronto

# ++CODE++6b73191a0a4b67420e61d51c9f207c35277eaf18fbbf5beb52a320a23fe09653
source: Color
fr: Couleur
it: Colore
ru: Цвет

# ++CODE++3fdc9a587693f9e63574b30ec55c2b947a7fb4ba5fd11f0cf213072f53d91bdd
source: Column
es: Columna
fr: Colonne
it: Colonna
ja: 列
pt_br: Coluna
ru: Столбец

# ++CODE++2a1e6a732f104ee56a84bfe7a04f48a47af3401ee2df16272b47af0195bae023
source: Column '{0}' already exists
es: La columna "{0}" ya existe
fr: La colonne « {0} » existe déjà
it: La colonna '{0}' esiste già
pt_br: A coluna '{0}' já existe
ru: Столбец "{0}" уже существует

# ++CODE++b5f14952d79f90995588047df35fde3562e4851c778c9ee4853fed33252eceba
source: Column '{0}' already has a foreign key
es: La columna "{0}" ya tiene una clave externa
fr: La colonne « {0} » a déjà une clé étrangère
it: La colonna '{0}' ha già una chiave esterna
pt_br: A coluna '{0}' já tem uma chave estrangeira
ru: Столбец "{0}" уже содержит внешний ключ
