Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++64aaab208c8e1d1152e423b463ee58006e8479fe03f9b92d91be13935401d6d8
source: SQL Server {0} - latest
es: SQL Server {0}: más reciente
fr: SQL Server {0} – dernière version
it: SQL Server {0} - ultima versione
ru: SQL Server {0} — последняя версия

# ++CODE++c15c5b93db5aa2d000fa6a98f1eaad96beff26347b410388dc524f19a0f0aeee
source: SQL database in Fabric (Preview)
es: SQL Database en Fabric (versión preliminar)
it: Database SQL in Fabric (anteprima)
ru: База данных в Fabric (предварительная версия)

# ++CODE++33c911ed6f7c6e8d0093aecd7c73564bf2ef2992db044a0892fc3de8b92cdb71
source: SQLCMD Variables
es: Variables SQLCMD
it: Variabili SQLCMD
ru: Переменные SQLCMD

# ++CODE++be3bac2c67dcc1b486b10add2ba1bf56e6e49fd17d6187fe6b6c012b08cedbfc
source: Satisfied
es: Satisfecho
fr: Satisfait
it: Soddisfacente
pt_br: Satisfeito
ru: Нравится

# ++CODE++993f024b650eaf0f1c64118f6033c44b7c98d220539bcb51454ca578f6f2b477
source: Saturation
es: Saturación
it: Saturazione
ru: Насыщенность

# ++CODE++1509f561f2416598629b886ad7d3c05a7e221e4e0675c84bbff4ee6d9e03913d
source: Save
es: Guardar
fr: Enregistrer
it: Salva
pt_br: Salvar
ru: Сохранить

# ++CODE++dee3e3871faf828499426928ded1c3d2762c767a5c9f07e954d25a63aca26da2
source: Save .scmp file
es: Guardar archivo .scmp
fr: Enregistrer le fichier .scmp
it: Salva file .scmp
pt_br: Salvar o arquivo .scmp
ru: Сохранить файл .scmp

# ++CODE++088203b4cd88789e07f4e9a8f05cf6e8c1d0b413ae32d30cae69beeef94784e6
source: Save As
es: Guardar como
fr: Enregistrer sous
it: Salva con nome
pt_br: Salvar Como
ru: Сохранить как

# ++CODE++4a3dca5ad8733bf29762c2315ae7e89e4f9a30c2ad082e4b01a93cc96e7d442e
source: Save As...
es: Guardar como...
it: Salva con nome...
ru: Сохранить как...

# ++CODE++35322b5bb5a218a15401cfa54d23b16459e9e1c616977526a4b37b6c87d30c50
source: Save Changes
es: Guardar cambios
it: Salva modifiche
ru: Сохранить изменения

# ++CODE++df2839447956141d6503caf44145db003e70b17dc128d5c4fefec188b28d6966
source: Save Connection Group
es: Guardar grupo de conexiones
fr: Enregistrer le groupe de connexion
it: Salva gruppo di connessione
ru: Сохранить группу подключений

# ++CODE++caf4128d5bf679fef30d60d545684f44efcc2e9a7098df16fcbd0b625580c89f
source: Save Password
es: Guardar contraseña
fr: Enregistrer un mot de passe
it: Salva la password
ja: パスワードの保存
pt_br: Salvar Senha
ru: Сохранить пароль

# ++CODE++77252dc87eec71818cc0b5c0bc0e82792f92540faad923e81c6d5dcd3119e31a
source: Save Password? If 'No', password will be required each time you connect
es: ¿Quiere guardar la contraseña? Si selecciona "No", se le solicitará cada vez que se conecte.
fr: Enregistrer le mot de passe ? Si vous choisissez « Non », le mot de passe sera demandé à chaque connexion
it: Salvare la password? Se si specifica 'No', la password verrà richiesta a ogni connessione
ja: パスワードを保存しますか?[いいえ] を選ぶと、毎回の接続の際にパスワードが要求されます
pt_br: Salvar a senha? Se escolher "Não", a senha será solicitada sempre que você se conectar
ru: Сохранить пароль? При ответе "Нет" пароль будет требоваться каждый раз при подключении

# ++CODE++22995cab793b6ddc02993f48d7042dff97e62df3faf4b7742629243a36ce968d
source: Save Plan
es: Guardar plan
fr: Enregistrer le plan
it: Salva piano
ja: プランの保存
pt_br: Salvar Plano
ru: Сохранить план

# ++CODE++e50761ebedbdddb4dd4afb99a7c0964cf8bfed33ec03cb39f5a08e65812c795a
source: Save as CSV
es: Guardar como CSV
fr: Enregistrer au format CSV
it: Salva in formato CSV
ja: CSV として保存
pt_br: Salvar como CSV
ru: Сохранить в формате CSV

# ++CODE++f16fdea0ffe7c1d1a7e39080f54fcf518de82268186b3a569d4132cda24f138f
source: Save as CSV ({0})
es: Guardar como CSV ({0})
it: Salva in formato CSV ({0})
ru: Сохранить в формате CSV ({0})

# ++CODE++40838c73e26d7ae3162bb4250c2c1e261a33fec5478432e6e47ba9ab6649c1ef
source: Save as Excel
es: Guardar como Excel
fr: Enregistrer au format Excel
it: Salva in formato Excel
ja: Excel として保存
pt_br: Salvar como Excel
ru: Сохранить как файл Excel

# ++CODE++c6d0c9d65b752916c8f5647d310c760cc1f9e2aa20e9994942fe8a8219f5e043
source: Save as Excel ({0})
es: Guardar como Excel ({0})
it: Salva in formato Excel ({0})
ru: Сохранить как файл Excel ({0})

# ++CODE++b99387bd84bcf310d6fb1c7e860b919e4f57e8d6d1fdac34cc2e624cbf0b5496
source: Save as INSERT INTO
es: Guardar como INSERT INTO
it: Salva come INSERT INTO
ru: Сохранить как INSERT INTO

# ++CODE++d4c4a2d704829f0ab4b2a416311ebfab2b516e06fb2fe3eb0673fe5c2f65104c
source: Save as INSERT INTO ({0})
es: Guardar como INSERT INTO ({0})
it: Salva come INSERT INTO ({0})
ru: Сохранить как INSERT INTO ({0})

# ++CODE++910ed5e0c43df2bc1a2c71f1d5ecd2168b919fd4dc9f6d4b1f13f660cba9c524
source: Save as JSON
es: Guardar como JSON
fr: Enregistrer au format JSON
it: Salva in formato JSON
ja: JSON として保存
pt_br: Salvar como JSON
ru: Сохранить как JSON

# ++CODE++0572989f274f777f1664fd8629f853c8dd7c0ec75f8d64332f4501b5d45c40d5
source: Save as JSON ({0})
es: Guardar como JSON ({0})
it: Salva in formato JSON ({0})
ru: Сохранить как JSON ({0})

# ++CODE++bae1da28225af71a125385224716f5ff7870573e6c01494c597e8ed4168b12e3
source: Save results command cannot be used with multiple selections.
es: El comando para guardar resultados no se puede usar con varias selecciones.
fr: Impossible d’utiliser la commande d’enregistrement des résultats avec des sélections multiples.
it: Non è possibile usare il comando Salva risultati con selezioni multiple.
ja: 結果の保存コマンドは、複数が選択された状態では使用できません。
pt_br: O comando para salvar resultados não pode ser usado com múltiplas seleções.
ru: Команда сохранения результатов не может быть использована при выборе нескольких элементов.

# ++CODE++0a12b3e51f64e705d6de90db7bcada67844d93e118f414b2fc703b2014efabc5
source: Save source and target, options, and excluded elements
es: Guardar origen y destino, opciones y elementos excluidos
fr: Enregistrer la source et la cible, les options et les éléments exclus
it: Salva origine e destinazione, opzioni ed elementi esclusi
pt_br: Salvar a origem e o destino, as opções e os elementos excluídos
ru: Сохранить источник, целевой объект, параметры и исключенные элементы

# ++CODE++5a2df8a2745d54fa2197753e1c2c22a8dea9676916677120da5c44550647180d
source: Saved Connections
es: Conexiones guardadas
fr: Connexions enregistrées
it: Connessioni salvate
pt_br: Conexões Salvas
ru: Сохраненные подключения

# ++CODE++28b9471fbcdd3a3ce3799551c1cee3825afe4ea4ce67688c764bd4a364028bd9
source: Scaffold backend components (e.g., data-access layers) based on your current database context
es: Generar componentes de back-end (p. ej., capas de acceso a datos) basados en el contexto actual de la base de datos
it: Esegui automaticamente lo scaffolding dei componenti back-end (ad esempio, i livelli di accesso ai dati) basandoti sul contesto attuale del database
ru: Создавайте макеты серверных компонентов (например, слои доступа к данным) на основе текущего контекста базы данных

# ++CODE++f102986b39effb31080ae442f61febe7ed58df1515c0711ccfadfe0311ccec81
source: Scale
es: Escalar
fr: Mettre à l’échelle
it: Ridimensionamento
ja: スケーリング
pt_br: Escala
ru: Масштаб

# ++CODE++b8c590be37f9806eacc2f43e047d943cb0b51e96d92efe6f1549fd0d13d03a25
source: Scale mismatch between '{0}' and '{1}'
es: Error de coincidencia de escala entre "{0}" y "{1}"
fr: Inadéquation d'échelle entre '{0}' et '{1}'
it: Errata corrispondenza della scala tra '{0}' e '{1}'
pt_br: Incompatibilidade de escala entre '{0}' e '{1}'
ru: Несоответствие масштаба между "{0}" и "{1}"

# ++CODE++154e484fc5e1a7cb4991c071caef673c453eaa7dcfef4321db537c576a5c56cf
source: Schema Compare
es: Comparación de esquemas
fr: Comparer les schémas
it: Confronto schemi
ru: Сравнение схем

# ++CODE++57232ac852b468be7624e8edcfabbb24ac13076a47e75fb4121be42bc813c881
source: Schema Compare Options
es: Opciones de Comparación de esquemas
fr: Options Comparer les schémas
it: Opzioni di confronto schemi
pt_br: Opções da Comparação de Esquemas
ru: Варианты сравнения схем

# ++CODE++8bd05764f179b5c53231ee8df7d8f52d5906689eb660f1bd0ff33d1e0817290c
source: Schema Compare failed: '{0}'
es: Error de Comparación de esquemas: "{0}"
fr: Échec de Comparer les schémas : « {0} »
it: Confronto schemi non riuscito: '{0}'
pt_br: Falha na Comparação de Esquemas: ''{0}''
ru: Сравнить схемы не удалось: "{0}"

# ++CODE++15b5d02ad3478e97181969698b48fe22f92298cc513e992be78922dc8f3ffe9c
source: Schema Designer
es: Diseñador de esquemas
fr: Concepteur de schémas
it: Finestra di progettazione schema
ru: Конструктор схем

# ++CODE++04073026831053dab587997eca3ee2c8445a80a9f9395820b6a48ac4cb4449b1
source: Schema Designer Model is ready. Changes can now be published.
es: El modelo del Diseñador de esquemas está listo. Ahora se pueden publicar los cambios.
fr: Le modèle de Concepteur de schéma est prêt. Les modifications peuvent maintenant être publiées.
it: Il modello di Designer dello schema è pronto. Ora è possibile pubblicare le modifiche.
pt_br: O Modelo do Designer de Esquema está pronto. As alterações agora podem ser publicadas.
ru: Модель конструктора схем готова. Теперь можно опубликовать изменения.

# ++CODE++625f64194868ec34a2b8b5b02385d3999fc9cdddbb2e823e10a1d965574d8e6c
source: Schema visualization opened.
es: Visualización de esquema abierta.
fr: Visualisation de schéma ouverte.
it: Visualizzazione dello schema aperta.
ru: Визуализация схемы открыта.

# ++CODE++26336e4216dbda9c374906c54ade398c597b59facd87fba0be1758fc497bde2a
source: Schema/Object Type
es: Tipo de objeto/esquema
fr: Schéma/Type d’objet
it: Schema/tipo di oggetto
pt_br: Esquema/Tipo de Objeto
ru: Тип схемы или объекта

# ++CODE++b0c3c04a510b1ec97731ab7984cca0594c8cd6e4da0f283bd510502ef217306f
source: Script as Create
es: Script como Create
it: Genera script come CREATE
ru: Сценарий в режиме создания

# ++CODE++f6a9305d2a22223e43e016e6ed4d342a8a4a249c1202322338ee3e0d5f26e596
source: Script copied to clipboard
es: Script copiado en el Portapapeles
fr: Script copié dans le presse-papiers
it: Script copiato negli Appunti
pt_br: Script copiado para a área de transferência
ru: Сценарий скопирован в буфер обмена.

# ++CODE++0fa2fcc906f37ba513ba034858611a8ca8efb5bada90e29e0c66b5679dea5b92
source: Script copied to clipboard.
es: Script copiado en el Portapapeles.
it: Script copiato negli Appunti.
ru: Скрипт скопирован в буфер обмена.

# ++CODE++bd74591fea2d60dc873cec192685f7b6a930d2a370d5b3c9032014bf8224529a
source: Search Workspaces
es: Buscar áreas de trabajo
it: Cerca aree di lavoro
ru: Поиск рабочих областей

# ++CODE++aaaa485833bc1126532a77262f7adc4878fb96ef300e673630f1c0f3670199d4
source: Search changes...
it: Cerca modifiche...

# ++CODE++4f5103123c8a9080ba6c1595ab5f058a1aa4715fe8c1aa2b956b6512f28cc365
source: Search connection groups
es: Buscar grupos de conexiones
fr: Recherche des groupes de connexion
it: Cerca gruppi di connessione
ru: Поиск групп подключений

# ++CODE++448fcd5b80608528b5b492337667acf711f486e31784b41b4bba7066a9527ac4
source: Search for database objects...
es: Buscar objetos de base de datos...
it: Cerca oggetti di database...
ru: Поиск объектов базы данных...

# ++CODE++49ff54ad141b9f4b74b176a98807c6b9a1282dfe026c3f38015dd596c54c4a84
source: Search options...
es: Opciones de búsqueda...
fr: Options de recherche...
it: Opzioni di ricerca...
pt_br: Opções de pesquisa...
ru: Параметры поиска...

# ++CODE++6801207d5994165123a10ab767fd9439130fae500f8c407877ae5070843b906d
source: Search settings...
es: Configuración de búsqueda...
fr: Rechercher dans les paramètres...
it: Impostazioni della ricerca...
ru: Параметры поиска...

# ++CODE++771f5d2c0599dcf4194e3fdddd9a5212d6392f4703d29971575bb455b5287a84
source: Search tables...
es: Buscar tablas...
fr: Rechercher dans des tableaux...
it: Cerca tabelle...
ru: Поиск в таблицах...

# ++CODE++f0b2ef28c0bec626ad14f56179e18d97cdbfcb4f676c4735f95eae628d079538
source: Search term cannot be empty
es: El término de búsqueda no puede estar vacío
it: Il termine di ricerca non può essere vuoto
ru: Условие поиска не может быть пустым

# ++CODE++5c192a3e6f23b125cfaa70c46f6fcd47a2081fa7270e7687687ea8596d2e012f
source: Search workspaces...
es: Buscar áreas de trabajo...
it: Cerca aree di lavoro...
ru: Поиск рабочих областей...

# ++CODE++7f55382219f0202c1b4f56deb099e2fedcec87ee73fe2edb2105df5447323bc6
source: Search...
es: Buscar...
fr: Recherche en cours...
it: Ricerca...
pt_br: Pesquisar...
ru: Поиск...

# ++CODE++2a78025de6aae5e7ff88e5a951bb3a78ddd67388913529cf9e2dd9653e62b02d
source: Select
es: Seleccionar
fr: Sélectionner
it: Seleziona
ru: Выбрать

# ++CODE++d1ec69e64b9609d089aae09f7adc5c566d2cd222f8d8325f0ab3b523f0ac2690
source: Select All
es: Seleccionar todo
fr: Sélectionner tout
it: Seleziona tutto
pt_br: Selecionar Tudo
ru: Выбрать все

# ++CODE++3052f090b2dd0312f6564fb52c1f06b0efbe9fd7c77fdf38dcb96b4521b06b24
source: Select Azure account with Key Vault access for column decryption
es: Seleccionar la cuenta de Azure con acceso a Key Vault para el descifrado de columnas
fr: Sélectionner un compte Azure avec un accès à Key Vault pour déchiffrer les colonnes
it: Seleziona un account Azure con accesso a Key Vault per la decrittografia delle colonne
ru: Выберите учетную запись Azure с доступом к Key Vault для расшифровки столбцов

# ++CODE++fb36706789e855faf92bf6900c060554f0e8513ebb831ffe81ed991b28d07f8c
source: Select Connection
es: Seleccionar conexión
it: Seleziona connessione
ru: Выбор подключения

# ++CODE++a1103f928cc721a44f7c8cdbc11bab66f8a7e44d66485112edccc40525787cfb
source: Select Profile
es: Seleccionar perfil
it: Seleziona profilo
ru: Выберите профиль

# ++CODE++498e179dee6c281c74c130a980b58ecfdf8c85a97cf907ed7d820ef06afd8b51
source: Select Source
es: Seleccionar origen
fr: Sélectionner une source
it: Seleziona origine
pt_br: Selecionar Origem
ru: Выбор источника

# ++CODE++5807729000cb38665e918bf3d7ac25f319624d3024eb2760aba5f15f7eb53559
source: Select Source Schema
es: Seleccionar esquema de origen
fr: Sélectionner schéma source
it: Seleziona schema di origine
ru: Выберите исходную схему

# ++CODE++bdd155896fd28608c15efbc9269fc433a1838ca35f20e4dc656f20ffe2aff773
source: Select Target
es: Seleccionar destino
fr: Sélectionner une cible
it: Seleziona destinazione
pt_br: Selecionar Destino
ru: Выберите целевой объект

# ++CODE++b6d420411ce8b91f28e7fc43e45c44a8550af2984463e5dc85541595a0ac37ba
source: Select Target Schema
es: Seleccionar esquema de destino
fr: Sélectionner schéma cible
it: Seleziona schema di destinazione
ru: Выберите целевую схему

# ++CODE++dc5dab3f76a3546eddc86074dd625184201ce48a51cb1eeee7a05c3efa98f940
source: Select a Microsoft Entra ID account to use with this connection. The original account information from Azure Data Studio is listed below, but you can choose a different account.
it: Selezionare un account Microsoft Entra ID da usare con questa connessione. Di seguito sono elencate le informazioni dell'account originale di Azure Data Studio, ma è possibile scegliere un account diverso.
ru: Выберите учетную запись Microsoft Entra ID для использования с этим подключением. Исходные сведения об учетной записи из Azure Data Studio приведены ниже, но можно выбрать другую учетную запись.

# ++CODE++35ce1fefb3478f2ba328f46db9deb60e08786a3f825f64dd5f9804459c6b8b4c
source: Select a Workspace
es: Seleccionar un área de trabajo
it: Seleziona un'area di lavoro
ru: Выбор рабочей области

# ++CODE++c4300a3eee24147d9593a09a659650b44b4733e2979fef9cae3e3db10f116831
source: Select a connection group
es: Seleccionar un grupo de conexiones
fr: Sélectionnez un groupe de connexion
it: Selezionare un gruppo di connessione
ru: Выберите группу подключений

# ++CODE++c9e8c706a0db2ef84dc8a610e30fe22cb5709a146a0e76955dbd1f1444e5a0e6
source: Select a database
es: Seleccionar una base de datos
it: Selezionare un database
ru: Выбрать базу данных

# ++CODE++7b75dbfbfa94648cb2dc0bdd07902822febebcb1410a01746d0cf1ee01d33e71
source: Select a file
it: Selezionare un file
ru: Выберите файл

# ++CODE++8a953dbed756a0be682ea17fe4c3be30e723ec8c98816d4b73fd86719df8dcc0
source: Select a server
es: Seleccionar un servidor
it: Seleziona un server
ru: Выберите сервер

# ++CODE++ebe0dbee443b4562c7925a01e3bc69a3d5d0a3b0e8b3e11041c69fa067b65ef7
source: Select a tenant
es: Seleccionar un inquilino
fr: Sélectionner un locataire
it: Seleziona un tenant
ja: テナントを選択してください
pt_br: Selecionar um locatário
ru: Выберите клиент

# ++CODE++8b43c4bf79e62cb8e9f61b4fddc6e921b87020df8bca991bbf77a39628ec9106
source: Select a valid {0} from the dropdown
es: Seleccione un {0} válido en la lista desplegable
fr: Sélectionner un élément valide {0} dans la liste déroulante
it: Selezionare un valore {0} valido dall'elenco a discesa
pt_br: Selecione um {0} válido na lista suspensa
ru: Выберите допустимый {0} из раскрывающегося меню

# ++CODE++903e816918c1b2835c9186eed7375ce85cc0f6230c48afbaa979177517e8545d
source: Select a workspace to view the databases in it.
es: Seleccione un área de trabajo para ver las bases de datos que contiene.
it: Selezionare un'area di lavoro in cui visualizzare i database al suo interno.
ru: Выберите рабочую область для просмотра баз данных в ней.

# ++CODE++a1205265db328a59a52187387e01e37a0e1d2b28210aa2e663f750eb8b7c8dcf
source: Select a {0} for filtering
es: Seleccionar un {0} para filtrar
fr: Sélectionner un {0} pour le filtrage
it: Selezionare un oggetto {0} per il filtro
pt_br: Selecione um {0} para filtragem
ru: Выберите a {0} для фильтрации

# ++CODE++6dd7b48a3fb195b4a52c7d60e9f3b179113b489c9412a881a41abf06da3df7e2
source: Select account
it: Seleziona account
ru: Выбрать учетную запись

# ++CODE++1fc9a387654d410febd202b81bddbe62d38368260b69b9f73ee6630164536bdf
source: Select all
es: Seleccionar todo
fr: Sélectionner tout
it: Seleziona tutto
ja: すべて選択
pt_br: Selecionar tudo
ru: Выбрать все

# ++CODE++80a484c3416afd950fcefa87e88b0514e65144c7d45c12bf0bc9809c46837f89
source: Select all options
es: Seleccionar todas las opciones
fr: Options « Sélectionner tout »
it: Seleziona tutte le opzioni
ru: Выбрать все параметры

# ++CODE++ba89783a339fd43f48271d2e9813374075b46d8896bfa4f99444022a42847531
source: Select an account
es: Seleccione una cuenta
fr: Sélectionner un compte
it: Scegli un account
ja: アカウントを選択してください
pt_br: Selecionar uma conta
ru: Выберите учетную запись

# ++CODE++3e75bab98257a9ea127e284caff7f62dff2d154f115bb79a6a087b51fd54936d
source: Select an account for authentication
it: Selezionare un account per l'autenticazione
ru: Выбрать учетную запись для аутентификации

# ++CODE++1032e1d25c0d5131be3195e1e53197385eb21d860f4f14f7bbc4cfcce4bfd109
source: Select an extension to manage connection sharing permissions
es: Seleccionar una extensión para administrar los permisos de conexión compartida
fr: Sélectionner une extension pour gérer les autorisations de partage de connexion
it: Selezionare un'estensione per gestire le autorizzazioni di condivisione delle connessioni
ru: Выберите расширение для управления разрешениями на совместное использование подключений

# ++CODE++cac9a015dc3356af3f386e840985bfc09d57c0b9cc01a88e26ec67f3501058d8
source: Select an object to view its definition ({0} results)
es: Seleccionar un objeto para ver su definición ({0} resultados)
it: Selezionare un oggetto per visualizzarne la definizione ({0} risultati)
ru: Выберите объект для просмотра его определения (результатов: {0})

# ++CODE++16900742d2f35c9ffb6cc72369893127a8357154e22d9c4b84f020e87dac0602
source: Select an operation
es: Seleccionar una operación
it: Seleziona un'operazione
ru: Выберите операцию

# ++CODE++6a8027c451f5eed5d0e62f3f599e8d39a787706b19612279423f6b706b1751f3
source: Select image
es: Seleccionar imagen
fr: Sélectionner une image
it: Seleziona immagine
ru: Выберите образ

# ++CODE++154f133b3d7ef488e01090c00b0104ba7bf48bf4368e2ad71333fd3d863fb270
source: Select new permission for extension: '{0}'
es: Seleccionar nuevo permiso para la extensión: '{0}'
fr: Sélectionner une nouvelle autorisation pour l’extension : « {0} »
it: Selezionare una nuova autorizzazione per l'estensione: "{0}"
ru: Выберите новое разрешение для расширения: "{0}"

# ++CODE++a387a608fae904e256b03c48e16889d585f52ddd5dfbceccf00959b34f384031
source: Select or clear all connection groups
it: Selezionare o deselezionare tutti i gruppi di connessione
ru: Выбрать или очистить все группы подключений

# ++CODE++a55cdaf558e3df25a1e10c4967be5c53e2a9e2b74ba13f61aa4fc8ee866d03e9
source: Select or clear all connections
it: Selezionare o deselezionare tutte le connessioni
ru: Выбрать или очистить все подключения

# ++CODE++abfd7db0b03514a66749641525344550918faa842cd1455111b0531217e05074
source: Select package file
es: Seleccionar el archivo de paquete
it: Seleziona file del pacchetto
ru: Выберите файл пакета

# ++CODE++e286357ecd532997834edbf13478a2b3ca334a9dda1c8e895c0bd8b26f6097b5
source: Select profile to remove
es: Seleccionar el perfil que se va a quitar
fr: Sélectionner le profil à supprimer
it: Selezionare il profilo da rimuovere
ja: 削除するプロファイルを選択します
pt_br: Selecione um perfil para remover
ru: Выберите профиль для удаления

# ++CODE++31c1868de5b07d10224f472d3f5957b4502175ab68a89839134a1f1dd747ab3b
source: Select subscriptions
es: Seleccionar suscripciones
fr: Sélectionner des abonnements
it: Seleziona sottoscrizioni
pt_br: Selecionar assinaturas
ru: Выбрать подписки

# ++CODE++816fb2b1f45f1228327db6df7e553f728b2074ca7897d2b506a881d6a7e5f6f6
source: Select the Azure Data Studio settings.json file to scan for connection groups and connections.
it: Selezionare il file settings.json di Azure Data Studio per cercare gruppi di connessione e connessioni.
ru: Выберите файл Azure Data Studio settings.json для проверки на наличие подключений и групп подключений.

# ++CODE++5c61a29b1d409ff2b70f6fbd1032d7250ac322407dc4b8bbff19eb20af562291
source: Select the SQL Server Container Image
es: Selección de la imagen de contenedor de SQL Server
fr: Sélectionnez l’image conteneur SQL Server
it: Selezionare l'immagine del contenitore di SQL Server
ru: Выберите образ контейнера SQL Server

# ++CODE++5354479c5248dd63b7110fca45437164866ebbdc35bd5d19a5b814535534024e
source: Selected Microsoft Entra account removed successfully.
es: La cuenta de Microsoft Entra seleccionada se quitó correctamente.
fr: Le compte Microsoft Entra sélectionné a été supprimé avec succès.
it: L'account Microsoft Entra selezionato è stato rimosso correttamente.
ja: 選択した Microsoft Entra アカウントが正常に削除されました。
pt_br: Conta do Microsoft Entra selecionada removida com sucesso.
ru: Выбранная учетная запись Microsoft Entra удалена.

# ++CODE++6e45e850e5552217009a64f5c87e898720561d6263867b0cebfc6f770aff9810
source: Selected Path
it: Percorso selezionato
ru: Выбранный путь

# ++CODE++6b0054dcd0116896729545198c9cdfe9b8f97008d91d39084e5c8808a6784c58
source: Server Edition
es: Edición del servidor
it: Edizione server
ru: Выпуск сервера

# ++CODE++86c1cd65696eadbc588fd4fe04d8b03ca948befc5a89467c621edf47f885118c
source: Server Version
es: Versión de servidor
it: Versione server
ru: Версия сервера

# ++CODE++1c53883708ab16a3743793905feb38c8e77c295d846ff276491831e1de69b6e1
source: Server connection in progress. Do you want to cancel?
es: Conexión de servidor en curso. ¿Desea cancelar?
fr: Connexion au serveur en cours. Voulez-vous annuler ?
it: La connessione al server è in corso. Annullare?
ja: サーバーへ接続中です。キャンセルしますか?
pt_br: Conexão ao servidor em andamento. Deseja cancelar?
ru: Выполняется подключение к серверу. Хотите отменить?
