Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++a58008628a726d4f8798f9f92347d47f8f5c1c1aece67f8128600de9311a65e1
source: Deleting Container...
es: Eliminando contenedor...
fr: Suppression du conteneur...
it: Eliminazione del contenitore...
ru: Удаление контейнера...

# ++CODE++05a2d7332eb9d8bf164487c743a2e93c21b16bb2061a93e3ee2ceb508eadb753
source: Deny
es: Denegar
fr: Refuser
it: Nega
ru: Запретить

# ++CODE++4c236daafb445f867f574918b3d07c901d73ac48d2ab87edb940b665d79e0039
source: Deploy
es: Implementar
it: Distribuisci
ru: Развернуть

# ++CODE++796590e031547b420cb30aea63caa00543f57651e3244a8823b769a5f1a1a74e
source: Deploy a .dacpac file to a new or existing SQL database
es: Implementar un archivo .dacpac en una base de datos SQL nueva o existente
it: Distribuire un file con estensione dacpac in un database SQL nuovo o esistente
ru: Развернуть файл DACPAC в новой или существующей базе данных SQL

# ++CODE++592bd375fa7c9d7ab616ecb3debb297c018a80c6a903167afbd6f1c4d68b0d0b
source: Deploy and extract .dacpac files or import/export .bacpac packages using an integrated, streamlined workflow in the MSSQL extension.
it: Distribuisci ed estrai file .dacpac o importa/esporta pacchetti .bacpac usando un flusso di lavoro integrato e semplificato nell'estensione MSSQL.
ru: Разворачивайте и извлекайте файлы DACPAC или импортируйте и экспортируйте пакеты BACPAC с помощью интегрированного и упрощенного рабочего процесса в расширении MSSQL.

# ++CODE++125abe6c1406f356647c415b8627a84a6d928dca274d3e70c26fff22c7b77580
source: Deploy database changes using a guided Publish Dialog in SQL Database Projects, with script preview for SQL Server and Azure SQL databases.
it: Distribuisci le modifiche al database usando una finestra di dialogo pubblica guidata nei progetti di database SQL, con anteprima dello script per i database SQL Server e Azure SQL.
ru: Развертывайте изменения базы данных с помощью интерактивного диалогового окна публикации в проектах базы данных SQL с предварительным просмотром сценариев для баз данных SQL Server и Azure SQL.

# ++CODE++97dc38d5949112e250523663a3556643b30754a83c8305adb6e79d88b13b200d
source: Deploy to Existing Database
es: Implementar a una base de datos existente
it: Distribuisci nel database esistente
ru: Развернуть в существующей базе данных

# ++CODE++75605e8fd5394c88086006f3ed265d8f5f725fdfb8827963a1be8f8348d31bee
source: Deploy, extract, import, or export data-tier applications on the selected database
es: Implemente, extraiga, importe o exporte aplicaciones de capa de datos en la base de datos seleccionada
it: Distribuisci, estrai, importa o esporta applicazioni livello dati nel database selezionato
ru: Разверните, извлеките, импортируйте или экспортируйте приложения уровня данных в выбранной базе данных

# ++CODE++77073cfc37f467e01ede7dd225bc91824e5fcb320f5723a633d43bd93b8a070b
source: Deploying DACPAC...
es: Implementando DACPAC...
it: Distribuzione del pacchetto di applicazione livello dati in corso...
ru: Выполняется развертывание DACPAC...

# ++CODE++05081f14d114ed28b2997927154de0eb554e2938d0254935df8bf9b4a129769f
source: Deployment Failed
es: Error de implementación
it: Distribuzione non riuscita
ru: Сбой развертывания

# ++CODE++d88868890471c6cc2ac101b2e2d848718a71936be8158d3c57ec81840fbefa54
source: Deployment Name
es: Nombre de implementación
it: Nome distribuzione
ru: Имя развертывания

# ++CODE++cc51187ae9dbe9ccc606865c0177000cdeca2af5bca1c36c7f3065882c6ee18b
source: Deployment in progress
es: Implementación en curso
it: Distribuzione in corso
ru: Выполняется развертывание

# ++CODE++526e0087cc3f254d9f86f6c7d8e23d954c4dfda2b312efc29194ae8a860106ba
source: Description
es: Descripción
it: Descrizione
ja: 説明
pt_br: Descrição
ru: Описание

# ++CODE++b16cf0590a6c78b2e8047509582e5448bd55e408cd112bd1f064e34529f6ce3d
source: Description for the table.
es: Descripción de la tabla.
fr: Description de la table.
it: Descrizione della tabella.
ja: テーブルの説明です。
pt_br: Descrição da tabela.
ru: Описание таблицы.

# ++CODE++b481dd486903dcfcb9af96c386e0455b3d7653785be92c9bb85bb02de161d062
source: Design, visualize, and evolve database schemas using an interactive diagram with synchronized SQL generation.
it: Progetta, visualizza e sviluppa schemi di database utilizzando un diagramma interattivo con generazione SQL sincronizzata.
ru: Разрабатывайте, визуализируйте и развивайте схемы баз данных с помощью интерактивной диаграммы с синхронизированной генерацией SQL.

# ++CODE++45989de49fb7f66dfe17a8fc26f3a02c7abcd74f7e8e6cf9f39fa0e3775780df
source: Details
es: Detalles
fr: Détails
it: Dettagli
pt_br: Detalhes
ru: Сведения

# ++CODE++4140839b57403cf1b132332262ad00592590d6f7970b0f83fc60fb9b8c53d707
source: Developer-friendly transactional database using the Azure SQL Database Engine.
es: Base de datos transaccional fácil de usar para desarrolladores que utiliza el motor de base de datos de Azure SQL.
it: Database transazionale ottimizzato per gli sviluppatori, basato sul motore di Database SQL di Azure.
ru: Удобная для разработчиков транзакционная база данных, использующая ядро СУБД SQL Azure.

# ++CODE++33df1f7746d428f19493d14c875c60ddc71befd7377ba92d4fc578bc3529b993
source: Directory not found
es: No se encontró el directorio
it: Directory non trovata
ru: Каталог не найден

# ++CODE++6fbed214e0ea21c683db0ba2d648ef09b11edf4b4bb23835d4fdda84b5d097f3
source: Disable intellisense and syntax error checking on current document
es: Deshabilite la comprobación de errores de sintaxis e IntelliSense en el documento actual.
fr: Désactiver IntelliSense et la vérification des erreurs de syntaxe sur le document actuel
it: Disabilita IntelliSense e il controllo degli errori di sintassi T-SQL nel documento corrente
ja: 現在のドキュメントで T-SQL インテリセンスと構文エラー チェックを無効にする
pt_br: Desabilite o IntelliSense e a verificação de erros de sintaxe no documento atual
ru: Отключить IntelliSense и проверку синтаксиса на ошибки в текущем документе

# ++CODE++75081b593d15cf6e631971bc6768723f593b88b172477e40ae7d363e4829816d
source: Disabled
es: Deshabilitado
it: Disabilitato
ru: Отключено

# ++CODE++eb1a70e39274bb762b5d7c1adb5debeea2b05e12af28207f21a375b596853273
source: Discard
es: Descartar
it: Rimuovi
ru: Отменить

# ++CODE++acfc5be785a9bb3da11c9f05adb69bd5633096f09002aa44813a1b3207e912ad
source: Disconnect
es: Desconectar
fr: Déconnecter
it: Disconnetti
ja: 切断
pt_br: Desconectar
ru: Отключить

# ++CODE++60e53a3c0e015fb417236c455fedf4985a7cddfc2721329be1e11ac9e284626d
source: Disconnect from connection '{0}' (ID: {1})?
es: ¿Desconectarse de la conexión "{0}" (Id.: {1})?
it: Disconnettersi dalla connessione "{0}" (ID: {1})?
ru: Отключиться от подключения "{0}" (ИД: {1})?

# ++CODE++2458834a3d92abf750b8161a959ff2bb0405a29bd8b3b77015d065249bd02b7f
source: Disconnected on document "{0}"
es: Se desconectó en el documento "{0}"
fr: Déconnecté du document « {0} »
it: Disconnessione eseguita nel documento "{0}"
ja: ドキュメント "{0}" で切断されました
pt_br: Desconectado do documento "{0}"
ru: Разорвано подключение документа "{0}"

# ++CODE++459c45733e24412e32c08ebea6b6819b4a29ca99ec1b99e5c8036d0165df44b7
source: Disconnected successfully
es: Desconexión correcta
it: Disconnessione completata
ru: Отключение выполнено

# ++CODE++b9d150a1c239a564e634666c8cebbaad8712f8f67c6fdf37c97d17643b3af579
source: Disconnecting from connection '{0}' (ID: {1})
es: Desconectando de la conexión "{0}" (Id.: {1})
it: Disconnessione dalla connessione "{0}" (ID: {1})
ru: Отключение от подключения "{0}" (ИД: {1})

# ++CODE++48845bff334a50a59aaecf499f28a7a24c3b4b891b8b18a9f1169ad8e8a6b261
source: Dismiss
es: Descartar
fr: Ignorer
it: Ignora
ja: 閉じる
pt_br: Ignorar
ru: Закрыть

# ++CODE++8a2ada67a303fe2602331dc153b30259b92e7cc2d741f8d5955d8af906ef016a
source: Displays the data type name for the column
es: Muestra el nombre del tipo de datos de la columna
fr: Affiche le nom du type de données pour la colonne.
it: Visualizza il nome del tipo di dati per la colonna.
ja: 列のデータ型名を表示します
pt_br: Exibe o nome do tipo de dados da coluna
ru: Показывает имя типа данных столбца.

# ++CODE++85297edc780e231f74a5f8ed6ec249358dfae002e468ef4fdf8e568b95e27c94
source: Displays the description of the column
es: Muestra la descripción de la columna
fr: Affiche la description de la colonne
it: Visualizza la descrizione della colonna
ja: 列の説明を表示します
pt_br: Exibe a descrição da coluna
ru: Показывает описание столбца.

# ++CODE++7bba5bcc44de61b37dcadb5824fac7130483b749da0c5e9eea5e02765e06e37d
source: Displays the unified data type (including length, scale and precision) for the column
es: Muestra el tipo de datos unificado (incluida la longitud, la escala y la precisión) de la columna.
fr: Affiche le type de données unifié (y compris la longueur, l'échelle et la précision) pour la colonne
it: Visualizza il tipo di dati unificato (inclusi lunghezza, scala e precisione) per la colonna
ja: 列の統合データ型 (長さ、小数部桁数、精度を含む) を表示します
pt_br: Exibe o tipo de dados unificados (incluindo comprimento, escala e precisão) para a coluna
ru: Показывает единый тип данных (включая длину, масштаб и точность) для столбца

# ++CODE++7a417a747e385113d9c481ed4937ff3d5b31de744c4db4312464f6f50729b616
source: Dissatisfied
es: Insatisfecho
fr: Mécontent(e)
it: Insoddisfacente
pt_br: Insatisfeito
ru: Не нравится

# ++CODE++5aa581a11dd95f698fe9aa92dc7a36755c462342f790df3b8054f328cde4b94b
source: Distinct Count: {0}
es: Recuento distinto: {0}
it: Valori distinti: {0}
ru: Число уникальных значений: {0}

# ++CODE++5ce32ed24291b6ee178d1069ca31842e8ead67e82f070a284cec1ab95498476c
source: Do you mind taking a quick feedback survey about the MSSQL Extension for VS Code?
es: ¿Te importaría responder a una encuesta rápida sobre la extensión MSSQL para VS Code?
fr: Acceptez-vous de participer à une enquête rapide sur l’extension MSSQL pour VS Code ?
it: Si è interessati a partecipare a un rapido sondaggio sull’estensione MSSQL per VS Code?
pt_br: Você pode fazer uma pesquisa rápida de comentários sobre a Extensão MSSQL para VS Code?
ru: Не хотите ли пройти краткий опрос о расширении MSSQL для VS Code?

# ++CODE++79520a5688933d6fc7b0f540292cbbfb2898a9edc2d85d0ee231b6ed63adaad1
source: Do you want to always display query results in a new tab instead of the query pane?
es: ¿Desea mostrar siempre los resultados de la consulta en una nueva pestaña en lugar del panel de consulta?
fr: Voulez-vous toujours afficher les résultats de la requête dans un nouvel onglet au lieu du volet de requête ?
it: Visualizzare sempre i risultati della query in una nuova scheda anziché nel riquadro query?
pt_br: Deseja sempre exibir os resultados da consulta em uma nova guia em vez do painel de consulta?
ru: Хотите ли вы всегда отображать результаты запроса на новой вкладке, а не на панели запроса?

# ++CODE++6ca9d6623e40335fc13a80d426d2dd39b8c8a8b656c66b0d973cee8d5d49e4d9
source: Docker failed to start within the timeout period. Please manually start Docker and try again.
es: Docker no se pudo iniciar dentro del período de tiempo de expiración. Inicie Docker manualmente e inténtelo de nuevo.
fr: Échec du démarrage du Docker dans le délai imparti. Veuillez démarrer Docker manuellement et réessayez.
it: Non è stato possibile avviare Docker entro il periodo di timeout. Avviare manualmente Docker e riprovare.
ru: Не удалось запустить Docker в течение времени ожидания. Запустите Docker вручную, затем повторите попытку.

# ++CODE++a5d38a76e9010d59374fafce6a3d75189df15be61859ee1ffa33da6e9cf97b05
source: Docker is not installed or not in PATH. Please install Docker Desktop and try again.
es: Docker no está instalado o no está en RUTA. Instale Docker Desktop e inténtelo de nuevo.
fr: Docker n’est pas installé ou n’est pas dans le PATH. Veuillez installer Docker Desktop et réessayer.
it: Docker non è installato o non è in PATH. Si prega di installare Docker Desktop e riprovare.
ru: Средство Docker не установлено или отсутствует в PATH. Установите Docker Desktop, затем повторите попытку.

# ++CODE++319f0296a0199ff55c80367670b4bc2dda57e9856942a4be10ca5a4b1531b6a1
source: Docker requires root permissions to run. Please run Docker with sudo or add your user to the docker group using sudo usermod -aG docker $USER. Then, reboot your machine and retry.
es: Docker requiere permisos raíz para ejecutarse. Ejecute Docker con sudo o agregue el usuario al grupo de Docker mediante sudo usermod -aG docker $USER. A continuación, reinicie la máquina y vuelva a intentarlo.
fr: Docker nécessite des autorisations root pour s’exécuter. Exécutez Docker avec sudo ou ajoutez votre utilisateur au groupe docker en utilisant sudo usermod -aG docker $USER. Ensuite, redémarrez votre machine et réessayez.
it: Docker richiede autorizzazioni radice per l'esecuzione. Eseguire Docker con sudo o aggiungere l'utente al gruppo Docker usando sudo usermod -aG docker $USER. Riavviare quindi il computer e riprovare.
ru: Для запуска Docker требуются права администратора. Запустите Docker с помощью команды sudo или добавьте пользователя в группу docker с помощью команды sudo usermod -aG docker $USER. Затем перезагрузите компьютер и повторите попытку.

# ++CODE++1d60d0cdcb5408b8e39ed364f675c9cad8a2f6174a413324d1e34437bd41269b
source: Don't Show Again
es: No volver a mostrar
fr: Ne plus afficher
it: Non visualizzare più
pt_br: Não Mostrar Novamente
ru: Больше не показывать

# ++CODE++831c69f02fd7c9c62450695c18f11c56b34ae3ababb1670737507a5cc01404b4
source: Don't show this again
es: No volver a mostrar
it: Non visualizzare più
ru: Больше не показывать

# ++CODE++c8af9ae37a48273f981bc82af63517e3a2195c4076360e73546c306a044dd38b
source: Drop
it: Rimuovi

# ++CODE++6762af3cf8c17ce017132a6670e2e67054ec353ed41c80d24e252f402aec1550
source: Drop '{0}' from '{1}'. This action cannot be undone.
it: Rimuovere "{0}" da "{1}". L'azione non può essere annullata.

# ++CODE++090015e97e08461a02b0915ed446e955928a4686cdc839c66bd9f7781b81d8fb
source: Drop Database
it: Rimuovi database

# ++CODE++9efa6488b1453597a16946eec3bec93d89632493aae8e137b09ed9ffcaf70e7b
source: Drop Database Options
it: Rimuovi opzioni di database

# ++CODE++0301e63bd19eb739abb705445f40ef5338164e75b5ccdaed58dc76bbebeb4f06
source: Drop active connections
it: Rimuovere le connessioni attive

# ++CODE++8cbb7c26112408cd60a1c8ac0daff1b020815ad01c94df751ab7145dea824881
source: Easily set up a local SQL Server without leaving VS Code extension. Just a few clicks to install, configure, and manage your server effortlessly!
es: Configure fácilmente un SQL Server local sin salir de la extensión de VS Code. Solo necesita unos clics para instalar, configurar y administrar su servidor sin esfuerzo.
it: Configurare facilmente un SQL Server locale senza uscire dall'estensione VS Code. Sono sufficienti pochi clic per installare, configurare e gestire il server senza sforzo.
ru: Легко настройте локальный SQL Server, не покидая расширение VS Code. Всего несколько щелчков для простой установки, настройки и администрирования сервера!

# ++CODE++464c4ffd019e1e9691dcf0537c797353ef2b1c1d4833d3d463e5b74ae4547344
source: Edit
es: Editar
fr: Modifier
it: Modifica
ja: 編集
pt_br: Editar
ru: Изменить

# ++CODE++8b45c43d0d9a0c27cbecb2683ef02b292a7f2626dee0f8443d4e62ac3e0e88c4
source: Edit Connection Group - {0}
es: Editar grupo de conexiones: {0}
fr: Modifier le groupe de connexion – {0}
it: Modifica gruppo di connessione - {0}
ru: Изменить группу подключений — {0}

# ++CODE++82beb1b74986a2b292e8084ee59f9bedf5e0decc13f020369faebf40ce2981c7
source: Edit Connection Group: {0}
es: Editar grupo de conexiones: {0}
fr: Modifier le groupe de connexion : {0}
it: Modifica gruppo di connessione: {0}
ru: Изменить группу подключений: {0}

# ++CODE++a43dafda7f271d0796fb53cc6c2d8f302b8c8892ea0fed0b1096e9c7769f91c1
source: Edit Connection Profile
es: Editar perfil de conexión
fr: Modifier le profil de connexion
it: Modifica profilo di connessione
ru: Изменить профиль подключения

# ++CODE++7b51f205866ab54cdf42089699d4b8d617c5a18ac8d82ee5bdfbe10533028f99
source: Edit Data (Preview)
it: Modifica dati (anteprima)
ru: Изменить данные (предварительная версия)

# ++CODE++3ed3609cfd38169ffe27957c6ef1ad4df5bdf9c403542839533396143d436b41
source: Edit Table
es: Editar tabla
fr: Modifier la table
it: Modifica tabella
pt_br: Editar Tabela
ru: Изменить таблицу

# ++CODE++7df64a9f48aa848c4d73ffa6d0d63511e082d0b8a592b9d6880d3988fb4006a7
source: Either profileId or serverName must be provided.
es: Se debe proporcionar profileId o serverName.
fr: ProfileId ou serverName doit être fourni.
it: È necessario specificare profileId o serverName.
ru: Необходимо указать profileId или serverName.

# ++CODE++1e71b5c8f3211f1f01b27341d3ddc6a2ad651800264b495c12b50867f998662c
source: Enable 'Trust Server Certificate'
es: Habilitar "certificado de servidor de confianza"
fr: Activer « Approuver le certificat de serveur »
it: Abilitare “Certificato del server attendibile”
pt_br: Habilitar ''Certificado do Servidor de Confiança''
ru: Включить параметр "Доверять сертификату сервера"

# ++CODE++fab99ae162d8056598a1ab43c81a2a5a296873c0868800c4f092697d8470720a
source: Enable Experiences & Reload
es: Habilitar experiencias y volver a cargar
fr: Activer les expériences et recharger
it: Abilita esperienze e ricarica
pt_br: Habilitar Experiências e Recarregar
ru: Включить функции и перезагрузить

# ++CODE++45e33ceba31737f1cb793c231fafc9dd99074ca1f26476a70b0c830ef155c9d3
source: Enable Trust Server Certificate
es: Habilitar certificado de servidor de confianza
fr: Activer Approuver le certificat de serveur
it: Abilitare Certificato del server attendibile
ja: 信頼サーバー証明書を有効にする
pt_br: Habilitar Confiar no certificado do servidor
ru: Включить опцию "Доверять сертификату сервера"

# ++CODE++92c1cdfdf4cb9cf6fcca962f206de36fd5d60db1178bc9461052f8de703a0e06
source: Enabled
es: Habilitado
it: Abilitato
ru: Включено

# ++CODE++76ad7b53af548367c78d7216972ce81ee53ecf7ee1d6fe5f3d16a73633bd4e49
source: Encountering a problem? Share the details with us by opening a GitHub issue so we can improve!
es: ¿Tiene algún problema? Para compartir los detalles con nosotros, abra un problema de GitHub para que podamos mejorar.
fr: Vous rencontrez un problème ? Partagez les détails avec nous en ouvrant un problème GitHub pour que nous puissions nous améliorer !
it: Si è verificato un problema? È possibile condividere i dettagli con microsoft aprendo un problema di GitHub per consentirci di migliorarlo.
pt_br: Está encontrando um problema? Compartilhe os detalhes conosco abrindo um problema do GitHub para que possamos melhorar!
ru: Возникла проблема? Поделитесь сведениями с нами, открыв проблему GitHub, чтобы мы могли улучшить ее!

# ++CODE++4f03bf1cdf8e7d1882e5198384139c078fa527857e7371ac6cb2d030dede15a3
source: Encrypt
es: Cifrar
fr: Chiffrer
it: Crittografa
ja: 暗号化する
pt_br: Criptografar
ru: Шифровать

# ++CODE++ac8fee089cebcddef6529d9c8b467120173dbd02a46992ecbaf62fe25c925ae0
source: Encryption was enabled on this connection; review your SSL and certificate configuration for the target SQL Server, or enable 'Trust server certificate' in the connection dialog.
es: Se habilitó el cifrado en esta conexión, revise la configuración de SSL y certificado para el SQL Server de destino o habilite "Confiar en el certificado de servidor" en el cuadro de diálogo de conexión.
fr: Le cryptage a été activé sur cette connexion, vérifiez la configuration de votre SSL et de votre certificat pour le Microsoft SQL Server cible, ou activez « Certificat de serveur de confiance » dans la boîte de dialogue de connexion ».
it: La crittografia è stata abilitata in questa connessione; esaminare la configurazione del certificato e SSL per l’SQL Server di destinazione o abilitare 'Considera attendibile il certificato del server' nella finestra di dialogo di connessione.
pt_br: A criptografia foi habilitada nesta conexão; examine sua configuração de SSL e certificado para o SQL Server de destino, ou habilite "Confiar no certificado do servidor" como "true" na caixa de diálogo de conexão.
ru: Для этого подключения включено шифрование. Просмотрите SSL и конфигурацию сертификата для целевого сервера SQL Server или включите параметр "Доверять сертификату сервера" в диалоговом окне подключения.

# ++CODE++a04452986b48c7c3c21f78712b31a68f2aecb85566c134d87d55348c7b16b9a8
source: Encryption was enabled on this connection; review your SSL and certificate configuration for the target SQL Server, or set 'Trust server certificate' to 'true' in the settings file. Note: A self-signed certificate offers only limited protection and is not a recommended practice for production environments. Do you want to enable 'Trust server certificate' on this connection and retry?
es: Se habilitó el cifrado en esta conexión, revise la configuración de SSL y certificado para el SQL Server de destino o establezca el "Certificado de servidor de confianza" en "true" el archivo de configuración. Nota: Un certificado autofirmado solo ofrece protección limitada y no es una práctica recomendada para entornos de producción. ¿Desea habilitar el "Certificado de servidor de confianza" en esta conexión y volver a intentarlo?
fr: Le cryptage a été activé sur cette connexion, vérifiez la configuration de votre SSL et de votre certificat pour le Microsoft SQL Server cible, ou définissez « Approuver le certificat de serveur » sur « true » dans le fichier des paramètres. Remarque : un certificat auto-signé n’offre qu’une protection limitée et n’est pas une pratique recommandée pour les environnements de production. Voulez-vous activer « Approuver le certificat de serveur » sur cette connexion et réessayer ?
it: La crittografia è stata abilitata in questa connessione; rivedere la configurazione SSL e del certificato per SQL Server di destinazione o impostare 'Certificato del server attendibile' su 'true' nel file delle impostazioni. Nota: un certificato autofirmato offre solo una protezione limitata e non è consigliato per gli ambienti di produzione. Abilitare 'Certificato del server attendibile' in questa connessione e riprovare?
pt_br: A criptografia foi habilitada nesta conexão; examine sua configuração de SSL e certificado para o SQL Server de destino, ou configure "Confiar no certificado do servidor" como "true" no arquivo de configurações. Observação: um certificado autoassinado oferece apenas proteção limitada e não é uma prática recomendada para ambientes de produção. Deseja habilitar "Confiar no certificado do servidor" nesta conexão e tentar novamente?
ru: Для этого подключения включено шифрование. Просмотрите SSL и конфигурацию сертификата для целевого сервера SQL Server или установите для параметра "Доверять сертификату сервера" значение "true" в файле настроек. Примечание. Самозаверяющий сертификат обеспечивает ограниченную защиту, и его не рекомендуется применять в производственных средах. Включить параметр "Доверять сертификату сервера" для этого подключения и повторить попытку?

# ++CODE++6051d2070e8e51a99adfa6b3f5171cfa92107943f46417bcd51a8f5e995c881f
source: End IP Address
es: Dirección IP final
fr: Adresse IP de fin
it: Indirizzo IP finale
ja: 終了 IP アドレス
pt_br: Endereço IP Final
ru: Конечный IP-адрес

# ++CODE++1a77d555bedbf97481907d505c8c8ba64d32d3525b77122e16178dd4054c3c93
source: Ends With
es: Termina con
fr: Se termine par
it: Termina con
ja: 次で終わる
pt_br: Termina Com
ru: Заканчивается на

# ++CODE++fc203569fa858e0ef3d2644e417247d162f933f5e91db77c913471844e2f3ced
source: Ends with
es: Termina en
it: Termina con
ru: Заканчивается на

# ++CODE++b8a643021b4a76524ae2ef4dad6de2ec180e23fd99ca204282cca599d43792f3
source: Enter Database Description
es: Escriba la descripción de la base de datos
it: Immettere la descrizione del database
ru: Введите описание базы данных

# ++CODE++9fe6b769c35efbcf43d8dcbfced2ae4a84372d540d787211cc31759ad50838f2
source: Enter Database Name
es: Escriba el nombre de la base de datos
it: Immettere il nome del database
ru: Введите имя базы данных
