Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++1cd65c404018fe0b10838ebb1d185bc820d942c2bab789cf9e0ed90db9bb6451
source: Switch to Text View ({0})
es: Cambiar a vista de texto ({0})
it: Passa alla visualizzazione Testo ({0})
ru: Переключиться на текстовое представление ({0})

# ++CODE++494731de200692139842ce40b55ca4e15ccb299d4d82b803ed1f0bd25ce82efd
source: Switching to Linux containers was canceled. SQL Server only supports Linux containers.
es: Se canceló el cambio a contenedores de Linux. SQL Server solo admite contenedores de Linux.
fr: Le basculement vers des conteneurs Linux a été annulé. SQL Server prend uniquement en charge les conteneurs Linux.
it: Il passaggio ai contenitori Linux è stato annullato. SQL Server supporta solo contenitori Linux.
ru: Переключение на контейнеры Linux отменено. SQL Server поддерживает только контейнеры с Linux.

# ++CODE++2550007022b2cb525a426176b9fd9615b9fac3cc51d6abd99ac96f59ea33ce3a
source: Synchronous resize
es: Cambio de tamaño sincrónico
it: Ridimensionamento sincrono
ru: Синхронное изменение размера

# ++CODE++16d1c9050a0b32e83764a81d801a880773abedfd7f8b0b08a1cd87ca0e404f12
source: Table
es: Tabla
it: Tabella
pt_br: Tabela
ru: Таблица

# ++CODE++e37d0b463100c4d709173a6502222535a4960da7c2ae4c1317ba1e20ece36b3e
source: Table '{0}' already exists
es: La tabla "{0}" ya existe.
fr: La table « {0} » existe déjà
it: La tabella '{0}' esiste già
pt_br: A tabela '{0}' já existe
ru: Таблица "{0}" уже существует

# ++CODE++ab3e7e5387cdfbb5043748e63a21b5da7a9855b47821b6a4e1bc17391a118e17
source: Table '{0}' not found
es: No se ha encontrado la tabla "{0}"
fr: Table « {0} » introuvable
it: Tabella '{0}' non trovata
pt_br: Tabela ''{0}'' não encontrada
ru: Таблица "{0}" не найдена

# ++CODE++73c42403ef2ca9fe32cd59cfbda8110671a5d4791783f5e6687cb7379d2f07f3
source: Table Explorer for '{0}' has unsaved changes. Do you want to save or discard them?
es: El explorador de tabla para '{0}' tiene cambios sin guardar. ¿Desea guardarlos o descartarlos?
it: Esplora tabelle per '{0}' contiene modifiche non salvate. Salvarle o rimuoverle?
ru: Обозреватель таблиц для "{0}" содержит несохраненные изменения. Сохранить или отменить их?

# ++CODE++529667eb9a218f074e24ec63181bb6b3bd4e5ea744e64f71262b6323251ed743
source: Table name
es: Nombre de tabla
fr: Nom de la table
it: Nome della tabella
ja: テーブル名
pt_br: Nome da tabela
ru: Имя таблицы

# ++CODE++45e1d4cb14359d2ad702451798500ccdf4e30f19c5fd15c378328cf83827d606
source: Table name cannot be empty
es: El nombre de la tabla no puede estar vacío
fr: Le nom de table ne peut pas être vide
it: Il nome della tabella non può essere vuoto
pt_br: O nome da tabela não pode ficar vazio
ru: Имя таблицы не может быть пустым

# ++CODE++9981cdae853624ee8dffbae9510a8f8b9d588788aab84587374f6dd6bc7eabdd
source: Take Survey
es: Realizar encuesta
fr: Répondre à une enquête
it: Partecipare al sondaggio
pt_br: Responder Pesquisa
ru: Пройти опрос

# ++CODE++978354db0c00fc78c3a5524f462a73bc425df3fb2767e51a5f46352ae26ae6f9
source: Target
es: Destino
fr: Cible
it: Destinazione
pt_br: Destino
ru: Целевой объект

# ++CODE++5b02abaa1e421efb6c10a960e3f128b0a641ea7cc47df22947c3f695cf1cb505
source: Target Database
es: Base de datos de destino
it: Database di destinazione
ru: Целевая база данных

# ++CODE++9ba1ac70c4386df695c803041aec395325f7f6cb8151ca597c9715b3f99262fb
source: Target Name
es: Nombre de destino
fr: Nom de la cible
it: Nome destinazione
pt_br: Nome do Destino
ru: Имя целевого объекта

# ++CODE++feeb64acb5e0f4ebba723e99d26d741bd2621988c8d355449bfddeafc8ef59e2
source: Target Table
es: Tabla de destino
fr: Table cible
it: Tabella di destinazione
pt_br: Tabela de Destino
ru: Целевая таблица

# ++CODE++de1f5fff34138660c31bd550e5da98b7674d852afbff6f517e0e222b2dbf09a9
source: Tenant ID
es: Id. de inquilino
fr: ID de locataire
it: ID tenant
ja: テナント ID
pt_br: ID do locatário
ru: Идентификатор клиента

# ++CODE++3db7232b2e9f0b74bad366312879cd89ee7bd3e6c5b737f358b7897907c6ab39
source: Tenant ID is required
es: Es necesario especificar el identificador del inquilino.
fr: L’ID de locataire est obligatoire
it: L'ID tenant è obbligatorio
ja: テナント ID が必要です
pt_br: É necessária a ID do locatário
ru: Требуется указать идентификатор клиента

# ++CODE++2af9bc0ac247853b98b854b657784c881cc649d3f1a660aafecd1b8b1a26d535
source: Terms & Conditions
es: Términos y condiciones
fr: Conditions générales
it: Termini e condizioni
ru: Условия

# ++CODE++c02977b07ec93816f236c57b4c30d4544904e87e0a43a1daf344c229594320b9
source: Test Connection
es: Prueba de conexión
fr: Tester la connexion
it: Verifica connessione
ja: テスト接続
pt_br: Testar Conexão
ru: Проверить подключение

# ++CODE++90c8505baad739c0925471e0d594ba9d83f84d3a96dbdfa16a47ae7a3ad95d91
source: Testing connection profile...
es: Probar el perfil de conexión...
fr: Test du profil de connexion...
it: Test del profilo di connessione in corso...
ja: 接続プロファイルをテストしています...
pt_br: Testando perfil de conexão...
ru: Тестируем профиль подключения…

# ++CODE++6243b7f10cf3bedbbad66a99c0cf540a52e5239c6ccf9db907be70c383d0ce7f
source: Text View
es: Vista de texto
fr: Affichage du texte
it: Visualizzazione Testo
ru: Текстовое представление

# ++CODE++acd64111965ff7af14fb0dc101deb52a5e3e7cfc6aae4d0fa9bf7a65ed37870a
source: The MSSQL for VS Code extension is introducing new modern data development features! Would you like to enable them? [Learn more]({0})
es: La extensión de MSSQL para VS Code presenta nuevas características modernas de desarrollo de datos. ¿Desea habilitarlas? [Más información]({0})
fr: L’extension MSSQL pour VS Code introduit de nouvelles fonctionnalités de développement de données modernes ! Voulez-vous les activer ? [Learn more]({0})
it: L'estensione MSSQL per VS Code introduce nuove funzionalità moderne per lo sviluppo di dati. Vuoi abilitarle? [Altre informazioni]({0})
pt_br: A extensão MSSQL para VS Code está introduzindo novos recursos modernos de desenvolvimento de dados! Deseja habilitá-los? [Saiba mais]({0})
ru: Расширение MSSQL для VS Code представляет новые современные функции разработки данных! Вы хотите включить их? [Подробнее]({0})

# ++CODE++3eacf5cf678e2285cae1276d29f034aa0e7ceb3f8940239c1d67a2d486649719
source: The behavior when a user tries to delete a row with data that is involved in a foreign key relationship.
es: Comportamiento cuando un usuario intenta eliminar una fila con datos que intervienen en una relación de clave externa.
fr: Le comportement lorsqu'un utilisateur tente de supprimer une ligne contenant des données impliquées dans une relation de clé étrangère.
it: Comportamento applicato quando un utente tenta di eliminare una riga contenente dati coinvolti in una relazione di chiave esterna.
ja: 外部キー リレーションシップに含まれるデータのある行をユーザーが削除しようとしたときの動作です。
pt_br: O comportamento quando um usuário tenta excluir uma linha com dados que estão envolvidos em um relacionamento de chave estrangeira.
ru: Поведение при попытке пользователя удалить строку с данными, участвующую в отношении по внешнему ключу.

# ++CODE++1a4205e9f5cc50eaf70719b64956352b74a99badba266027a6244def0d016b73
source: The behavior when a user tries to update a row with data that is involved in a foreign key relationship.
es: Comportamiento cuando un usuario intenta actualizar una fila con datos que intervienen en una relación de clave externa.
fr: Le comportement lorsqu'un utilisateur tente de mettre à jour une ligne avec des données impliquées dans une relation de clé étrangère.
it: Comportamento applicato quando un utente tenta di aggiornare una riga contenente dati che interessano una relazione di chiave esterna.
ja: 外部キー リレーションシップに含まれるデータのある行をユーザーが更新しようとしたときの動作です。
pt_br: O comportamento quando um usuário tenta atualizar uma linha com dados que estão envolvidos em uma relação com uma chave estrangeira.
ru: Поведение при попытке пользователя обновить строку с данными, участвующую в отношении по внешнему ключу.

# ++CODE++4002a5b20dd0c7a8caf9764ba024343e8f87e2ba8221aaeae4c5112d1d7bb4ed
source: The columns of the index.
es: Las columnas del índice.
fr: Les colonnes de l'index.
it: Colonne dell'indice.
ja: インデックスの列。
pt_br: As colunas do índice.
ru: Столбцы индекса.

# ++CODE++0104b69959544fb6f98a7e7723e2df4d657c581b43004a1e47f677a02589311e
source: The connection with ID '{0}' does not have the 'server' property set and is being ignored. Please set the 'server' property on this connection in order to use it.
es: La conexión con el identificador '{0}' no tiene establecida la propiedad 'server' y se omite. Establezca la propiedad "server" en esta conexión para usarla.
fr: La connexion avec l’ID « {0} » ne dispose pas de la propriété « server » définie et elle est ignorée. Veuillez définir la propriété « server » sur cette connexion pour pouvoir l’utiliser.
it: La connessione con ID '{0}' non contiene la proprietà 'server' impostata e verrà ignorata. Impostare la proprietà 'server' su questa connessione per utilizzarla.
ru: Для подключения с идентификатором "{0}" не задано свойство "server", и оно игнорируется. Задайте свойство "server" для этого подключения, чтобы использовать его.

# ++CODE++90a4ba6d5483f640dbf83e90ca81103b564ff6be1e78dc9caf91eea1c299757e
source: The custom cloud choice is not configured. Please configure the setting `{0}`.
es: No se ha configurado la opción de nube personalizada. Configure el valor "{0}".
it: La scelta del cloud personalizzato non è configurata. Configurare l'impostazione `{0}`.
ru: Выбор пользовательского облака не настроен. Настройте параметр "{0}".

# ++CODE++f229c94b4c9b8ecfa1096d1daf79194e84616c49df8fb6e229fa944592ff373e
source: The description of the check constraint.
es: Descripción de la restricción CHECK.
fr: La description de la contrainte de vérification.
it: Descrizione del vincolo CHECK.
ja: CHECK 制約の説明。
pt_br: Descrição da restrição CHECK.
ru: Описание проверочного ограничения.

# ++CODE++f307f68f2f552562e371f39fe52ef5b9f6eba2e13a61cd2d1e560e9991b86114
source: The description of the foreign key.
es: Descripción de la clave externa.
fr: Description de la clé étrangère.
it: Descrizione della chiave esterna.
ja: 外部キーの説明。
pt_br: A descrição da chave estrangeira.
ru: Описание внешнего ключа.

# ++CODE++48e857284768923e885f8631cb33e52313c21cd97d4b95b651b1b5227789cfa0
source: The description of the index.
es: Descripción del índice.
fr: La description de l'index.
it: Descrizione dell'indice.
ja: インデックスの説明。
pt_br: A descrição do índice.
ru: Описание индекса.

# ++CODE++4ed30ce390b4a87aa521240a8313735faff4c4cb4df0c01292ffdaf5b9a44c58
source: The description of the primary key.
es: Descripción de la clave principal.
fr: La description de la clé primaire.
it: Descrizione della chiave primaria.
ja: 主キーの説明。
pt_br: A descrição da chave primária.
ru: Описание первичного ключа.

# ++CODE++ff83ab307bf5543897d2c5781d880385ba86a704904fb08dc5c67c990688d5ec
source: The expression defining the check constraint.
es: Expresión que define la restricción CHECK.
fr: L'expression définissant la contrainte de vérification.
it: Espressione che definisce il vincolo CHECK.
ja: CHECK 制約を定義する式です。
pt_br: A expressão que define a restrição CHECK.
ru: Выражение, определяющее проверочное ограничение.

# ++CODE++dcf10fd537a0660c98f1a3890997024dfebb2ac795ee02dcbc7581ec4a0fe141
source: The extension '{0}' is requesting access to your SQL Server connections. This will allow it to execute queries and access your database.
es: La extensión '{0}' está solicitando acceso a sus conexiones de SQL Server. Esto le permitirá ejecutar consultas y acceder a su base de datos.
fr: L’extension « {0} » demande actuellement l’accès à vos connexions SQL Server. Cela lui permettra d’exécuter des requêtes et d’accéder à votre base de données.
it: L'estensione "{0}" richiede l'accesso alle tue connessioni di SQL Server. In questo modo, potrà eseguire query e accedere al tuo database.
ru: Расширение "{0}" запрашивает доступ к вашим подключениям SQL Server. Это позволит ему выполнять запросы и получать доступ к вашей базе данных.

# ++CODE++d160b49baa7c6e4e8b95a21a984b19fda338b9d47a01d61c2d7445ed29cf174e
source: The first value must be less than the second value for the {0} operator in the {1} filter
es: El primer valor debe ser menor que el segundo valor para el operador {0} en el filtro {1}
fr: La première valeur doit être inférieure à la deuxième valeur de l'opérateur {0} dans le filtre {1}
it: Il primo valore deve essere minore del secondo per l'operatore {0} nel filtro {1}
ja: 最初の値は、{1} フィルターの {0} 演算子の 2 番目の値より小さくする必要があります
pt_br: O primeiro valor deve ser menor que o segundo valor para o operador {0} no filtro {1}
ru: Первое значение должно быть меньше второго значения оператора {0} в фильтре {1}

# ++CODE++10dc5228a8a16a8eb753ca437fd81cd632ca4b12be41a33403e6614e46c4167e
source: The first value must be set for the {0} operator in the {1} filter
es: Se debe establecer el primer valor para el operador {0} en el filtro {1}
fr: La première valeur doit être définie pour l'opérateur {0} dans le filtre {1}
it: È necessario impostare il primo valore per l'operatore {0} nel filtro {1}
ja: {1} フィルターの {0} 演算子に最初の値を設定する必要があります
pt_br: O primeiro valor deve ser definido para o operador {0} no filtro {1}
ru: Необходимо задать первое значение для оператора {0} в фильтре {1}

# ++CODE++9f0bbf0f3fc1ec45ca02debcaf080ecd6f40e8a11bae6e0189136badee4946a7
source: The following workspace or workspace folder connections are missing the 'id' property and are being ignored. Please manually add the 'id' property to the connection in order to use it. {0}
es: A las siguientes conexiones de área de trabajo o carpeta del área de trabajo les falta la propiedad "id" y se omiten. Agregue manualmente la propiedad "id" a la conexión para usarla. {0}
fr: La propriété « id » est manquante dans les connexions d’espace de travail ou de dossier d’espace de travail suivantes qui sont ignorées. Veuillez ajouter manuellement la propriété « id » à la connexion pour pouvoir l’utiliser. {0}
it: Le seguenti connessioni all'area di lavoro o alle cartelle dell'area di lavoro non contengono la proprietà 'id' e vengono ignorate. Aggiungere manualmente la proprietà 'id' alla connessione per utilizzarla. {0}
ru: Следующие подключения к рабочей области или папке рабочей области не содержат свойства "id" и игнорируются. Вручную добавьте свойство "id" к подключению, чтобы использовать его. {0}

# ++CODE++0f98888ce39572ae27e642dd46baba8dbf179c6b3c42c522cde8ad1f43323b11
source: The language model did not return any output.
es: El modelo de lenguaje no devolvió ningún resultado.
fr: Le modèle de langage n’a retourné aucune sortie.
it: Il modello linguistico non ha restituito output.
ru: Языковая модель не вернула никакого результата.

# ++CODE++fcd9241097659a9ae58a06bd9b762b5aded99a3f82d97e73e75279b098e00c6d
source: The mapping between foreign key columns and primary key columns.
es: Asignación entre las columnas de la clave externa y las de la clave principal.
fr: Le mappage entre les colonnes de clé étrangère et les colonnes de clé primaire.
it: Mapping tra colonne chiave esterna e colonne chiave primaria.
ja: 外部キー列と主キー列の間のマッピング。
pt_br: O mapeamento entre colunas de chave estrangeira e colunas de chave primária.
ru: Сопоставление столбцов внешних ключей и столбцов первичных ключей.

# ++CODE++ee33dcb49174e212fabe894df8373991cebe8d617d56b472934c7dcea6335b5b
source: The maximum length (in characters) that can be stored in this database object.
es: Longitud máxima (en caracteres) que se puede almacenar en este objeto de base de datos.
fr: La longueur maximale (en caractères) qui peut être stockée dans cet objet de base de données.
it: Lunghezza massima (in caratteri) che è possibile archiviare in questo oggetto di database.
ja: このデータベース オブジェクトに格納できる最大長 (文字数) です。
pt_br: O comprimento máximo (em caracteres) que pode ser armazenado neste objeto de banco de dados.
ru: Максимальная длина значения (в символах), которое можно хранить в этом объекте базы данных.

# ++CODE++c368a965891e9479b44218cb42c8cddde404740e364b53367e897dcb17ef1d6b
source: The name of the check constraint.
es: Nombre de la restricción CHECK.
fr: Nom de la contrainte de validation.
it: Nome del vincolo CHECK.
ja: CHECK 制約の名前。
pt_br: O nome da restrição CHECK.
ru: Имя проверочного ограничения.

# ++CODE++1f1828f6aa124ec76ef4d972c0dc128052fd3b8b5fa4cefd9d560695e878ecf8
source: The name of the column object.
es: El nombre del objeto de la columna.
fr: Le nom de l'objet colonne.
it: Il nome dell’oggetto colonna.
ja: 列オブジェクトの名前です。
pt_br: O nome do objeto de coluna.
ru: Имя объекта столбца.

# ++CODE++4b7c298367264cb30b7b914a70b1a21e86cc7685024ae618a0d0cf43626afe54
source: The name of the column.
es: El nombre de la columna.
fr: Le nom de la colonne.
it: Il nome della colonna.
ja: 列の名前です。
pt_br: O nome da coluna.
ru: Имя столбца.

# ++CODE++20b946c00bb4f007424d33a637029256f737bb0ff32c7de3b2a189e4423a4ec9
source: The name of the foreign key.
es: Nombre de la clave externa.
fr: Nom de la clé étrangère.
it: Nome della chiave esterna.
ja: 外部キーの名前です。
pt_br: O nome da chave estrangeira.
ru: Имя внешнего ключа.

# ++CODE++644a28f160d2df093fab1a8c94e5176f21c1af3bee1915315edd409d14397021
source: The name of the index.
es: Nombre del índice.
fr: Nom de l'index.
it: Nome dell'indice.
ja: インデックスの名前です。
pt_br: O nome do índice.
ru: Имя индекса.

# ++CODE++13549c97f0b3baa43655bd41e05e3bb60918ded05df9e7e94186ecc6ba53c3d1
source: The recent connections list has been cleared but there were errors while deleting some associated credentials. View the errors in the MSSQL output channel.
es: La lista de conexiones recientes se ha borrado, pero se produjeron errores mientras se eliminaban algunas credenciales asociadas. Vea los errores en el canal de salida de MSSQL.
fr: La liste des connexions récentes a été effacée, mais des erreurs se sont produites lors de la suppression de certaines informations d’identification associées. Affichez les erreurs dans le canal de sortie MSSQL.
it: L'elenco delle connessioni recenti è stato cancellato, ma si sono verificati degli errori nell'eliminazione di alcune credenziali associate. Visualizzare gli errori nel canale di output MSSQL.
ja: 最近の接続の一覧はクリアされましたが、関連付けられている資格情報の削除中にエラーが発生しました。MSSQL 出力チャネルのエラーを表示します。
pt_br: A lista de conexões recentes foi limpa, mas ocorreram erros ao excluir algumas credenciais associadas. Visualize os erros no canal de saída do MSSQL.
ru: Список последних подключений был очищен, но при удалении некоторых связанных с ним учетных данных возникли ошибки. Просмотрите ошибки в канале выдачи MSSQL.

# ++CODE++deb45b7a599eba6e761de31bae73238f9ec60e62517a88c934b81cb6743fcfbb
source: The requested model could not be found. Please check model availability or try a different model.
es: No se puede encontrar el modelo solicitado. Verifique la disponibilidad del modelo o pruebe con otro.
fr: Le modèle demandé est introuvable. Veuillez vérifier la disponibilité du modèle ou essayez un autre modèle.
it: Non è stato possibile trovare il modello richiesto. Controllare la disponibilità del modello o provare un modello diverso.
ru: Не удалось найти запрошенную модель. Проверьте доступность модели или попробуйте использовать другую.

# ++CODE++ea13943c4f06ddf0a81173991d20e8cf8252b636b94c0c2476e58098d9fbc1f3
source: The second value must be set for the {0} operator in the {1} filter
es: Se debe establecer el segundo valor para el operador {0} en el filtro {1}
fr: La deuxième valeur doit être définie pour l'opérateur {0} dans le filtre {1}
it: È necessario impostare il secondo valore per l'operatore {0} nel filtro {1}
ja: {1} フィルターの {0} 演算子に 2 番目の値を設定する必要があります
pt_br: O segundo valor deve ser definido para o operador {0} no filtro {1}
ru: Необходимо задать второе значение для оператора {0} в фильтре {1}

# ++CODE++d7f9cfdbfc45384b7521ed4b8082d476a2d3cae5cbb8c57eec64003513cacbf2
source: The table which contains the primary or unique key column.
es: Tabla que contiene la columna de clave principal o única.
fr: La table qui contient la colonne de clé primaire ou unique.
it: Tabella contenente la colonna chiave univoca o primaria.
ja: 主キー列または一意キー列を含むテーブルです。
pt_br: A tabela que contém a coluna de chave primária ou exclusiva.
ru: Таблица, которая содержит первичный или уникальный ключевой столбец.

# ++CODE++fe68202651f2e6c4af304386d80e491e5c52755db829443bb2cefbf2b25df757
source: There was an error updating the project
es: Error al actualizar el proyecto
fr: Une erreur s’est produite lors de la mise à jour du projet
it: Errore durante l'aggiornamento del progetto
pt_br: Ocorreu um erro ao atualizar o projeto
ru: Ошибка при обновлении проекта

# ++CODE++2dfd619510d128a32109e18f1206eb1170ff96be2c7672f8f2f9541f6e28391d
source: This connection does not have a display name in Azure Data Studio.
it: Questa connessione non ha un nome visualizzato in Azure Data Studio.
ru: У этого подключения нет отображаемого имени в Azure Data Studio.

# ++CODE++ba00b52adf9dcec97ed54898b307de1328526c8df30c80a9a17dc41f6c39a926
source: This connection's group has not been selected, so this connection will be imported to the root.
it: Il gruppo di questa connessione non è stato selezionato, quindi la connessione verrà importata nella radice.

# ++CODE++a616eb2bf2f817c4898b6d9709fa799bf564dc58ec7bdb879358e3f47795106e
source: This database name is already in use. Please choose a different name.
es: El nombre de esta base de datos ya está en uso. Elija otro nombre.
it: Questo nome di database è già in uso. Scegliere un nome diverso.
ru: Это имя базы данных уже используется. Выберите другое имя.

# ++CODE++28e2aa59c50b2de24bda79539297a180c3ea379c3aa11b5af049a2cf66375999
source: This message couldn't be processed. If this issue persists, please check the logs and open an issue on GitHub.
es: No se pudo procesar este mensaje. Si el problema persiste, compruebe los registros y abra un problema en GitHub.
it: Non è stato possibile elaborare il messaggio. Se il problema persiste, controllare i log e aprire un ticket su GitHub.
ru: Не удалось обработать это сообщение. Если проблема сохранится, проверьте журналы и сообщите о проблеме на GitHub.

# ++CODE++680b3510100d0d19288133607ee876d6e1928b0e0f6e0de1afd08a9aa88f55f2
source: This value was not provided in the Azure Data Studio settings file.
it: Questo valore non è stato specificato nel file di impostazioni di Azure Data Studio.
ru: Это значение не указано в файле параметров Azure Data Studio.

# ++CODE++94843fe76f0c666e2bce801eb3dbfa672cd6517a14f968c8e41669c580b60cb3
source: To compare two schemas, first select a source schema and target schema, then press compare.
es: Para comparar dos esquemas, seleccione primero un esquema de origen y un esquema de destino y, a continuación, presione Comparar.
fr: Pour comparer deux schémas, sélectionnez d’abord un schéma source et un schéma cible, puis appuyez sur comparer.
it: Per confrontare due schemi, seleziona prima lo schema di origine e quello di destinazione, quindi premi Confronta.
pt_br: Para comparar dois esquemas, primeiro selecione um esquema de origem e um esquema de destino e, em seguida, pressione Comparar.
ru: Чтобы сравнить две схемы, сначала выберите исходную и целевую схемы, а затем нажмите кнопку "Сравнить".

# ++CODE++500066c85e5ad619476a8235df0b22c1d1cb23a1104f6d78c0353a03f797a18d
source: To continue, run SQL Server on a machine with a supported processor. Check
es: Para continuar, ejecute SQL Server en una máquina con un procesador compatible. Comprobar
it: Per continuare, eseguire SQL Server su un computer con un processore supportato. Controlla
ru: Чтобы продолжить, запустите SQL Server на компьютере с поддерживаемым процессором. Проверить
