Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# mssql.customEnvironment.dynamicsCrmDnsSuffix
source: Sovereign cloud equivalent for `.crm.dynamics.com` (including leading dot)
es: Equivalente en nube soberana para ".crm.dynamics.com" (incluido el punto inicial)
it: Equivalente cloud sovrano per ''.crm.dynamics.com'' (incluso il punto iniziale)
ru: Эквивалент национального облака для ".crm.dynamics.com" (включая начальную точку)

# mssql.customEnvironment.fabricSqlDbDnsSuffix
source: Sovereign cloud equivalent for `.database.fabric.microsoft.com` (including leading dot)
es: Equivalente en nube soberana de ".database.fabric.microsoft.com" (incluido el punto inicial)
it: Equivalente di Sovereign Cloud per `.database.fabric.microsoft.com` (incluso il punto iniziale)
ru: Эквивалент национального облака для ".database.fabric.microsoft.com" (включая начальную точку)

# mssql.customEnvironment.sqlServerHostnameSuffix
source: Sovereign cloud equivalent for `.database.windows.net` (including leading dot)
es: Equivalente en nube soberana de ".database.windows.net" (incluido el punto inicial)
it: Equivalente di Sovereign Cloud per `.database.windows.net` (incluso il punto iniziale)
ru: Эквивалент национального облака для ".database.windows.net" (включая начальную точку)

# mssql.customEnvironment.fabricDataWarehouseDnsSuffix
source: Sovereign cloud equivalent for `.datawarehouse.fabric.microsoft.com` (including leading dot)
es: Equivalente en nube soberana de ".datawarehouse.fabric.microsoft.com" (incluido el punto inicial)
it: Equivalente di Sovereign Cloud per `.datawarehouse.fabric.microsoft.com` (incluso il punto iniziale)
ru: Эквивалент национального облака для ".datawarehouse.fabric.microsoft.com" (включая начальную точку)

# mssql.customEnvironment.analyticsDnsSuffix
source: Sovereign cloud equivalent for `.sql.azuresynapse.net` (including leading dot)
es: Equivalente en nube soberana de ".sql.azuresynapse.net" (incluido el punto inicial)
it: Equivalente di Sovereign Cloud per `.sql.azuresynapse.net` (incluso il punto iniziale)
ru: Эквивалент национального облака для ".sql.azuresynapse.net" (включая начальную точку)

# mssql.customEnvironment.fabricScopeUriBase
source: Sovereign cloud equivalent for `https://analysis.windows.net/powerbi/api/`
es: Equivalente en nube soberana de "https://analysis.windows.net/powerbi/api/"
it: Equivalente di Sovereign Cloud per `https://analysis.windows.net/powerbi/api/`
ru: Эквивалент национального облака для "https://analysis.windows.net/powerbi/api/"

# mssql.customEnvironment.fabricApiUriBase
source: Sovereign cloud equivalent for `https://api.fabric.microsoft.com/v1/`
es: Equivalente en nube soberana de "https://api.fabric.microsoft.com/v1/"
it: Equivalente di Sovereign Cloud per `https://api.fabric.microsoft.com/v1/`
ru: Эквивалент национального облака для "https://api.fabric.microsoft.com/v1/"

# mssql.customEnvironment.sqlEndpoint
source: Sovereign cloud equivalent for `https://database.windows.net/`
es: Equivalente en nube soberana de "https://database.windows.net/"
it: Equivalente di Sovereign Cloud per `https://database.windows.net/`
ru: Эквивалент национального облака для "https://database.windows.net/"

# mssql.customEnvironment.keyVaultEndpoint
source: Sovereign cloud equivalent for `https://vault.azure.net/`
es: Equivalente en nube soberana de "https://vault.azure.net/"
it: Equivalente di Sovereign Cloud per `https://vault.azure.net/`
ru: Эквивалент национального облака для "https://vault.azure.net/"

# mssql.startContainer
source: Start Container
es: Iniciar contenedor
fr: Démarrer le conteneur
it: Avvia contenitore
ru: Запустить контейнер

# mssql.startQueryHistoryCapture
source: Start Query History Capture
es: Iniciar la captura del historial de consultas
fr: Démarrer la capture de l’historique des requêtes
it: Avvia acquisizione cronologia delle query
ja: Query History キャプチャの開始
pt_br: Iniciar a Captura do Histórico de Consultas
ru: Начать ведение журнала запросов

# mssql.stopContainer
source: Stop Container
es: Detener contenedor
fr: Arrêter le conteneur
it: Arresta contenitore
ru: Остановить контейнер

# mssql.walkthroughs.getStarted.createNewTable.altText
source: Table Designer
es: Diseñador de tablas
fr: Concepteur de tables
it: Progettazione tabelle
pt_br: Designer de Tabela
ru: Конструктор таблиц

# mssql.connectionManagement.rememberPasswordsUntilRestart
source: Temporarily store passwords for connections with 'Saved Passwords' disabled, until the extension is restarted. This prevents repeated password prompts when reusing connections within the same session.
es: Almacene temporalmente las contraseñas de las conexiones con la opción "Contraseñas guardadas" deshabilitada, hasta que se reinicie la extensión. Esto evita que se repitan las solicitudes de contraseña al reutilizar las conexiones dentro de la misma sesión.
fr: Stockez temporairement les mots de passe pour les connexions avec « Mots de passe enregistrés » désactivés, jusqu’au redémarrage de l’extension. Cela évite les invites de mot de passe répétées lors de la réutilisation des connexions au sein de la même session.
it: Memorizza temporaneamente le password per le connessioni con 'Password salvate' disabilitate, fino al riavvio dell'estensione. Ciò evita richieste ripetute di password quando si riutilizzano le connessioni all'interno della stessa sessione.
ru: Временное хранение паролей для подключений с отключенным параметром "Сохраненные пароли" до перезапуска расширения. Это дает возможность исключить повторные запросы паролей при многократном использовании подключений в рамках одного и того же сеанса.

# mssql.customEnvironment
source: The additional, MSSQL-specific custom configuration for the Sovereign Cloud to use with the Microsoft Sovereign Cloud authentication provider. This along with setting `microsoft-sovereign-cloud.environment` to `custom` and providing values for `microsoft-sovereign-cloud.customEnvironment` is required to use this feature with MSSQL.
es: La configuración personalizada adicional específica para MSSQL de la nube soberana que se va a usar con el proveedor de autenticación de Microsoft Sovereign Cloud. Esto, además de configurar "microsoft-sovereign-cloud.environment" en "custom" y proporcionar valores para "microsoft-sovereign-cloud.customEnvironment", es necesario para usar esta función con MSSQL.
it: La configurazione aggiuntiva e personalizzata specifica di MSSQL per il cloud sovrano da usare con il provider di autenticazione Microsoft Sovereign Cloud. Per usare questa funzionalità con MSSQL, è necessario impostare `microsoft-sovereign-cloud.environment` su `custom` e fornire i valori per `microsoft-sovereign-cloud.customEnvironment`.
ru: Дополнительная пользовательская конфигурация (конкретно для MSSQL) национального облака с целью использования с поставщиком проверки подлинности Microsoft Sovereign Cloud. Для использования этой функции с MSSQL необходимо настроить для "microsoft-sovereign-cloud.environment" значение "custom" и предоставить значения для "microsoft-sovereign-cloud.customEnvironment".

# mssql.connectionGroup.color
source: The color of the connection group.
es: Color del grupo de conexiones.
fr: Couleur du groupe de connexion.
it: Colore del gruppo di connessione.
pt_br: A cor do grupo de conexão.
ru: Цвет группы подключений.

# mssql.connectionGroup.description
source: The description of the connection group.
es: Descripción del grupo de conexiones.
fr: Description du groupe de connexion.
it: Descrizione del gruppo di connessione.
pt_br: Descrição do estado da conexão.
ru: Описание группы подключений.

# mssql.statusBar.connectionInfoMaxLength.description
source: The maximum number of characters to display for the connection info in the status bar. Set to -1 for no limit.
es: Número máximo de caracteres que se mostrarán para la información de conexión en la barra de estado. Establezca -1 para no tener límite.
fr: Le nombre maximal de caractères à afficher pour les informations de connexion dans la barre d’état. Définissez sur -1 pour aucune limite.
it: Numero massimo di caratteri da visualizzare per le informazioni di connessione nella barra di stato. Impostare su -1 per non impostare alcun limite.
ru: Максимальное количество символов, отображаемое для информации о подключении в строке состояния. Установите значение -1, чтобы отменить ограничения.

# mssql.maxRecentConnections
source: The maximum number of recently used connections to store in the connection list.
es: Número máximo de conexiones usadas recientemente que se van a almacenar en la lista de conexiones.
fr: Nombre maximal de connexions récemment utilisées à stocker dans la liste de connexions.
it: Numero massimo di connessioni usate di recente da archiviare nell'elenco delle connessioni.
ja: 接続リストに格納する最近使用された接続の最大数。
pt_br: O número máximo de conexões usadas recentemente para armazenar na lista de conexões.
ru: Максимальное количество недавно использованных подключений для хранения в списке подключений.

# mssql.connectionGroup.name
source: The name of the connection group.
es: Nombre del grupo de conexiones.
fr: Nom du groupe de connexion.
it: Nome del gruppo di connessione.
pt_br: O nome do Grupo de Conexão.
ru: Имя группы подключений.

# mssql.objectExplorer.expandTimeout
source: The timeout in seconds for expanding a node in Object Explorer. The default value is 45 seconds.
es: Tiempo de espera en segundos para expandir un nodo en Explorador de objetos. El valor predeterminado es 45 segundos.
fr: Délai d’expiration en secondes pour le développement d’un nœud dans l’Explorateur d’objets. La valeur par défaut est 45 secondes.
it: Timeout in secondi per l'espansione di un nodo in Esplora oggetti. Il valore predefinito è 45 secondi.
ja: オブジェクト エクスプローラーでノードを展開する場合のタイムアウト (秒)。既定値は 45 秒です。
pt_br: O tempo limite em segundos para expandir um nó no Pesquisador de Objetos. O valor padrão é 45 segundos.
ru: Время ожидания в секундах развертывания узла в обозревателе объектов. Значение по умолчанию — 45 секунд.

# mssql.connection.groupId
source: The unique identifier for the connection group this connection profile belongs to.
es: Identificador único del grupo de conexiones al que pertenece este perfil de conexión.
fr: Identificateur unique du groupe de connexion auquel ce profil de connexion appartient.
it: Identificatore univoco per il gruppo di connessione a cui appartiene questo profilo di connessione.
pt_br: O identificador exclusivo do grupo de conexão ao qual esse perfil de conexão pertence.
ru: Уникальный идентификатор группы подключений, к которой относится этот профиль подключения.

# mssql.connectionGroup.id
source: The unique identifier for the connection group.
es: Identificador único del grupo de conexiones.
fr: Identificateur unique pour ce groupe de connexion.
it: Identificatore univoco per il gruppo di connessione.
pt_br: O identificador exclusivo do grupo de conexão.
ru: Уникальный идентификатор группы подключений.

# mssql.connectionGroup.parentId
source: The unique identifier for the parent connection group.
es: Identificador único del grupo de conexiones primario.
fr: Identificateur unique pour le groupe de connexion parent.
it: Identificatore univoco per il gruppo di connessione padre.
pt_br: O identificador exclusivo do grupo de conexões pai.
ru: Уникальный идентификатор родительской группы подключений.

# mssql.connection.id
source: The unique identifier for this connection profile.
es: Identificador único de este perfil de conexión.
fr: Identificateur unique pour ce profil de connexion.
it: Identificatore univoco per questo profilo di connessione.
pt_br: O identificador exclusivo desse perfil de conexão.
ru: Уникальный идентификатор этого профиля подключения.

# mssql.legacySetting.deprecationMessage
source: This setting will be removed in a future release.
es: Esta configuración se quitará en una versión futura.
fr: Ce paramètre sera supprimé dans une mise en production ultérieure.
it: Questa impostazione verrà rimossa in una versione futura.
ru: Этот параметр будет удален в будущем выпуске.

# mssql.toggleSqlCmd
source: Toggle SQLCMD Mode
es: Alternar modo SQLCMD
fr: Activer/désactiver le mode SQLCMD
it: Attiva/Disattiva modalità SQLCMD
ja: SQLCMD モードの切り替え
pt_br: Ativar/desativar Modo SQLCMD
ru: Переключение режима SQLCMD

# mssql.messagesDefaultOpen
source: True for the messages pane to be open by default; false for closed
es: True para que el panel de mensajes se abra de forma predeterminada; false para que esté cerrado.
fr: « True » pour ouvrir par défaut le volet de messages, « false » pour le fermer
it: True per aprire il riquadro messaggi per impostazione predefinita; false per non aprirlo
ja: 既定で開いているメッセージ ウィンドウの場合は true。閉じている場合は false
pt_br: True para o painel de mensagens ser aberto por padrão; false para ser fechado
ru: Если указать значение TRUE, панель сообщения по умолчанию будет открыта, если указать значение FALSE — закрыта.

# mssql.walkthroughs.nextSteps.viewQueryPlan.description
source: Understand what your query is doing by viewing the query plan. See the estimated plan without running the query, or view the actual query plan after running the query by toggling the buttons at the top of a query editor window.
es: Comprenda qué está haciendo su consulta viendo el plan de consulta. Vea el plan estimado sin ejecutar la consulta, o vea el plan de consulta real después de ejecutar la consulta alternando los botones en la parte superior de la ventana del editor de consultas.
fr: Découvrez ce que votre requête effectue en affichant le plan de requête. Consultez le plan estimé sans exécuter la requête, ou consultez le plan de requête réel après exécution de la requête en activant ou désactivant les boutons en haut d’une fenêtre de l’éditeur de requête.
it: Comprendi cosa sta facendo la tua query visualizzando il piano di query. Visualizza il piano stimato senza eseguire la query oppure visualizza il piano di query effettivo dopo aver eseguito la query attivando o disattivando i pulsanti nella parte superiore della finestra dell'editor di query.
pt_br: Entenda o que sua consulta está fazendo visualizando o plano de consulta. Confira o plano estimado sem executar a consulta ou visualize o plano de consulta real após executá-la alternando os botões na parte superior da janela do editor de consultas.
ru: Просмотрите план запроса, чтобы понять, что делает этот запрос. Чтобы увидеть предполагаемый план без выполнения запроса или фактический план запроса после его выполнения, переключите кнопки в верхней части окна редактора запросов.

# mssql.chooseDatabase
source: Use Database
es: Usar la base de datos
fr: Utiliser la base de données
it: Usa database
ja: データベースの使用
pt_br: Usar Banco de Dados
ru: Использовать базу данных

# mssql.resultsGrid.useHeaderAndDataEnumDescription
source: Use column headers and data to size columns automatically
es: Usar encabezados y datos de columna para ajustar el tamaño de las columnas automáticamente
it: Usa intestazioni di colonna e dati per ridimensionare automaticamente le colonne
ru: Использовать заголовки столбцов и данные для автоматического определения размера столбцов

# mssql.resultsGrid.useHeaderOnlyEnumDescription
source: Use only column headers to size columns automatically
es: Usar solo encabezados de columna para ajustar el tamaño de las columnas automáticamente
it: Usa solo le intestazioni di colonna per ridimensionare automaticamente le colonne
ru: Использовать только заголовки столбцов для автоматического определения размера столбцов

# mssql.resultsGrid.useDataOnlyEnumDescription
source: Use only row data to size columns automatically
es: Usar solo datos de fila para ajustar el tamaño de las columnas automáticamente
it: Usa solo i dati delle righe per ridimensionare automaticamente le colonne
ru: Использовать только строковые данные для автоматического определения размера столбцов

# mssql.walkthroughs.nextSteps.viewQueryPlan.title
source: Visualize a Query Plan
es: Visualización de un plan de consulta
fr: Visualiser un plan de requête
it: Visualizza un piano di query
pt_br: Visualizar um Plano de Consulta
ru: Визуализировать план запроса

# mssql.statusBar.enableConnectionColor
source: When enabled, colorizes the connection status bar item with the color of the connection group. This setting is disabled by default. This uses the connection group folder's color directly, and does not alter it in order to ensure contrast with the current VS Code theme. Users should choose connection group colors that work well with their theme.
es: Cuando se habilita, colorea el elemento de la barra de estado de la conexión con el color del grupo de conexión. Esta configuración está deshabilitada de forma predeterminada. Esto usa el color de la carpeta del grupo de conexiones directamente y no lo modifica para garantizar el contraste con el tema VS Code actual. Los usuarios deben elegir colores del grupo de conexiones que funcionen bien con su tema.
fr: Lorsque cette option est activée, elle colorise l'élément de la barre d'état de connexion avec la couleur du groupe de connexions. Ce paramètre est désactivé par défaut. Cette option utilise directement la couleur du dossier du groupe de connexions et ne la modifie pas afin de garantir un contraste avec le thème actuel de VS Code. Les utilisateurs doivent choisir des couleurs de groupe de connexions qui s'harmonisent bien avec leur thème.
it: Se l'opzione è abilitata, colora l'elemento della barra di stato della connessione con il colore del gruppo di connessione. Questa opzione è disabilitata per impostazione predefinita. Usa direttamente il colore della cartella del gruppo di connessioni e non lo modifica per garantire il contrasto con il tema attuale di VS Code. Gli utenti devono scegliere colori del gruppo di connessione che si abbinano bene al tema.
ru: Если включено, элемент строки состояния подключения окрашивается в цвет группы подключений. Этот параметр по умолчанию отключен. Цвет папки группы подключений используется напрямую и не изменяется, чтобы обеспечить контрастность с текущей темой VS Code. Пользователям следует выбирать цвета группы подключений, которые хорошо сочетаются с их темой.

# mssql.objectExplorer.collapseConnectionGroupsOnStartupDescription
source: When enabled, connection groups will be collapsed instead of expanded at startup.
es: Cuando se habilita, los grupos de conexiones se contraerán en lugar de expandirse al inicio.
it: Se questa opzione è abilitata, i gruppi di connessione verranno compressi anziché espansi all'avvio.
ru: Если включено, группы подключений будут свернуты вместо развертывания при запуске.

# mssql.objectExplorer.groupBySchema
source: When enabled, the database objects in Object Explorer will be categorized by schema.
es: Cuando se habilita, los objetos de base de datos del Explorador de objetos se clasificarán por esquema.
fr: Lorsque cette option est activée, les objets de base de données dans l’Explorateur d’objets sont classés par schéma.
it: Se questa opzione è abilitata, gli oggetti di database in Esplora oggetti verranno categorizzati in base allo schema.
ja: 有効にすると、オブジェクト エクスプローラー内のデータベース オブジェクトがスキーマ別に分類されます。
pt_br: Quando habilitados, os objetos de banco de dados no Pesquisador de Objetos serão categorizados por esquema.
ru: Если этот параметр включен, объекты базы данных в обозревателе объектов будут классифицированы по схеме.

# mssql.objectExplorer.Tooltip.WindowsAuthLabel
source: Windows Authentication
es: Autenticación de Windows
it: Autenticazione di Windows
ru: Проверка подлинности Windows

# mssql.walkthroughs.getStarted.runQueries.description
source: Write a SQL query, and run it against your database. You can also click the 'Open in New Tab' button to view your query results in their own tab, and optionally set that as the default behavior.
es: Escriba una consulta SQL y ejecútela en la base de datos. También puedes hacer clic en el botón 'Abrir en nueva pestaña' para ver los resultados de su consulta en su propia pestaña y, opcionalmente, establecerlo como comportamiento predeterminado.
fr: Écrivez une requête SQL et exécutez-la sur votre base de données. Vous pouvez également cliquer sur le bouton « Ouvrir dans un nouvel onglet » pour afficher les résultats de votre requête dans leur propre onglet, et éventuellement le définir comme comportement par défaut.
it: Scrivi una query SQL ed eseguila sul tuo database. Puoi anche fare clic sul pulsante 'Apri in nuova scheda' per visualizzare i risultati della query nella loro scheda e, facoltativamente, impostarlo come comportamento predefinito.
pt_br: Grave uma consulta SQL e a execute no seu banco de dados. Você também pode clicar no botão "Abrir na Nova Guia" para ver os resultados da sua consulta em uma guia separada e, opcionalmente, definir isso como o comportamento padrão.
ru: Напишите SQL-запрос и выполните его в своей базе данных. Можно также нажать кнопку "Открыть в новой вкладке", чтобы просмотреть результаты запроса на отдельной вкладке и, при необходимости, задать это как поведение по умолчанию.

# mssql.walkthroughs.getStarted.description
source: Your first steps for connecting to and developing with a SQL database
es: Los primeros pasos para conectarse y desarrollar con una base de datos SQL
fr: Vos premières étapes pour vous connecter et développer avec une base de données SQL
it: I tuoi primi passi per la connessione e lo sviluppo con un database SQL
pt_br: Seus primeiros passos para se conectar e desenvolver com um banco de dados SQL
ru: Первые шаги по подключению к базе данных SQL и ее использованию в разработке

# mssql.saveAsCsv.textIdentifier
source: [Optional] Character used for enclosing text fields when saving results as CSV
es: [Opcional] Carácter que se usa para delimitar los campos de texto al guardar los resultados como CSV.
fr: [Facultatif] Caractère utilisé pour englober les champs textuels pendant l’enregistrement des résultats au format CSV
it: [Facoltativo] Carattere usato per racchiudere i campi di testo quando si salvano i risultati i formato CSV
ja: [省略可能] 結果を CSV として保存するときにテキスト フィールドを囲むために使用する文字
pt_br: [Opcional] Caractere usado para delimitar campos de texto ao salvar os resultados como CSV
ru: [Необязательно] Символы, используемые для обрамления текстовых полей при сохранении результатов в формате CSV

# mssql.saveAsCsv.lineSeparator
source: [Optional] Character(s) used for separating rows when saving results as CSV
es: [Optional] Caracteres que se usan para separar las filas al guardar los resultados como CSV.
fr: [Facultatif] Caractère(s) utilisé(s) pour séparer les lignes pendant l’enregistrement des résultats au format CSV
it: [Facoltativo] Caratteri usati per delimitare le righe quando si salvano i risultati in formato CSV
ja: [省略可能] 結果を CSV として保存するときに行を区切るために使用する文字 (複数可)
pt_br: [Opcional] Caracteres usados para separar linhas ao salvar os resultados como CSV
ru: [Необязательно] Символы, используемые для разделения строк при сохранении результатов в формате CSV

# mssql.copyRemoveNewLine
source: [Optional] Configuration options for copying multi-line results from the Results View
es: [Opcional] Opciones de configuración para copiar los resultados de varias líneas de la vista de resultados.
fr: [Facultatif] Options de configuration pour copier les résultats multilignes à partir de la vue Résultats
it: [Facoltativo] Opzioni di configurazione per la copia di risultati su più righe dalla Visualizzazione risultati
ja: [省略可能] 複数行の結果を結果ビューからコピーするための構成オプション
pt_br: [Opcional] Opções de configuração para copiar os resultados de várias linhas da Visualização dos Resultados
ru: [Необязательно] Параметры конфигурации для копирования многострочных результатов из представления результатов
