Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# mssql.connection.failoverPartner
source: [Optional] Specify the name or network address of the instance of SQL Server that acts as a failover partner.
es: [Opcional] Especificar el nombre o la dirección de red de la instancia de SQL Server que actúa como asociado de conmutación por error.
fr: [Facultatif] Spécifiez le nom ou l’adresse réseau de l’instance de SQL Server servant de partenaire de basculement.
it: [Facoltativo] Consente di specificare il nome o l'indirizzo di rete dell'istanza di SQL Server che funge da partner di failover.
ja: [省略可能] フェールオーバー パートナーとして機能する SQL Server のインスタンスの名前かネットワーク アドレスを指定します。
pt_br: [Opcional] Especifique o endereço de rede ou o nome da instância do SQL Server que atua como um parceiro de failover.
ru: [Необязательно] Укажите имя или сетевой адрес экземпляра SQL Server, который выполняет функцию партнера по обеспечению отработки отказа.

# mssql.connection.connectRetryCount
source: [Optional] Specify the number of attempts to restore connection.
es: [Opcional] Especifique el número de intentos para restaurar la conexión.
fr: [Facultatif] Spécifiez le nombre de tentatives de restauration de la connexion.
it: [Facoltativo] Consente di specificare il numero di tentativi di ripristino della connessione.
ja: [省略可能] 接続を復元する試行回数を指定します。
pt_br: [Opcional] Especifique o número de tentativas para restaurar a conexão.
ru: [Необязательно] Укажите количество попыток восстановления соединения.

# mssql.connection.password
source: [Optional] Specify the password for SQL Server authentication. If password is not specified or already saved, when you connect, you will be asked again.
es: [Opcional] Especifique la contraseña para la autenticación de SQL Server. Si la contraseña no se especifica o ya está guardada, se le volverá a pedir al conectarse.
fr: [Facultatif] Spécifiez le mot de passe pour l’authentification SQL Server. Si le mot de passe n’est pas spécifié ou n’est pas déjà enregistré, il est redemandé à la connexion.
it: [Facoltativo] Consente di specificare la password per l'autenticazione di SQL Server. Se non è specificata o già salvata, verrà richiesta al momento della connessione.
ja: [省略可能] SQL Server 認証用のパスワードを指定します。パスワードが指定されていない、または保存済みの場合は、接続する際に再入力を求められます。
pt_br: [Opcional] Especifique a senha para autenticação do SQL Server. Se a senha não for especificada ou não estiver salva, ela será solicitada novamente quando você se conectar.
ru: [Необязательно] Укажите пароль для проверки подлинности на сервере SQL Server. Если пароль не указан или уже сохранен, при подключении будет снова выведен запрос.

# mssql.connection.port
source: [Optional] Specify the port number to connect to.
es: [Opcional] Especifique el número de puerto con el que se va a conectar.
fr: [Facultatif] Spécifiez le numéro de port auquel se connecter.
it: [Facoltativo] Consente di specificare il numero di porta a cui connettersi.
ja: [省略可能] 接続するポート番号を指定します。
pt_br: [Opcional] Especifique o número da porta à qual se conectar.
ru: [Необязательно] Укажите номер порта для подключения.

# mssql.connection.packetSize
source: [Optional] Specify the size in bytes of the network packets to communicate with SQL Server.
es: [Opcional] Especifique el tamaño en bytes de los paquetes de red para comunicarse con SQL Server.
fr: [Facultatif] Spécifiez la taille en octets des paquets réseau pour communiquer avec SQL Server.
it: [Facoltativo] Consente di specificare le dimensioni in byte dei pacchetti di rete per comunicare con SQL Server.
ja: [省略可能] SQL Server との通信に使われるネットワーク パケットのバイト単位のサイズを指定します。
pt_br: [Opcional] Especifique o tamanho em bytes dos pacotes de rede para se comunicar com o SQL Server.
ru: [Необязательно] Укажите размер в байтах сетевых пакетов, с помощью которых осуществляется связь с сервером SQL Server.

# mssql.connection.user
source: [Optional] Specify the user name for SQL Server authentication. If user name is not specified, when you connect, you will be asked again.
es: [Opcional] Especifique el nombre de usuario para la autenticación de SQL Server. Si no se especifica el nombre de usuario, se le volverá a pedir al conectarse.
fr: [Facultatif] Spécifiez le nom d’utilisateur pour l’authentification SQL Server. Si le nom d’utilisateur n’est pas spécifié, il est redemandé à la connexion.
it: [Facoltativo] Consente di specificare il nome utente per l'autenticazione di SQL Server. Se il nome utente non è specificato verrà chiesto di nuovo al momento della connessione.
ja: [省略可能] SQL Server 認証用のユーザー名を指定します。ユーザー名が指定されていない場合は、接続するときに再び入力を求められます。
pt_br: [Opcional] Especifique o nome de usuário para autenticação do SQL Server. Se o nome de usuário não for especificado, ele será solicitado novamente quando você se conectar.
ru: [Необязательно] Укажите имя пользователя для проверки подлинности на сервере SQL Server. Если имя пользователя не указано, при подключении будет снова выведен запрос.

# mssql.connection.connectionString
source: [Optional] The ADO.NET connection string to use for the connection. Overrides any other options given in this connection.
es: [Opcional] Cadena de conexión de ADO.NET que se va a usar. Reemplaza cualquier otra opción dada en esta conexión.
fr: [Facultatif] Chaîne de connexion ADO.NET à utiliser pour la connexion. Remplace toutes les autres options spécifiées dans cette connexion.
it: [Facoltativo] Stringa di connessione ADO.NET da usare per la connessione. Sostituisce qualsiasi altra opzione impostata in questa connessione.
ja: [省略可能] 接続に使用する ADO.NET 接続文字列。この接続に指定された他のオプションよりも優先されます。
pt_br: [Opcional] A cadeia de conexão do ADO.NET a ser usada para a conexão. Substitui outras opções desta conexão.
ru: [Необязательно] Строка подключения ADO.NET, используемая для подключения. Переопределяет любые другие параметры, заданные в этом подключении.

# mssql.connection.replication
source: [Optional] Used by SQL Server in replication.
es: [Opcional] Utilizada por SQL Server en la replicación.
fr: [Facultatif] Utilisé par SQL Server dans la réplication.
it: [Facoltativo] Usato da SQL Server nella replica.
ja: [省略可能] レプリケーション時に SQL Server によって使用されます。
pt_br: [Opcional] Usado pelo SQL Server na replicação.
ru: [Необязательно] Используется сервером SQL Server при репликации.

# mssql.connection.encrypt
source: [Optional] When 'Mandatory' or 'Strict', SQL Server uses SSL encryption for all data sent between the client and server if the server has a certificate installed. When set to 'Strict', SQL Server uses TDS 8.0 for all data transfer between the client and server. 'Strict' is supported on SQL Server 2022 onwards.
es: [Opcional] Cuando es "Mandatory" o "Strict", SQL Server usa cifrado SSL para todos los datos enviados entre el cliente y el servidor si el servidor tiene un certificado instalado. Cuando se establece en "Strict", SQL Server usa TDS 8.0 para toda la transferencia de datos entre el cliente y el servidor. El cifrado "Strict" se admite en SQL Server 2022 y posteriores.
fr: [Facultatif] En cas de chiffrement « Mandatory » (obligatoire) ou « Strict » (stricte), SQL Server utilise le chiffrement SSL pour toutes les données envoyées entre le client et le serveur si un certificat est installé sur le serveur. Lorsque « stricte » est défini, SQL Server utilise TDS 8.0 pour tout transfert de données entre le client et le serveur. « Stricte » est pris en charge sur SQL Server 2022.
it: [Facoltativo] Quando è 'Obbligatorio' o 'Restrittivo', SQL Server utilizza la crittografia SSL per tutti i dati inviati tra il client e il server se nel server è installato un certificato. Se impostato su 'Restrittivo', SQL Server utilizza TDS 8.0 per tutti i trasferimenti di dati tra il client e il server. 'Restrittivo' è supportato a partire da SQL Server 2022.
ja: [省略可能] 'Mandatory' または 'Strict' の場合、サーバーに証明書がインストールされていれば、クライアントとサーバーの間で送信されるすべてのデータに SQL Server が SSL 暗号化を使用します。'Strict' に設定されている場合、クライアントとサーバー間のすべてのデータ転送に SQL Server が TDS 8.0 を使用します。'Strict' は、SQL Server 2022 以降でサポートされています。
pt_br: [Opcional] Quando "Obrigatório" ou "Estrito", o SQL Server usa criptografia SSL para todos os dados enviados entre o cliente e o servidor se o servidor tiver um certificado instalado. Quando definido como "Estrito", o SQL Server usa o TDS 8.0 para todas as transferências de dados entre o cliente e o servidor. "Estrito" tem suporte no SQL Server 2022 em diante.
ru: [Необязательно] Когда задано значение "Mandatory" или "Strict", SQL Server использует SSL-шифрование для всех данных, отправляемых между клиентом и сервером, если на сервере установлен сертификат. Если установлено значение "Strict", SQL Server использует TDS 8.0 для передачи всех данных между клиентом и сервером. Значение "Strict" поддерживается в SQL Server начиная с версии 2022.

# mssql.connection.multipleActiveResultSets
source: [Optional] When set to 'true', multiple result sets can be returned and read from on connection.
es: [Opcional] Si se establece en "true"', se pueden devolver varios conjuntos de resultados y leerlos desde una conexión.
fr: [Facultatif] Quand la valeur est « true », plusieurs jeux de résultats peuvent être retournés et lus sur la connexion.
it: [Facoltativo] Se è impostato su 'true', più set di risultati possono essere restituiti o letti da un'unica connessione.
ja: [省略可能] 'true' に設定すると、1 つの接続から複数の結果セットが返され、これらを読み取ることができます。
pt_br: [Opcional] Quando definidos como "true", os vários conjuntos de resultados podem ser retornados e lidos na conexão.
ru: [Необязательно] Когда установлено значение "TRUE", из подключение позволяет вернуть и прочитать несколько результирующих наборов.

# mssql.connection.trustServerCertificate
source: [Optional] When set to 'true', the SQL Server SSL certificate is automatically trusted when the communication layer is encrypted using SSL. Set 'false' for Azure SQL Database connection.
es: [Opcional] Si se establece en "true", se confía automáticamente en el certificado SSL de SQL Server cuando el nivel de comunicación se cifra con SSL. Establézcalo en "false" para la conexión con base de datos de Azure SQL.
fr: [Facultatif] Quand la valeur est « true », le certificat SSL SQL Server est automatiquement approuvé si la couche de communication est chiffrée à l’aide de SSL. Définissez la valeur sur « false » pour la connexion à Azure SQL Database.
it: [Facoltativo] Se è impostato su 'true', il certificato SSL di SQL Server viene automaticamente considerato attendibile quando il livello di comunicazione è crittografato tramite SSL. Impostare su 'false' per la connessione al database SQL di Azure.
ja: [省略可能] 'true' を設定した場合、通信レイヤーが SSL で暗号化されていれば、SQL Server の SSL 証明書は自動的に信頼されます。Azure SQL Database 接続には 'false' を設定してください。
pt_br: [Opcional] Quando definido como "true", o certificado SSL do SQL Server será automaticamente confiável quando a camada de comunicação for criptografada com SSL. Defina "false" para conexão de Banco de Dados SQL do Azure.
ru: [Необязательно] Когда этот параметр имеет значение "TRUE", SSL-сертификат сервера SQL Server будет автоматически считаться доверенным, если слой связи зашифрован с использованием SSL. Установите значение "false", чтобы использовать подключение к базе данных SQL Azure.

# mssql.connection.pooling
source: [Optional] When set to 'true', the connection object is drawn from the appropriate pool, or if necessary, is created and added to the appropriate pool. Note: May keep serverless databases active and prevent auto-pausing.
es: [Opcional] Cuando se establece en "verdadero", el objeto de conexión se extrae del grupo adecuado o, si es necesario, se crea y se agrega al grupo adecuado. Nota: Puede mantener activas las bases de datos sin servidor y evitar la pausa automática.
fr: [Facultatif] Quand la valeur est « true », l’objet de connexion est tiré du pool approprié ou, si nécessaire, est créé et ajouté au pool approprié. Remarque : cela peut maintenir les bases de données serverless actives et empêcher la mise en pause automatique.
it: [Facoltativo] Se è impostato su 'true', l'oggetto connessione viene prelevato dal pool appropriato oppure, se necessario, viene creato e aggiunto al pool appropriato. Nota: potrebbe mantenere attivi i database serverless e impedire la sospensione automatica.
ru: [Необязательно] Если задано значение "true", объект подключения берется из соответствующего пула, либо, если это необходимо, создается и добавляется в соответствующий пул. Примечание. Может поддерживать бессерверные базы данных в активном состоянии и предотвращать автоматическую приостановку.

# mssql.connection.multiSubnetFailover
source: [Optional] When set to 'true', the detection and connection to the active server is faster if AlwaysOn Availability Group is configured on different subnets.
es: [Opcional] Si se establece en "true", la detección del servidor activo y la conexión con este es más rápida si el grupo de disponibilidad AlwaysOn está configurado en distintas subredes.
fr: [Facultatif] Quand la valeur est « true », la détection et la connexion au serveur actif sont plus rapides si le groupe de disponibilité AlwaysOn est configuré dans des sous-réseaux différents.
it: [Facoltativo] Se è impostato su 'true', il rilevamento e la connessione al server attivo è più veloce quando il gruppo di disponibilità AlwaysOn è configurato in subnet diverse.
ja: [省略可能] 'true' に設定すると、AlwaysOn 可用性グループが異なるサブネット上に構成されている場合に、アクティブなサーバーの検出と接続が高速になります。
pt_br: [Opcional] Quando definidas como "true", a detecção e a conexão ao servidor ativo serão mais rápidas se o Grupo de Disponibilidade Always On estiver configurado em sub-redes diferentes.
ru: [Необязательно] Когда установлено значение "TRUE", обнаружение активного сервера и подключение к нему происходит быстрее, если группа доступности AlwaysOn настроена в других подсетях.

# mssql.connection.savePassword
source: [Optional] When set to 'true', the password for SQL Server authentication is saved in the secure store of your operating system such as KeyChain in MacOS or Secure Store in Windows.
es: [Opcional] Si se establece en "true", la contraseña para la autenticación de SQL Server se guarda en el almacén seguro del sistema operativo, como KeyChain en MacOS o Almacenamiento seguro en Windows.
fr: [Facultatif] Quand la valeur est « true », le mot de passe pour l’authentification SQL Server est enregistré dans la banque d’informations sécurisée de votre système d’exploitation, par exemple, KeyChain dans MacOS ou Banque d’informations sécurisée dans Windows.
it: [Facoltativo] Se è impostato su 'true', la password per l'autenticazione di SQL Server viene salvata nell'archivio protetto del sistema operativo, ad esempio Portachiavi in MacOS o Archiviazione sicura in Windows.
ja: [省略可能] 'true' に設定すると、SQL Server 認証に使われるパスワードは、MacOS のキーチェーンや Windows の Secure Store といった、オペレーティング システムのセキュリティで保護された場所に保存されます。
pt_br: [Opcional] Quando definida como "true", a senha para a autenticação do SQL Server é salva no repositório seguro de seu sistema operacional, como KeyChain no MacOS ou Repositório Seguro no Windows.
ru: [Необязательно] Когда установлено значение "TRUE", пароль для проверки подлинности на сервере SQL Server сохраняется в безопасном хранилище операционной системы, например KeyChain в macOS или Secure Store в Windows.

# mssql.connection.persistSecurityInfo
source: [Optional] When set to false, security-sensitive information, such as the password, is not returned as part of the connection if the connection is open or has ever been in an open state.
es: [Opcional] Si se establece como "false", no se devuelve información confidencial de seguridad, como la contraseña, como parte de la conexión si esta está abierta o lo ha estado alguna vez.
fr: [Facultatif] Quand la valeur est « false », les informations relatives à la sécurité, comme le mot de passe, ne sont pas retournées dans le cadre de la connexion si la connexion est ouverte ou a été dans un état ouvert.
it: [Facoltativo] Se è impostato su 'false', le informazioni sensibili dal punto di vista della sicurezza, ad esempio la password, non vengono restituite come parte della connessione se la connessione è aperta o in precedenza si è trovata in uno stato aperto.
ja: [省略可能] false を設定すると、接続が開くか、既に接続状態になっている場合、パスワードのようなセキュリティに関する情報は接続の一部として返されません。
pt_br: [Opcional] Quando definidas como false, informações confidenciais de segurança, como senha, não serão retornadas como parte da conexão se a conexão estiver aberta ou caso nunca tenha estado em um estado aberto.
ru: [Необязательно] При установленном значении "FALSE" конфиденциальные данные (например пароль) не возвращаются в составе подключения, если подключение открыто или когда-либо находилось в открытом состоянии.

# mssql.connection.hostNameInCertificate
source: [Optional] When specified (and encrypt=Mandatory and trustServerCertificate=false), SQL Server uses provided hostname for validating trust with the server certificate.
es: [Opcional] Cuando se especifica (y encrypt=Mandatory y trustServerCertificate=false), SQL Server usa el nombre de host proporcionado para validar la confianza con el certificado de servidor.
fr: [Facultatif] Lorsque ce paramètre est spécifié (et encrypt=Mandatory et trustServerCertificate=false), SQL Server utilise le nom d’hôte fourni pour valider l’approbation avec le certificat de serveur.
it: [Facoltativo] Se specificato (e encrypt=Mandatory e trustServerCertificate=false), SQL Server utilizza il nome host specificato per convalidare l'attendibilità con il certificato del server.
ja: [省略可能] 指定した場合 (および encrypt=Mandatory and trustServerCertificate=false)、SQL Serverは、指定されたホスト名を使用してサーバー証明書との信頼を検証します。
pt_br: [Opcional] Quando especificado (e encrypt=Mandatory e trustServerCertificate=false), o SQL Server usa o nome do host fornecido para validar a confiança com o certificado do servidor.
ru: [Необязательно] Если указано (и encrypt=Mandatory, и trustServerCertificate=false), SQL Server использует предоставленное имя хоста для проверки доверия с сертификатом сервера.

# mssql.saveAsCsv.includeHeaders
source: [Optional] When true, column headers are included when saving results as CSV
es: [Opcional] Si se establece en true, los encabezados de columna se incluyen al guardar los resultados como CSV.
fr: [Facultatif] Quand la valeur est « true », les en-têtes de colonnes sont inclus dans l’enregistrement des résultats au format CSV
it: [Facoltativo] Se è impostato su true, le intestazioni di colonna vengono incluse quando si salvano i risultati in formato CSV
ja: [省略可能] true の場合、CSV として結果を保存する際に列ヘッダーが組み込まれます
pt_br: [Opcional] Quando true, os cabeçalhos de coluna são incluídos ao salvar os resultados como CSV
ru: [Необязательно] Если указано значение TRUE, заголовки столбцов включаются при сохранении результатов в формате CSV

# mssql.connection.server
source: [Required] Specify the server name to connect to. Use 'hostname instance' or '<server>.database.windows.net' for Azure SQL Database.
es: [Obligatorio] Especifique el nombre del servidor con el que se va a conectar. Use 'hostname instance' o '<server>.database.windows.net' para la base de datos de Azure SQL.
fr: [Requis] Spécifiez le nom du serveur auquel se connecter. Utilisez « hostname instance » ou « <server>.database.windows.net » pour Azure SQL Database.
it: [Obbligatorio] Specifica il nome del server a cui connettersi. Usare 'hostname instance' o '<server>.database.windows.net' per il database SQL di Azure.
ja: [必須] 接続するサーバー名を指定します。'hostname instance' または '<server>.database.windows.net' (Azure SQL Database の場合) の形式を使用してください。
pt_br: [Obrigatório] Especifique o nome do servidor ao qual se conectar. Use "hostname instance" ou "<server>.database.windows.net" para o Banco de Dados SQL do Azure.
ru: [Обязательно] Укажите имя сервера, к которому необходимо подключиться. Используйте для базы данных SQL Azure формат "экземпляр имя_узла" или "<сервер>.database.windows.net".

# mssql.objectExplorer.Tooltip.authenticationTypeLabel
source: auth
it: autenticazione
ru: проверка подлинности

# mssql.objectExplorer.Tooltip.portLabel
source: port
es: puerto
it: porta
ru: порт

# mssql.format.placeCommasBeforeNextStatement
source: should commas be placed at the beginning of each statement in a list e.g. ', mycolumn2' instead of at the end e.g. 'mycolumn1,'
es: Indica si las comas deben colocarse al principio de cada instrucción de una lista por ejemplo, ", micolumna2" en lugar de al final, por ejemplo, "micolumna1,"
fr: spécifie si les virgules doivent être placées au début de chaque instruction dans une liste, par exemple : « , mycolumn2 » plutôt qu’à la fin, par exemple : « mycolumn1, »
it: se le virgole devono essere inserite all'inizio di ogni istruzioni in un elenco, ad esempio ', mycolumn2', anziché alla fine, ad es. 'mycolumn1,'
ja: コンマを'mycolumn1,' のようにリスト内の各ステートメントの末尾に配置する代わりに ',mycolumn2' のように先頭に配置する場合
pt_br: As vírgulas devem ser colocadas no início de cada instrução em uma lista, por exemplo, "mycolumn2" em vez de serem colocadas no final, por exemplo, "mycolumn1,"?
ru: следует ли помещать запятые в начале каждой инструкции списка, а не в конце, например ", mycolumn2", а не "mycolumn1,"

# mssql.objectExplorer.Tooltip.userLabel
source: user
es: usuario
it: utente
ru: пользователь

# ++CODE++b52e3b22bc74f576e4eb67d09ab37f79383db3c62b03686731fe777b42e5f0e6
source: <Default>
ru: <По умолчанию>

# ++CODE++0d7668d337e375d8ccfc1a69ca8f6e22a0b0c850a78c4770b0c4aa3b0daca630
source: <default>
ru: <по умолчанию>

# ++CODE++7e1b0d5641f2640ce9a953ec231eea2c27a2a7633f7d3c273e5735e2b30c10b7
source: Account
es: Cuenta
ru: Учетная запись

# ++CODE++cf582c92b799b117f2d093534bbe7b99aea5df658f201220f320f2976c0ebbba
source: Azure (US Government)
es: Azure (Gobierno de Estados Unidos)
ru: Azure (для государственных организаций США)

# ++CODE++b6c1d862f9f75ec31eb9829b6a5968eb291dc8785e7fb59d4bc6ef00f292d3f7
source: Both
ru: Оба

# ++CODE++b977b950c1ae31e5aeb9ef778cc20a66fc034eb81e738e0206104b677962c465
source: Cloud
es: Nube
ru: Облако

# ++CODE++fa7fe67124e94375d97e50896e0c32f44b03bb7ed5e9fb026341b55da724126b
source: Database
es: Base de datos
fr: Base de données
pt_br: Banco de dados
ru: База данных

# ++CODE++84a2b1ae34166a218282ec6156f3af9c67f4ccb6c03ec1cc0a03d9b3792069aa
source: Database - {0}
es: Base de datos: {0}
fr: Base de données – {0}
ru: База данных — {0}

# ++CODE++1b2da57e60f89f7e5fa102ef76d7ef2ca1d7d212380c0200d648e2215a5f555d
source: Existing SQL server
es: Servidor SQL existente
ru: Существующий сервер SQL Server

# ++CODE++c39d646f10769b078ae82be4da7a0079ca91182b241e749be4276e08c215c654
source: Explorer
ru: Обозреватель

# ++CODE++aac77df347205252b074d45aff7891debdba0ff1466cc0c351416d1662bb71ab
source: Feedback
ru: Отзывы

# ++CODE++50009ce1da4d15e1c4a04024df691eed5f0d598e2c4c67092f205366d0adf99e
source: File
es: Archivo
fr: Fichier
pt_br: Arquivo
ru: Файл

# ++CODE++d00bd4ec32e4e1cc45ddae0ad3fd34af28cefb4f236b0f8cc19ff7bfe70dda17
source: Formula
es: Fórmula
fr: Formule
pt_br: Fórmula
ru: Формула

# ++CODE++e3b6c3b07e47adb535f9d3691bd7ed7dcf7f4bd4f352345751f992ad5549849f
source: Generate & Run
ru: Создать и запустить

# ++CODE++6e517828c3d88ea3e62b2169a626c32e39be2e7cf52e99f7e9d764af6859bbd0
source: Highlights
es: Contenidos destacados
ru: Моменты

# ++CODE++fc899519286f8da6256728b62d14e6ef9042346e7ad4191e21c95efaf1141a42
source: Max: {0}
es: Máximo: {0}
ru: Максимальное значение: {0}

# ++CODE++8055a31cb4833efbf1b76994151d8256bfc8500f2985d3d0ab1cf222dd91a043
source: Microsoft Corp
ru: Корпорация Майкрософт

# ++CODE++b2f711bd6e74f6bab7fe9cb304a059fe7213d5db1e7f14f207aaac37c5d13ac7
source: Min: {0}
es: Mín: {0}
ru: Минимум: {0}

# ++CODE++652b81589c6b1b34e452b1d3a3f326e1b3796877eca3c750be3e84412a6d9777
source: New SQL Server Local development container
es: Nuevo contenedor de desarrollo local de SQL Server
ru: Новый локальный контейнер для разработки SQL Server

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
fr: Non
ja: いいえ
pt_br: Não
ru: Нет
