Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++207b04072a822fa8e76629bcd504bc8c19525b86f444ac77a6f3be1c88a502eb
source: Insufficient Workspace Permissions
es: Permisos de área de trabajo insuficientes
it: Autorizzazioni insufficienti per l'area di lavoro
ru: Недостаточно разрешений рабочей области

# ++CODE++afe3d8a0f4733dcd43ec5b17d8c6d8d3ec7e53c511f1ad49d1168ea289bdd055
source: Integrated
es: Integrado
fr: Intégré
it: Integrato
ja: 統合
pt_br: Integrado
ru: Интегрированные

# ++CODE++aca9e581f935a7772af49f14b1bc37305d26449df47ba4a8ecea51c758d4814f
source: Integrated & secure
es: Integrado y seguro
it: Integrato e sicuro
ru: Интегрированная и безопасная

# ++CODE++eced7daa046aa47caa62c3306d8114cb2f558fd2f53ebd2cc4d3b802857d200b
source: Invalid Firewall rule name
es: Nombre de regla de firewall no válida.
fr: Nom de règle de pare-feu non valide
it: Nome regola firewall non valido
ja: ファイアウォール規則名が無効です
pt_br: Nome de regra de firewall inválido
ru: Недопустимое имя правила брандмауэра

# ++CODE++4480c895a6e66acfc4e43550d8a60598168463e52699be5ed28eae3ecf7200c7
source: Invalid IP Address
es: Dirección IP no válida
fr: Adresse IP non valide
it: Indirizzo IP non valido
ja: IP アドレスが無効です
pt_br: Endereço IP inválido
ru: Недопустимый IP-адрес

# ++CODE++0c2f118ad5933157d00e2025f7cc3d3c3da84db32e18ffbb4f1032471cc643ef
source: Invalid SQL Server password for {0}. Password must be 8–128 characters long and meet the complexity requirements. For more information see https://docs.microsoft.com/sql/relational-databases/security/password-policy
es: Contraseña de SQL Server no válida para {0}. La contraseña debe tener entre 8 y 128 caracteres y cumplir los requisitos de complejidad. Para obtener más información, consulte https://docs.microsoft.com/sql/relational-databases/security/password-policy
it: Password SQL Server non valida per {0}. La password deve avere una lunghezza di 8 - 128 caratteri e rispettare i requisiti di complessità. Per altre informazioni, vedere https://docs.microsoft.com/sql/relational-databases/security/password-policy
ru: Недопустимый пароль SQL Server для {0}. Пароль должен содержать от 8 до 128 символов и соответствовать требованиям по сложности. Подробнее: https://docs.microsoft.com/sql/relational-databases/security/password-policy

# ++CODE++b6b50087a99bf4427265eff9dd813914f1ceb8c55260fa6e7075f9c89fcd45d7
source: Invalid column width
es: Ancho de columna no válido
fr: Largeur de colonne non valide
it: Larghezza della colonna non valida
ja: 列の幅が無効です
pt_br: Largura de coluna inválida
ru: Недопустимая ширина столбца

# ++CODE++4ce86c72bcd330160b14a711a925bf6f8e24fdd6b26d4a7abbfa548e510648d5
source: Invalid connection URI provided.
es: Se proporcionó un URI de conexión no válido.
it: È stato specificato un URI di connessione non valido.
ru: Предоставлен недопустимый URI подключения.

# ++CODE++5c61e4661a7417ada5f0b7d34d9c3cd27dcc3aad485b337ea6d58cd077be7c8c
source: Invalid connection URI. Please ensure you have an active database connection.
es: URI de conexión no válido. Asegúrese de que tiene una conexión de base de datos activa.
it: URI di connessione non valido. Assicurarsi di avere una connessione di database attiva.
ru: Недопустимый URI подключения. Убедитесь, что у вас есть активное подключение к базе данных.

# ++CODE++c265d537d7811a1e8fa19df9305f90ad86e0326ad6dd2d585172fcf570023c57
source: Invalid connection string: {0}
es: Cadena de conexión no válida: {0}
fr: Chaîne de connexion non valide : {0}
it: Stringa di connessione non valida: {0}
pt_br: Cadeia de conexão inválida: {0}
ru: Недопустимая строка подключения: {0}

# ++CODE++5a3259a2357ce703fcc4ea2d2983346c88751c8b1f74beaab08602f5f4e721cf
source: Invalid database
es: Base de datos no válida
it: Database non valido
ru: Недопустимая база данных

# ++CODE++388f0e37447ebf20167d7d8b0d203a21e726eb2d60ec4b09c13480cdadff59ee
source: Invalid file
es: Archivo no válido
it: File non valido
ru: Недопустимый файл

# ++CODE++f23f5034c0f7290a53b9c27d9005cd69d60da06ac62b692fdf5f4d2877faee16
source: Invalid file extension. Expected .dacpac or .bacpac
es: Extensión de archivo no válida. Se esperaba .dacpac o .bacpac
it: Estensione file non valida. È previsto .dacpac o .bacpac
ru: Недопустимое расширение файла. Ожидается DACPAC или BACPAC

# ++CODE++b65d31b3dcfd9935b8fae6c977fe0f07a5d73a830edb2426c05d63464b299858
source: Invalid max length '{0}'
es: Longitud máxima no válida "{0}"
fr: La longueur maximale « {0} » n’est pas valide
it: Lunghezza massima '{0}' non valida
pt_br: Comprimento máximo inválido '{0}'
ru: Недопустимая максимальная длина "{0}"

# ++CODE++d1a326f448eac64b9ec46d31b9dce63a30f305179abc83e734c8d960bcaa9631
source: Is Computed
es: Se calcula
fr: Est calculé
it: È calcolato
pt_br: É Computado
ru: Вычисляемый

# ++CODE++6ddf8604e8d33286bd064640a453784b6142293230a717b9b1859fa3176573f6
source: Is Identity
es: Es una identidad
fr: Est l’identité
it: È identità
pt_br: É Identidade
ru: Является удостоверением

# ++CODE++6ea66fb270a32f7ef42424605fcee4a35665033b151fafac0c648fe3d8cb8129
source: Is Ledger Database
it: Database libro mastro

# ++CODE++5b3eef9bf6b0c6df6a0d614b57c2fcd589f9716a7e8b8040dde61be4d2f7e02e
source: Is Persisted
es: Es persistente
fr: Est persistant
it: È persistente
pt_br: É Persistido
ru: Сохраняемый

# ++CODE++fa95e3dd5aa6339906552abd3b5613f356ea1c6e4a3a3d376b450d3856b0b8d6
source: Issues ({0})
es: Incidencias ({0})
fr: Problèmes ({0})
it: Problemi ({0})
pt_br: Problemas ({0})
ru: Проблемы ({0})

# ++CODE++b91185f63fbbc17c093e3d2b7a50b755ba38d0e3a2bf1c82e079236e0624c673
source: Join the discussions
es: Unirse a las discusiones
it: Partecipa alle discussioni
ru: Присоединиться к обсуждениям

# ++CODE++29b39d81b8651e8717f85c00002b2b087bafb969eb289ac991fa41b17522e775
source: Keep in query pane
es: Mantener en el panel de consulta
fr: Conserver dans le volet de requête
it: Mantieni nel riquadro query
pt_br: Manter no painel de consulta
ru: Сохранить в панели запросов

# ++CODE++a3c13b491573b0d54bf743caf0f5d59d5a791c42ae1072f16bb941be925fae18
source: Keys for token cache could not be saved in credential store, this may cause Microsoft Entra Id access token persistence issues and connection instabilities. It's likely that SqlTools has reached credential storage limit on Windows, please clear at least 2 credentials that start with "Microsoft.SqlTools|" in Windows Credential Manager and reload.
es: Las claves para la caché de tokens no se pudieron guardar en el almacén de credenciales, lo que puede causar problemas de persistencia del token de acceso de Microsoft Entra Id e inestabilidades en la conexión. Es probable que SqlTools haya alcanzado el límite de almacenamiento de credenciales en Windows. Borre al menos 2 credenciales que comiencen con "Microsoft.SqlTools|" en el Administrador de credenciales de Windows y vuelva a cargar.
fr: Les clés du cache de jetons n’ont pas pu être enregistrées dans le magasin d’informations d’identification, ce qui peut entraîner des problèmes de persistance du jeton d’accès d’identifiant Microsoft Entra et des instabilités de connexion. Il est probable que SqlTools ait atteint la limite de stockage des informations d’identification sous Windows. Veuillez effacer au moins deux informations d’identification commençant par « Microsoft.SqlTools| » dans Windows Credential Manager et rechargez.
it: Non è possibile salvare le chiavi della cache dei token nell'archivio delle credenziali. Ciò potrebbe causare problemi di persistenza dei token di accesso Microsoft Entra ID e instabilità della connessione. È probabile che SqlTools abbia raggiunto il limite di archiviazione delle credenziali in Windows. Cancellare almeno 2 credenziali che iniziano con "Microsoft.SqlTools|" in Gestione credenziali di Windows e ricaricare.
ja: トークン キャッシュのキーを資格情報ストアに保存できなかったため、Microsoft Entra ID アクセス トークンの永続化の問題が発生したり、接続が不安定になったりする可能性があります。SqlTools が Windows の資格情報ストレージの上限に達した可能性があります。Windows 資格情報マネージャーで "Microsoft.SqlTools|" で始まる資格情報を少なくとも 2 つクリアして、再度読み込んでください。
pt_br: As chaves do cache de tokens não puderam ser salvas no armazenamento de credenciais, o que pode causar problemas de persistência de tokens de acesso ao Microsoft Entra ID e instabilidades de conexão. É provável que o SqlTools tenha atingido o limite de armazenamento de credenciais no Windows. Limpe pelo menos 2 credenciais que comecem com "Microsoft.SqlTools|" no Gerenciador de Credenciais do Windows e recarregue.
ru: Не удалось сохранить ключи для кэша маркеров в хранилище учетных данных. Это может привести к проблемам сохраняемости маркера доступа Microsoft Entra ID и нестабильности подключения. Скорее всего, в SqlTools достигнуто ограничение хранилища учетных данных в Windows. Удалите по крайней мере 2 набора учетных данных, которые начинаются с "Microsoft.SqlTools|" в диспетчере учетных данных Windows, и выполните перезагрузку.

# ++CODE++c7d299ed6b2896187b535a86fd6b04f01669a9b72528a8f2021fff2f42d9f6e3
source: Last Page
es: Última página
it: Ultima pagina
ru: Последняя страница

# ++CODE++8d8cd546b58d91c300d3149ef40b8d98d3061dc38f15ea937d2ed785a3f25771
source: Learn More
es: Más información
fr: En savoir plus
it: Altre informazioni
pt_br: Saiba Mais
ru: Дополнительные сведения

# ++CODE++1445799c033a2d17e2bad5d8610879e71ff0d73a8a3c2b932b43ad0449dac3a1
source: Learn more
es: Más información
it: Altre informazioni
ru: Подробнее

# ++CODE++51da53a813a79b97741fb115a94a72fe1629a0b0e9018767157ca28d863c53e3
source: Learn more about SQL Server 2025 features
es: Más información sobre las características de SQL Server 2025
fr: En savoir plus sur les fonctionnalités SQL Server 2025
it: Altre informazioni sulle funzionalità di SQL Server 2025
ru: Подробнее о функциях SQL Server 2025

# ++CODE++11c56d1016670369a74f4b7d2d2ec8959e8098b44e778fd4e3a3548bd846826b
source: Learn more about this issue.
es: Más información sobre este problema.
it: Altre informazioni su questo problema.
ru: Дополнительные сведения об этой проблеме.

# ++CODE++adc95605a1b30c73959fbaf21e60f9723efe855c482fa336a957924d4ea0a08b
source: Length
es: Duración
fr: Longueur
it: Lunghezza
ja: 長さ
pt_br: Comprimento
ru: Длина

# ++CODE++66a64458c4ba13495492108557828d5ef43bfc7f9aca725db617d6a1556ad088
source: Length mismatch: Column '{0}' ({1}) incompatible with '{2}' ({3})
es: Falta de coincidencia de longitud: columna "{0}" ({1}) incompatible con "{2}" ({3})
fr: Incompatibilité de longueur : la colonne « {0} » ({1}) est incompatible avec « {2} » ({3})
it: Lunghezza non corrispondente: la colonna '{0}' ({1}) è incompatibile con '{2}' ({3})
pt_br: Incompatibilidade de comprimento: coluna ''{0}'' ({1}) incompatível com ''{2}'' ({3})
ru: Несоответствие длины: столбец "{0}" ({1}) несовместим с "{2}" ({3})

# ++CODE++ab7e3aa3d0d8c78763c986b6a831726ff623b195a38a8d4b1191976c0becf72e
source: Less Than
es: Menor que
fr: Inférieur à
it: Minore di
ja: 指定値より小さい
pt_br: Menor Que
ru: Меньше

# ++CODE++f3efd3e5531c7b16003d81bb5085288ace97366792c480484895fd2583ca5842
source: Less Than or Equals
es: Menor o igual que
fr: Inférieur ou égal à
it: Minore o uguale a
pt_br: Menor ou Igual a
ru: Меньше или равно

# ++CODE++23105bdfc3d62ed123bff7dd685f40015ddf25b49f2b9a895014acb9d8d40763
source: Less than
es: Menor que
it: Minore di
ru: Меньше

# ++CODE++ae1564a79ff31afebb08eb05fd9d31bcf9b616516c2a9deff4288695cf2c5240
source: Less than or equal to
es: Es menor o igual que
it: Minore di o uguale a
ru: Меньше или равно

# ++CODE++d05f53bafc473abafc1af3b592a9186f7c8b2579999c953b6f3d9f9450c43f50
source: Line {0}
es: Línea {0}
fr: Ligne {0}
it: Riga {0}
ja: 行 {0}
pt_br: Linha {0}
ru: Строка {0}

# ++CODE++4ffa355be76c7d5e9f39081d405b5a1d2d9cae27b4016b7588b4b812f2146556
source: List Connections
es: Enumerar conexiones
fr: Liste des connexions
it: Elenca connessioni
ru: Список подключений

# ++CODE++b993796f53424becc0d08d41a72c0c3381ee7691cc518bc8bdccc8d4013ad4ef
source: List Databases
es: Lista de bases de datos
fr: Liste de bases de données
it: Elenca i database
ru: Перечислить базы данных

# ++CODE++e5c4507bf20d72d00bff4c289eb11be5c9a297933beec5db5969eb33b7bc5690
source: List Functions
es: Mostrar la lista de funciones
fr: Lister les fonctions
it: Elenca funzioni
ru: Перечислить функции

# ++CODE++0b795cd3bad85a0e394c340640be776b2c7765598fd7ac3dc8d2430baf78e77a
source: List Schemas
es: Mostrar la lista de esquemas
fr: Lister les schémas
it: Elenca schemi
ru: Перечислить схемы

# ++CODE++00806af7575cfd81acd74e3d602bb671403cbddfdf02754be73db121177d235f
source: List Tables
es: Mostrar la lista de tablas
fr: Lister les tables
it: Elenca tabelle
ru: Перечислить таблицы

# ++CODE++68053ffe844804d37eced757d4d0582e750a9b20d8ec5084aaab907846177b86
source: List Views
es: Mostrar la lista de vistas
fr: Lister les vues
it: Elenca visualizzazioni
ru: Перечислить представления

# ++CODE++b77fb88f6365c7aa62b75d120b96e1859e449166ac52bd58301306032102daf0
source: List all connections registered with the mssql extension?
es: ¿Enumerar todas las conexiones registradas con la extensión mssql?
fr: Voulez-vous répertorier toutes les connexions enregistrées avec l’extension MSSQL ?
it: Elencare tutte le connessioni registrate con l'estensione mssql?
ru: Перечислить все подключения, зарегистрированные в расширении mssql?

# ++CODE++0228867ee113d27a7377e81352a399252a73a53fcda8c7eeb55366e272692d90
source: List databases for connection '{0}' (ID: {1})?
es: ¿Desea enumerar las bases de datos de la conexión "{0}" (id.: {1})?
it: Elencare i database per la connessione "{0}" (ID: {1})?
ru: Перечислить базы данных для подключения "{0}" (ИД: {1})?

# ++CODE++a0d0c5314184e531a57ada941f98fd3d3d6a0a0815296c08c514d2885672c998
source: List functions for connection '{0}' (ID: {1})?
es: ¿Desea enumerar las funciones de la conexión "{0}" (id.: {1})?
it: Elencare le funzioni per la connessione "{0}" (ID: {1})?
ru: Перечислить функции для подключения "{0}" (ИД: {1})?

# ++CODE++6369f67786ac3f6d5ed439f3eea6ab7cf1f8acfa25ba69c73b658225f5e7ce51
source: List schemas for connection '{0}' (ID: {1})?
es: ¿Desea enumerar los esquemas de la conexión "{0}" (id.: {1})?
it: Elencare gli schemi per la connessione "{0}" (ID: {1})?
ru: Перечислить схемы для подключения "{0}" (ИД: {1})?

# ++CODE++bd24852e1bccb2d3a2353ce971a9b8d5166a6e4be8011bff6ca03e8fd24b51a1
source: List tables for connection '{0}' (ID: {1})?
es: ¿Desea enumerar las tablas de la conexión "{0}" (id.: {1})?
it: Elencare le tabelle per la connessione "{0}" (ID: {1})?
ru: Перечислить таблицы для подключения "{0}" (ИД: {1})?

# ++CODE++743c7de4570af673cd265fa7de1e6fd699d92cf80d54a530f4ac79c7bd3f0794
source: List views for connection '{0}' (ID: {1})?
es: ¿Desea mostrar vistas para la conexión "{0}" (id.: {1})?
it: Elencare le visualizzazioni per la connessione "{0}" (ID: {1})?
ru: Перечислить представления для подключения "{0}" (ИД: {1})?

# ++CODE++8043c062698783f821c86c7bc00a285e71f93c8ddf50815cfa601fef33905401
source: Listing Fabric SQL Databases for workspace '{0}'
es: Lista de bases de datos SQL de Fabric para el área de trabajo '{0}'
it: Elenco dei database SQL di Fabric per l'area di lavoro '{0}'
ru: Перечисление баз данных SQL Fabric для рабочей области "{0}"

# ++CODE++d63cd16cd7f14f873a95c39ea88cdd895461edd04b9fa7894a5b050274e85b1f
source: Listing Fabric SQL Endpoints for workspace '{0}'
es: Enumeración de puntos de conexión de Fabric SQL para el área de trabajo '{0}'
it: Elenco degli endpoint SQL di Fabric per l'area di lavoro '{0}'
ru: Перечисление конечных точек SQL Fabric для рабочей области "{0}"

# ++CODE++a5c14e0446ba987ee1804ac7f75c2cf29a526c5b3efc8ec431eeb50d200ad7f0
source: Listing Fabric capacities for tenant '{0}'
es: Lista de capacidades de Fabric para el inquilino '{0}'
it: Elenco delle capacità di Fabric per il tenant '{0}'
ru: Перечисление емкостей Fabric для клиента "{0}"

# ++CODE++0674831e66235d3d493987bb2f89a42a981be092b9be08a7214438e389b30737
source: Listing Fabric workspaces for tenant '{0}'
es: Lista de áreas de trabajo de Fabric para el inquilino '{0}'
it: Elenco delle aree di lavoro di Fabric per il tenant '{0}'
ru: Перечисление рабочих областей Fabric для клиента "{0}"

# ++CODE++4fa92e64c6fd59eb8e10f81f9bb32b19b6f5b292ba4d10e5892fc815fe7046a9
source: Listing databases for connection '{0}' (ID: {1})
es: Enumeración de bases de datos para la conexión "{0}" (Id.: {1})
it: Elenco dei database per la connessione "{0}" (ID: {1})
ru: Перечисление баз данных для подключения "{0}" (ИД: {1})

# ++CODE++e3540b429caa98528f0ed33c61c828ab32b5c66e3012740be4150a6b944e9e9b
source: Listing functions for connection '{0}' (ID: {1})
es: Enumeración de funciones para la conexión "{0}" (Id.: {1})
it: Elenco delle funzioni per la connessione "{0}" (ID: {1})
ru: Перечисление функций для подключения "{0}" (ИД: {1})

# ++CODE++df15d83efd9fc637dc083e4165d14496ddd68c309ef41be96ddf930de86fa600
source: Listing role assignments for workspace '${workspaceId}'
es: Lista de asignaciones de roles para el área de trabajo '${workspaceId}'
it: Elenco delle assegnazioni di ruolo per l'area di lavoro '${workspaceId}'
ru: Перечисление назначений ролей для рабочей области "${workspaceId}"

# ++CODE++7b6b5b260600f82e5603a11e04c3a2ebca15d51407c9e0e505eee43a3b909aa1
source: Listing schemas for connection '{0}' (ID: {1})
es: Enumeración de esquemas para la conexión "{0}" (Id.: {1})
it: Elenco degli schemi per la connessione "{0}" (ID: {1})
ru: Перечисление схем для подключения "{0}" (ИД: {1})

# ++CODE++5404755c79ce81c6dba13bc9b7f3cbea8d096f40ff5fb69bfce1a9b2f7a07d4f
source: Listing server connections
es: Enumeración de conexiones de servidor
fr: Liste des connexions au serveur
it: Elenco delle connessioni server
ru: Перечисление подключений к серверу

# ++CODE++44299d86125e08480228ddec1cca64ab01428cf64e8310f8bbfbc5642713a766
source: Listing tables for connection '{0}' (ID: {1})
es: Enumeración de tablas para la conexión "{0}" (Id.: {1})
it: Elenco delle tabelle per la connessione "{0}" (ID: {1})
ru: Перечисление таблиц для подключения "{0}" (ИД: {1})

# ++CODE++4115b66e355171d93bf284e1d2fd019eb40839a8ef6ee46dda787e0430c3c2cc
source: Listing views for connection '{0}' (ID: {1})
es: Enumeración de vistas para la conexión "{0}" (Id.: {1})
it: Elenco delle visualizzazioni per la connessione "{0}" (ID: {1})
ru: Перечисление представлений для подключения "{0}" (ИД: {1})

# ++CODE++8a6bdb6b18da586fe7f2acbd8f1055533f2cd97a3681b3652bcd712224df45c3
source: Load
es: Carga
fr: Charger
it: Carica
pt_br: Carregar
ru: Загрузить

# ++CODE++6b590dbe3ca2ba02770a0f91a1d06fddd3d9f474ffc479853d323f0545a6397b
source: Load from Connection String
es: Cargar desde cadena de conexión
fr: Charger à partir de la chaîne de connexion
it: Carica da stringa di connessione
pt_br: Carregar da Cadeia de Conexão
ru: Загрузить из строки подключения

# ++CODE++323ed460497fcfa6d1f92f52778381421eefa8ba36a3e9896b3f05a4a2050ca2
source: Load profile...
es: Perfil de carga...
it: Caricare profilo...
ru: Загрузка профиля...

# ++CODE++81b2b539fca979a0122cec8429386032584500cf44116d93ce90258970ee8289
source: Load source, target, and options saved in an .scmp file
es: Cargue el origen, el destino y las opciones guardadas en un archivo .scmp
fr: Charger la source, la cible et les options enregistrées dans un fichier .scmp
it: Carica origine, destinazione e opzioni salvate in un file con estensione scmp
pt_br: Carregar a origem, o destino e as opções salvas em um arquivo .scmp
ru: Загрузить источник, целевой объект и параметры, сохраненные в файле SCMP

# ++CODE++dc380888c4e2c7762212480ff86eb39150ec70b45009c33bc6adcbd0041384b1
source: Loading
es: Cargando
fr: Chargement
it: Caricamento
ja: 読み込み中
pt_br: Carregando
ru: Выполняется загрузка

# ++CODE++6fa7126ccca3880030902e857b23844499021637082687cfb79725ee3095e087
source: Loading Azure Accounts
es: Cargando cuentas de Azure
it: Caricamento degli account Azure
ru: Загрузка учетных записей Azure

# ++CODE++c11efeef9812b5933f66f281e1df758fca0d28ff6c96462aa5caa7a72f0637ed
source: Loading Fabric Accounts
es: Cargando cuentas de Fabric
it: Caricamento degli account Fabric
ru: Загрузка учетных записей Fabric

# ++CODE++f71c42d1d9ac676535360465df8ce04aacb3b40ecb8b1ba01906d9b4971a51c9
source: Loading Report
es: Cargando informe
fr: Rapport sur le chargement
it: Caricamento Report in corso
pt_br: Carregando Relatório
ru: Загрузка отчета

# ++CODE++fb77011a24ad32a2b166d3d74cf25aee9d67da4c5579e8740211e0738bd05a10
source: Loading Schema Designer
es: Cargando diseñador de esquemas
fr: Chargement du concepteur de schéma
it: Caricamento del Progettista schema
pt_br: Carregando o Designer de Esquema
ru: Загрузка конструктора схем

# ++CODE++54de42320518e4ac2e773353f4d9f9a7be92f4afc008a3b33a3247b39a19aa68
source: Loading Schema Designer Model...
es: Cargando modelo del Diseñador de esquemas...
fr: Chargement du modèle de concepteur de schéma...
it: Caricamento del modello di Designer dello schema...
pt_br: Carregando o Modelo do Designer de Esquema...
ru: Загружается модель схемы конструктора...

# ++CODE++10a371b8dc47cdf83c4cd7f926daf76305a6b52311a69b3087d744151dc53501
source: Loading Table Designer
es: Cargando Diseñador de tablas
fr: Concepteur de tables de chargement
it: Caricamento di Progettazione tabelle
ja: テーブル デザイナーを読み込んでいます
pt_br: Carregando Designer de Tabela
ru: Загружается конструктор таблиц

# ++CODE++f9c9f560fd60d852df849d8b9694f6e56be6ca531ec5366d75812345a7dbf567
source: Loading databases in '{0}'...
es: Cargando bases de datos en '{0}'...
it: Caricamento dei database in '{0}'...
ru: Загрузка баз данных в "{0}"...

# ++CODE++a67a8cf028d055264cd779f840ad3290cb70557277e6fe38ecf976fce921f030
source: Loading databases in selected workspace...
es: Cargando bases de datos en el área de trabajo seleccionada...
it: Caricamento dei database nell'area di lavoro selezionata...
ru: Загрузка баз данных в выбранной рабочей области...

# ++CODE++d1fdc252fab1c642cc1b487dbb6658fd77d5831e03b3d391b4c73b01226d75ff
source: Loading deployment
es: Carga de la implementación en curso
it: Caricamento della distribuzione
ru: Загрузка развертывания

# ++CODE++c4b5594f53462fcb5025d55e2ad5ba368c8fbb12de5a8701276b5477f7dd07fb
source: Loading execution plan...
es: Cargando plan de ejecución...
fr: Chargement du plan d’exécution...
it: Caricamento del piano di esecuzione...
ru: Загрузка плана выполнения...

# ++CODE++5aa7a4eb1f103858e56dc2f529435ff221afa8e7ff280a24ec6bbd810dd5b163
source: Loading fabric provisioning...
es: Cargando aprovisionamiento de Fabric...
it: Caricamento provisioning infrastruttura...
ru: Загрузка подготовки Fabric...

# ++CODE++934bbb16d95b8f72c6353bba1afc96aee3975ae50aaca4b3abe9389f292b4987
source: Loading local containers...
es: Cargando contenedores locales...
it: Caricamento dei contenitori locali in corso...
ru: Загрузка локальных контейнеров...

# ++CODE++b00da16333ce9b6f0088556c62cd8766f0a1f02a823e3dca0cd8fd040136e297
source: Loading results...
es: Cargando resultados...
it: Caricamento dei risultati...
ru: Загрузка результатов...

# ++CODE++71499b4de6ef3b8d0c19b76e76295f5dd9f5690a180de07ed861fdce757182aa
source: Loading summary for {0} rows (Click to cancel)
es: Cargando resumen de filas {0} (haga clic para cancelar)
it: Caricamento del riepilogo per {0} righe (fare clic per annullare)
ru: Загрузка сводки по {0} строкам (щелкните, чтобы отменить)

# ++CODE++128f2373a3147694ff5bcaab3d428611eba44a540cb348d9d263f855c0ee2a2d
source: Loading table data...
es: Cargando datos de tabla...
it: Caricamento dei dati della tabella in corso...
ru: Загрузка данных таблицы...

# ++CODE++6fdb41249bacbb3684e7217e3b3d938e36b39e8d0f4300681cba1968b3301495
source: Loading tenants...
es: Cargando inquilinos...
it: Caricamento dei tenant...
ru: Загрузка клиентов...
