Repository: microsoft/vscode-mssql
Catalog: localization/xliff/vscode-mssql.*.xlf
Languages: es, fr, it, ja, pt_br, ru

# ++CODE++70e9cc5a50f7eb5ba95c18dffd367c22caeef8814be8188d6af4f5654a8fc728
source: Application version must be in format n.n.n.n where n is a number (e.g., 1.0.0.0)
es: La versión de la aplicación debe tener el formato n.n.n.n, donde n es un número (por ejemplo, 1.0.0.0)
it: La versione dell'applicazione deve essere nel formato n.n.n.n dove n è un numero (ad esempio, 1.0.0.0)
ru: Версия приложения должна иметь формат n.n.n.n, где n — число (например, 1.0.0.0)

# ++CODE++31e392d1c0378beca611de66c0f4c71cba29159905cc54242d9bddee5b23d851
source: Apply
es: Aplicar
fr: Appliquer
it: Applica
pt_br: Aplicar
ru: Применить

# ++CODE++d80d0faa58963b92ed9852bcaab84b26d34ded47f6abe3ac786e9ad48c983aa2
source: Apply Changes
it: Applica modifiche
ru: Применить изменения

# ++CODE++757ac56c1f67056996dba37c6407eb302cbee2e590429afcb42210d125337f6a
source: Apply changes to target
es: Aplicar cambios al objetivo
fr: Appliquer les changements à la cible
it: Applica modifiche alla destinazione
pt_br: Aplicar alterações ao destino
ru: Применить изменения к целевому объекту

# ++CODE++c4a87b18e24f113de61cbf89c652cf2ecc1d73abd2d01baf409c174c8242ef7d
source: Apply contextual suggestions for SQL syntax, relationships, and constraints
es: Aplicar sugerencias contextuales para la sintaxis, las relaciones y las restricciones de SQL
it: Applica suggerimenti contestuali per sintassi, relazioni e vincoli SQL
ru: Используйте контекстные предложения для синтаксиса SQL, связей и ограничений

# ++CODE++6007acbe30b2cd98703e83350ea665c06009fcd51f26dd73b309294235f45f21
source: Approve
es: Aprobar
fr: Approuver
it: Approva
ru: Утвердить

# ++CODE++9d9d0bfa74aaf1db2f58269ddd7f7e8141a4069574d576aab3174f0f810ad1e0
source: Are you sure you want to delete the container {0}? This will remove both the container and its connection from VS Code.
es: ¿Está seguro de que desea eliminar el contenedor {0}? Esto quitará el contenedor y su conexión de VS Code.
fr: Voulez-vous vraiment supprimer le conteneur {0} ? Cette opération supprimera le conteneur et sa connexion de VS Code.
it: Eliminare il contenitore {0}? Questo rimuoverà sia il contenitore che la sua connessione da VS Code.
ru: Действительно удалить контейнер {0}? При этом из VS Code будет удален и контейнер, и его подключение.

# ++CODE++dc1158b4986e0eadcc929a35b9de0147ca4e8e317ec963db232cb2516688ed79
source: Are you sure you want to delete the selected items?
es: ¿Está seguro de que desea eliminar los elementos seleccionados?
fr: Voulez-vous vraiment supprimer les éléments sélectionnés ?
it: Eliminare gli elementi selezionati?
ru: Вы действительно хотите удалить выбранные объекты?

# ++CODE++64f0ebe202fcbb5561671715f3bff0cf6b5219648ffe9bca961824b243d4c5bc
source: Are you sure you want to delete {0}?
es: ¿Seguro que quiere eliminar {0}?
fr: Voulez-vous vraiment supprimer {0} ?
it: Eliminare {0}?
ru: Удалить {0}?

# ++CODE++26c70151bceb55fb84b8e652a205659bd5736420cfa72a4e3fa92bdaa5a3b526
source: Are you sure you want to delete {0}? You can delete its connections as well, or move them to the root folder.
es: ¿Estás seguro de que desea eliminar {0}? También puede eliminar sus conexiones o moverlas a la carpeta raíz.
fr: Voulez-vous vraiment supprimer {0} ? Vous pouvez également supprimer ses connexions ou les déplacer vers le dossier racine.
it: Eliminare {0}? È anche possibile eliminare le relative connessioni o spostarle nella cartella radice.
ru: Действительно удалить {0}? Также можно удалить подключения этой группы или переместить их в корневую папку.

# ++CODE++3d283f80f43f1833dcab882ad9efc24a86c0b17b0febb10fc37336590a7016e1
source: Are you sure you want to disconnect?
es: ¿Seguro que quiere desconectar?
fr: Voulez-vous vraiment vous déconnecter ?
it: Disconnettersi?
ja: 切断しますか?
pt_br: Tem certeza de que deseja desconectar?
ru: Вы действительно хотите разорвать подключение?

# ++CODE++8a6ddc1941c7b1576cc5674f2969dde12347408d66861ed151f2ed506588f42c
source: Are you sure you want to remove {0}?
es: ¿Está seguro de que desea quitar {0}?
fr: Voulez-vous vraiment supprimer {0} ?
it: Rimuovere {0}?
ru: Действительно удалить {0}?

# ++CODE++2f582613dd0458d381445844942f7e490b54f428e2c1e42e8c7643e1aa646a17
source: Are you sure you want to update the target?
es: ¿Seguro de que desea actualizar el destino?
fr: Voulez-vous vraiment mettre à jour la cible ?
it: Aggiornare la destinazione?
pt_br: Tem certeza de que deseja atualizar o destino?
ru: Вы действительно хотите обновить целевой объект?

# ++CODE++7eef7067697ade3fc0f13737f97978c65df37d0c48ff8f50718f6062f6e6e246
source: Are you sure you want to {0}?
es: ¿Está seguro de que quiere {0}?
fr: Voulez-vous vraiment {0} ?
it: Si vuole {0}?
pt_br: Tem certeza de que deseja {0}?
ru: Вы действительно хотите {0}?

# ++CODE++f0762c4f3bfcd695e32e7fcd087dc2a60bc26cda108b4fc0a643445b397168c7
source: Are you sure?
es: ¿Está seguro?
fr: Êtes-vous sûr(e) ?
it: Procedere?
pt_br: Tem certeza?
ru: Вы уверены?

# ++CODE++8ff1f9a47f14327a26fd3a548d2babeec226cb63828a0803433b4a34a19c09ff
source: Auth type
it: Tipo di autenticazione
ru: Тип аутентификации

# ++CODE++6ab694cfc6fa5d8c7045d318bba5f3eb791ab0a859ea54c54b1c660a4ccf8ed1
source: Authenticated
it: Autenticato
ru: Проверка подлинности выполнена

# ++CODE++66880d2d8216260d201917a72eb245440ef18ba9b54c070ee39aa4c343ae126f
source: Authentication
es: Autenticación
it: Autenticazione
ru: Проверка подлинности

# ++CODE++eccf8ea40318babf1bd28fa823e0fa905383eed481da5fccb9f54ea4a6152943
source: Authentication Library has changed, please reload Visual Studio Code.
es: La biblioteca de autenticación ha cambiado. Vuelva a cargar Visual Studio Code.
fr: La bibliothèque d’authentification a changé, veuillez recharger Visual Studio Code.
it: La libreria di autenticazione è stata modificata. Ricarica Visual Studio Code.
ja: 認証ライブラリが変更されました。Visual Studio Code を再読み込みしてください。
pt_br: A Biblioteca de Autenticação foi alterada, recarregue o Visual Studio Code.
ru: Библиотека проверки подлинности изменена. Перезагрузите Visual Studio Code.

# ++CODE++53c90adec54ba3992244fa9a6edbef327f573af7d2c99f2a110ba57949283b38
source: Authentication Type
es: Tipo de autenticación
fr: Type d’authentification
it: Tipo di autenticazione
ja: 認証の種類
pt_br: Tipo de Autenticação
ru: Тип проверки подлинности

# ++CODE++9a1bed14bd9674de782c072cb0e866910c7df51326e29f8a0bea807d4791a7e6
source: Authentication error for account '{0}' (tenant '{1}'). Resolving this requires clearing your token cache, which will sign you out of all connected accounts.
es: Error de autenticación para la cuenta '{0}' (inquilino '{1}'). Para resolverlo, es necesario borrar la caché de tokens, lo que cerrará la sesión de todas las cuentas conectadas.
fr: Une erreur d’authentification s’est produite pour le compte « {0} » (locataire « {1} »). Pour résoudre ce problème, vous devez effacer votre cache de jetons. Cela entraînera votre déconnexion de tous les comptes connectés.
it: Errore di autenticazione per l'account '{0}' (tenant '{1}'). Per risolvere il problema, è necessario cancellare la cache dei token, il che comporterà la disconnessione da tutti gli account connessi.
ru: Ошибка проверки подлинности для учетной записи "{0}" (клиент "{1}"). Для решения этой проблемы необходимо очистить кэш токенов, что приведет к выходу из всех подключенных учетных записей.

# ++CODE++b1b511843263fa8435aafed7abebc29efd242c576fd5d386e04e349e7288e092
source: Authentication error for account. Resolving this requires clearing your token cache, which will sign you out of all connected accounts.
es: Error de autenticación de la cuenta. Para resolverlo, es necesario borrar la caché de tokens, lo que cerrará la sesión de todas las cuentas conectadas.
fr: Erreur d’authentification d’un compte. Pour résoudre ce problème, vous devez effacer votre cache de jetons. Cela entraînera votre déconnexion de tous les comptes connectés.
it: Errore di autenticazione per l'account. Per risolvere il problema, è necessario cancellare la cache dei token, il che comporterà la disconnessione da tutti gli account connessi.
ru: Ошибка проверки подлинности для учетной записи. Для решения этой проблемы необходимо очистить кэш токенов, что приведет к выходу из всех подключенных учетных записей.

# ++CODE++439a99b0935fb17d372edb14b699ddd05330257d8c40b464365c1129bdf94d6a
source: Authentication failed due to a nonce mismatch, please close Azure Data Studio and try again.
es: Error de autenticación debido a una discrepancia de nonce. Cierre Azure Data Studio y vuelva a intentarlo.
fr: L’authentification a échoué en raison d’une incompatibilité de nonce, fermez Azure Data Studio et réessayez.
it: L'autenticazione non è riuscita a causa di una mancata corrispondenza dei nonce. Chiudere Azure Data Studio e riprovare.
ja: nonce の不一致のため、認証に失敗しました。 Azure Data Studio を閉じてから、もう一度お試しください。
pt_br: Falha na autenticação devido a uma incompatibilidade de nonce. Feche o Azure Data Studio e tente novamente.
ru: Не удалось выполнить проверку подлинности из-за несоответствия nonce, закройте Azure Data Studio и повторите попытку.

# ++CODE++13bab964ffdfa4aca05306fd4c1f3e7aed36fb36a62c85dc6ef588e841299878
source: Authentication failed due to a state mismatch, please close ADS and try again.
es: Error de autenticación debido a una discrepancia de estados. Cierre ADS y vuelva a intentarlo.
fr: L’authentification a échoué en raison d’une incompatibilité d’état. Veuillez fermer ADS, puis réessayez.
it: L'autenticazione non è riuscita a causa di una mancata corrispondenza degli stati. Chiudere ADS e riprovare.
ja: 状態の不一致のため、認証に失敗しました。 ADS を終了してから、もう一度お試しください。
pt_br: Falha na autenticação devido a uma incompatibilidade de estado. Feche o ADS e tente novamente.
ru: Не удалось выполнить проверку подлинности из-за несоответствия состояния, закройте ADS и повторите попытку.

# ++CODE++a06725099766746b634d3d1caf6928e6553311ad0e910f795ab97c69fac0f246
source: Authorization Role
it: Ruolo autorizzazione
ru: Роль авторизации

# ++CODE++d58bbb838e095ea400fb432477d5657a6b5a32da8da836299f4f7e20020bb42d
source: Auto Arrange
es: Organización automática
fr: Réorganisation automatique
it: Disposizione automatica
pt_br: Organizar Automaticamente
ru: Разместить автоматически

# ++CODE++ebe205c96ccbd815b1ba5c318ebfad7ce72d76dfea65929bf8c5203cd0c72a93
source: Auto Arrange Confirmation
es: Confirmar organización automática
fr: Confirmation de la disposition automatique
it: Conferma disposizione automatica
ru: Подтверждение автоматического упорядочивания

# ++CODE++a27adfa57c8938761efd3fc482ea8e81fc898b286f29d04c783c9d3b60b22824
source: Auto Arrange will automatically reposition all diagram elements based on optimal layout algorithms. Any custom positioning you've created will be lost. Do you want to proceed with auto-arranging your schema diagram?
es: La organización automática cambia automáticamente la posición de todos los elementos del diagrama en función de los algoritmos de diseño óptimos. Se perderá cualquier posicionamiento personalizado que haya creado. ¿Desea continuar con la organización automática de su diagrama de esquema?
fr: La disposition automatique repositionne tous les éléments du diagramme en fonction d’algorithmes de disposition optimaux. Tout positionnement personnalisé créé sera perdu. Voulez-vous procéder à la disposition automatique de votre diagramme de schéma ?
it: Disposizione automatica riposizionerà automaticamente tutti gli elementi del diagramma in base ad algoritmi di layout ottimizzati. Eventuali posizionamenti personalizzati creati andranno persi. Vuoi procedere con la disposizione automatica del diagramma dello schema?
ru: Автоматическое упорядочивание автоматически изменит размещение всех элементов диаграммы на основе оптимальных алгоритмов макета. Созданное вами настраиваемое размещение будут потеряно. Вы хотите продолжить автоматическое упорядочивание диаграммы схемы?

# ++CODE++0b88b412b158e1648835456305f857b2228f04cdd61b08afc1924ea48fcee4c0
source: Automatic tuning features like automatic index creation enabled by default.
es: Las características de ajuste automático, como la creación automática de índices, están habilitadas de forma predeterminada.
it: Funzionalità di ottimizzazione automatica come la creazione automatica dell'indice abilitate per impostazione predefinita.
ru: Функции автоматической настройки, например автоматическое создание индексов, включены по умолчанию.

# ++CODE++87cdec8b1acc8c61a853ce73e9707a8a0c55e57922ff53e108262128e97553f2
source: Available Servers
es: Servidores disponibles
it: Server disponibili
ru: Доступные серверы

# ++CODE++fb226d6b73aa48dadaf6a46992c5d7a707fb8d1fe58b0865de04d08c848fecff
source: Average: {0}
es: Promedio: {0}
it: Media: {0}
ru: Среднее: {0}

# ++CODE++8dd4f3a846ac5cf5452d53cc438aaae7ad47df96a29ad32857a87718cdeefbca
source: Average: {0} Count: {1} Sum: {2}
es: Promedio: {0}; recuento: {1}; suma: {2}
fr: Moyenne : {0}, nombre : {1}, somme : {2}
it: Media: {0} Conteggio: {1} Somma: {2}
pt_br: Média: {0} Contagem: {1} Soma: {2}
ru: Среднее значение: {0} Количество: {1} Сумма: {2}

# ++CODE++994c049faf0fd65f191759cacf91508d01743fda1b2f06cfc7f779fc49ae4991
source: Azure (China)
it: Azure (Cina)
ru: Azure (Китай)

# ++CODE++cdf9c75db21efc1ddc557d567de91e9bc67533606ce4bbc049c592d77f122e68
source: Azure (Public)
es: Azure (público)
it: Azure (pubblico)
ru: Azure (общедоступная служба)

# ++CODE++63d6f58b83d48a7543f95534cb99f84ecd4273176e77feb7fd925ecbd81a4f39
source: Azure Account
es: Cuenta de Azure
fr: Compte Azure
it: Account Azure
ja: Azure アカウント
pt_br: Conta do Azure
ru: Учетная запись Azure

# ++CODE++34ec466979918ed648dd5ae40b41e849fa6398b0d0a5f076ac3b0061d149d168
source: Azure Code Grant
es: Concesión de código de Azure
fr: Octroi de code Azure
it: Concessione codice di Azure
ja: Azure コードの付与
pt_br: Concessão de Código do Azure
ru: Предоставление кода Azure

# ++CODE++cbf1176900b828464cac58d4ab7b00aa01cb741cabb584e87ddc6835b0c9d223
source: Azure Data Studio Connection Migration Toolkit
it: Toolkit di migrazione delle connessioni di Azure Data Studio
ru: Набор инструментов миграции подключений Azure Data Studio

# ++CODE++efc3409dd68fd9fbc2ec4fa00216475abce7178376f44e57227516047ae5eaad
source: Azure Data Studio Migration
it: Migrazione di Azure Data Studio
ru: Миграция в Azure Data Studio

# ++CODE++c7263257490ce016e7b8fc8e7bedffe87c0f9317fa4760b8f6d265bc5de8bce2
source: Azure Data Studio Migration - Connections
it: Migrazione di Azure Data Studio - Connessioni
ru: Миграция Azure Data Studio — подключения

# ++CODE++386d70c1c775d30bdadd4cb0db6b7e6d55f6fce325963f190afcdf24cf67f7b7
source: Azure Data Studio settings file
it: File di impostazioni di Azure Data Studio
ru: Файл параметров Azure Data Studio

# ++CODE++c5023bdd36d362e05c245ab15ab6839ad7562bcd42f1e1b0c759dca9d5fec4f7
source: Azure Device Code
es: Código de dispositivo de Azure
fr: Code d’appareil Azure
it: Codice dispositivo di Azure
ja: Azure デバイス コード
pt_br: Código de Dispositivo do Azure
ru: Код устройства Azure

# ++CODE++aa3e45296e9592fa302b1adc67d9b4467e467a4ffa11fee0c0430063a3372707
source: Azure MFA
it: Autenticazione a più fattori di Azure

# ++CODE++314afcc6e23d362133e764e1ebfacabe4d330308b528392570949a17270248b9
source: Azure sign in failed.
es: Error al iniciar sesión en Azure.
fr: La connexion Azure a échoué.
it: L'accesso ad Azure non è riuscito.
pt_br: Falha ao entrar no Azure.
ru: Сбой входа в Azure.

# ++CODE++f71dfcecebed757febe54c711e436e17521c71da90d4c5cc61ef6717918173a4
source: Azure: Sign In
es: Azure: Iniciar sesión
fr: Azure : Se connecter
it: Azure: Accedi
ja: Azure: サインイン
pt_br: Azure: Entrar
ru: Azure: вход

# ++CODE++e23a962d1e7c0f13d0ebf6da9eb0d8bf43afcb391bcbb9227c3939d932219dad
source: Azure: Sign In to Azure Cloud
es: Azure: Iniciar sesión en Azure Cloud
fr: Azure : Connexion au cloud Azure
it: Azure: Accedi a Cloud di Azure
ja: Azure: Azure Cloud にサインイン
pt_br: Azure: entrar no Azure Cloud
ru: Azure: вход в облако Azure

# ++CODE++29852e83a6613ccf439cb69654f96550fd0ce1de27609b5167992cef02a9ea55
source: Azure: Sign In with Device Code
es: Azure: Iniciar sesión con código de dispositivo
fr: Azure : Connexion avec un code d’appareil
it: Azure: Accedi con codice dispositivo
ja: Azure: デバイス コードを使ってサインイン
pt_br: Azure: entrar com o Código do Dispositivo
ru: Azure: войдите с кодом устройства

# ++CODE++3f0ddb46dd6305bf6e540e48d31bb83d2b269566ab7d0c8b742bf37022ee716b
source: BACPAC exported successfully
es: BACPAC exportados correctamente
it: Esportazione BACPAC eseguita correttamente
ru: BACPAC экспортирован

# ++CODE++c77ba6ce31916c226def02930b4f3867d3bba2e1814b5528c12d5b3b62828eca
source: BACPAC exported successfully to '{0}'
es: BACPAC exportados correctamente a '{0}'
it: BACPAC esportato in ''{0}''
ru: BACPAC экспортирован в "{0}"

# ++CODE++2ba87440799be3f6c8b0aa29316cf97584087cc46962e689c375699adb392137
source: BACPAC imported successfully
es: BACPAC importado correctamente
it: Importazione BACPAC eseguita correttamente
ru: BACPAC импортирован

# ++CODE++98dbbe35459fbe282206441874ff66bc527f1c735eb99367c073ac68f713c396
source: BACPAC imported successfully to database '{0}'
es: BACPAC se importó correctamente en la base de datos '{0}'
it: Bacpac importato nel database ''{0}''
ru: BACPAC импортирован в базу данных "{0}"

# ++CODE++76900f1bfd16c8d4dd3d25e6f46638d7165aee23883ccea6bfe071c514421769
source: Back
es: Atrás
it: Indietro
ru: Назад

# ++CODE++760bb46db5b9f7594d6a52062c3f044fac1a2dc55ec95bfd659eb345bd1425fa
source: Back to Schema
it: Torna allo schema
ru: Вернуться к схеме

# ++CODE++e6885d7f1ab90cd7529fb7e3690957e6324d73e7a2dc017014bb9667d7524a76
source: Back to preview
es: Volver a la vista previa
fr: Retour à la préversion
it: Torna all’anteprima
pt_br: Voltar à versão prévia
ru: Вернуться к предварительному просмотру

# ++CODE++785f39d515b5f700c4f9cfec99b46d49fdc412522e0e24a9316fc25e7bfd06a3
source: Batch execution time: {0}
es: Tiempo de ejecución por lotes: {0}
fr: Durée d’exécution du lot : {0}
it: Tempo di esecuzione del batch: {0}
ja: バッチ実行時間: {0}
pt_br: Tempo de execução em lote: {0}
ru: Время выполнения пакета: {0}

# ++CODE++c1ea3f5e7aa473034872296473c7fcf9c79344355ba4fd003120627f6ec1a5f7
source: Between
es: Entre
fr: Entre
it: Tra
ja: 指定範囲内
pt_br: Entre
ru: Между

# ++CODE++79654f98221029c4c838b279ed9a41aa49c8a3cdb1cc95d81a456c510e6854d0
source: Blanks
es: Espacios en blanco
fr: Vides
it: Vuoti
pt_br: Lacunas
ru: Пустые

# ++CODE++886089b371ee3596c742b0c91467d1b7239b1d7f8f3eb86b88c1304644266abc
source: Block this extension from accessing your connections
es: Impedir que esta extensión acceda a las conexiones
fr: Empêcher cette extension d’accéder à vos connexions
it: Impedire a questa estensione di accedere alle connessioni
ru: Запретить этому расширению доступ к вашим подключениям

# ++CODE++ec811d30a89ce96d1c7555ffaede78b188fedb1d283adf7cdf55a4edae6697a7
source: Brightness
es: Luminosidad
fr: Luminosité
it: Luminosità
ru: Яркость

# ++CODE++1de7cc215a806b6a7f80087b52123f4ec362c12f3eff680663047c72d2c01bdb
source: Bring your saved connections from Azure Data Studio into the MSSQL extension and discover familiar experiences.
it: Importare le connessioni salvate da Azure Data Studio nell'estensione MSSQL e scoprire esperienze familiari.
ru: Перенесите сохранённые подключения из Azure Data Studio в расширение MSSQL и откройте для себя знакомые возможности.

# ++CODE++3227aa9666253f7a736509074fb83bc4d47b19582faaa0233f228746de29217a
source: Browse
es: Explorar
it: Esplora
ru: Просмотреть

# ++CODE++221cedb44469e4b0b105f777c771d70c7097c40a4e3e914cec4b6ba266db1970
source: Browse Azure
es: Examinar Azure
fr: Parcourir Azure
it: Esplora Azure
ja: Azure を参照
pt_br: Procurar no Azure
ru: Обзор Azure

# ++CODE++d2945638af819132af21f6c456f562493e7bf76e6ce1bb782eeef16cbfbeb85b
source: Browse By
es: Buscar por
it: Sfoglia per
ru: Просмотр по

# ++CODE++9b0636db073a79048ef4de667c447e516b7241e55ecf311c2a6f1fbe662574a1
source: Browse Fabric
es: Examinar Fabric
it: Esplora infrastruttura
ru: Обзор Fabric

# ++CODE++043f707c8797404ec37a61f1a7ffa6be1279cc285b1889771b5f464e8dcaedde
source: Browse to Azure Data Studio settings.json
it: Selezionare il file settings.json di Azure Data Studio
ru: Перейти к файлу Azure Data Studio settings.json

# ++CODE++c58a6bd402efb06c3e7dfd6d68910412fee2dfc1788ae384dc123089ce912285
source: Browse...
es: Examinar...
it: Sfoglia...
ru: Обзор...

# ++CODE++00ea757097babdd3471ed3dbcef6f4a33b46658dfb023aa009b53fa1dd0ae30c
source: Build failed with exit code {0}
es: La compilación falló con el código de salida {0}
it: Compilazione non riuscita con codice di uscita {0}
ru: Сбой сборки с кодом завершения {0}

# ++CODE++070df86dfd0e7f4066a971ef2e0d5b9ee8ddbb826c4edf0924026bca37ac603f
source: Build {0}
es: Compilar {0}
it: Compila {0}
ru: Сборка {0}

# ++CODE++9168a1046e45504ed34edeecd99ec73be336161e82395399aa9a3c1d912be6b2
source: Building {0}...
es: Compilando {0}...
it: Compilazione di {0} in corso...
ru: Сборка {0}...

# ++CODE++d9a998bc5b0b1a8720c33d843590e55895977f19f6d8f56e440c778b673ab17a
source: Calling tool: {0} with {1}.
es: Llamando a la herramienta: {0} con {1}.
fr: Appel de l’outil : {0} avec {1}.
it: Strumento per chiamate: {0} con {1}.
ru: Вызов инструмента: {0} с {1}.

# ++CODE++19766ed6ccb2f4a32778eed80d1928d2c87a18d7c275ccb163ec6709d3eb2e27
source: Cancel
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
pt_br: Cancelar
ru: Отмена

# ++CODE++a6dab3e65af40b4f3bca5c056278a22a48972adfa26a46fa3cc16aa4e07e86e0
source: Cancel failed: {0}
es: No se pudo cancelar: {0}
fr: Échec de l’annulation : {0}
it: Annullamento non riuscito: {0}
ru: Не удалось отменить: {0}

# ++CODE++d6efd131712ed1115d720d4cfdb68b1819ad1de1587f4c2176c9c055c7c03a67
source: Cancel schema compare failed: '{0}'
es: Error al cancelar la comparación de esquemas: "{0}"
fr: L'annulation de Comparer les schémas a échoué : « {0} »
it: L'annullamento del confronto schemi non è riuscito: '{0}'
pt_br: Falha no cancelamento da comparação de esquemas: '{0}'
ru: Сбой при отмене сравнения схем: "{0}"

# ++CODE++13ca2ee2499310d97a5515fb5fd80b75da66f4cf2775273658eb2b3fdcd3bd3d
source: Canceled
es: Cancelado
fr: Annulé
it: Annullato
ja: キャンセル済み
pt_br: Cancelado
ru: Отменено

# ++CODE++f0f958e0da473b18b76ef9febe543579a601b532c9acd58ddab45f2d6549a3b3
source: Canceling
es: Cancelando
fr: Annulation en cours
it: In fase di annullamento
ja: 取り消し中
pt_br: Cancelando
ru: Производится отмена

# ++CODE++e98afd3714a8d3c15f84793e425b681975e26f06503850e4122965ee9825e907
source: Canceling query
es: Cancelando la consulta
fr: Annulation de la requête
it: Annullamento della query
ja: クエリを取り消しています
pt_br: Cancelando a consulta
ru: Отмена запроса

# ++CODE++a3b871209f5c0ce02e28669f9d6aeb1bd614ecdbd7e18a413fcc9a40e666fa59
source: Canceling the query failed: {0}
es: Error al cancelar la consulta: {0}
fr: L’annulation de la requête a échoué : {0}
it: Annullamento della query non riuscito: {0}
ja: 失敗したクエリの取り消し中: {0}
pt_br: Falha no cancelamento da consulta: {0}
ru: Ошибка при попытке отмены запроса: {0}

# ++CODE++6a091418a02336bbb67e1aefe9453dc51828139a059a7f3cae6044273c277a54
source: Cannot cancel query as no query is running.
es: No se puede cancelar la consulta, porque no hay ninguna en ejecución.
fr: Impossible d’annuler la requête, car aucune requête n’est en cours d’exécution.
it: Non è possibile annullare la query perché non ci sono query in esecuzione.
ja: クエリが実行されていないため、クエリをキャンセルできません。
pt_br: Não é possível cancelar a consulta, pois não há consulta em execução.
ru: Невозможно отменить запрос, так как ни один запрос не выполняется.
